{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/pset2_logfile.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Oct 2023, 12:48:50
{txt}
{com}. 
. 
. set more off
{txt}
{com}. set varabbrev off
{txt}
{com}. set linesize 255
{txt}
{com}. 
. 
. if "`c(username)'" == "yfkashlan" {c -(}
.         
.         global do_loc  "//Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata"
.         global dta_loc "//Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data"
.         
.         // programs
.         net set ado "//Client/C$\Users/yfkas/Documents/stata_packages"
.         adopath + "//Client/C$/Users/yfkas/Documents/stata_packages"
{txt}  [1]  (BASE)      "{res}C:\Program Files\Stata16\ado\base/{txt}"
  [2]  (SITE)      "{res}C:\Program Files\Stata16\ado\site/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}C:\Users\yfkashlan\ado\personal/{txt}"
  [5]  (PLUS)      "{res}c:\ado\plus/{txt}"
  [6]  (OLDPLACE)  "{res}c:\ado/{txt}"
  [7]              "{res}//Client/C$/Users/yfkas/Documents/stata_packages{txt}"
{com}.         
. {c )-}
{txt}
{com}. 
. if "`c(username)'" == "rajdevb" {c -(}
. 
.         local mainfolder "/Users/rajdevb"
.         
.         global do_loc   "`mainfolder'/Desktop/GIT_RajdevBrar/GitHub_are213/ARE213_Fall2023"
.         global dta_loc  "`mainfolder'/Dropbox/ARE213/Pset1"
. {c )-}
{txt}
{com}. 
. // install programs
. // do "$do_loc/Code/01_programs.do"
. 
. // analyze
. do "$do_loc/Code/02_analysis_q1.do"
{txt}
{com}. /*
> Title:          02_analysis_q1.do
> Outline:        Question 1, PSet 2 
> 
> Q1a
>         1. Is the panel balanced (a.k.a. complete)? 
>         2. Visualize the timing of primary belt laws.
>         3. Are there any reversals of primary belt laws? 
>         4. Are there never-treated states? 
>         5. How does the timing of primary and secondary belt laws relate to each other?
> 
> Q1b Compare log fatilities per capita with fatality count
> Q1c Plot outcome in an informative way. Interpret.
> 
> */
. 
.                         
. 
. * ============================================================================= *
. * Question 1
. * ============================================================================= *
. 
. use "$dta_loc/pset2", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. 
. count if primary == 1 & secondary == 1 // no state applies both laws at once
  {res}0
{txt}
{com}. 
. 
. // Q1a.1 ----------------------
. preserve
{txt}
{com}.         byso state  : egen state_ct = count(year)
{txt}
{com}.         tab state_ct 

   {txt}state_ct {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         23 {c |}{res}      1,104      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,104      100.00
{txt}
{com}. 
.         byso year  : egen year_ct = count(state)
{txt}
{com}.         tab year_ct 

    {txt}year_ct {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         48 {c |}{res}      1,104      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,104      100.00
{txt}
{com}. 
.         gen bal_test = 0 // generate a variable without missing values
{txt}
{com}.         keep state year bal_test
{txt}
{com}.         reshape wide bal_test, i(state) j(year)
{txt}(note: j = 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}    1104   {txt}->{res}      48
{txt}Number of variables            {res}       3   {txt}->{res}      24
{txt}j variable (23 values)             {res}year   {txt}->   (dropped)
xij variables:
                               {res}bal_test   {txt}->   {res}bal_test1981 bal_test1982 ... bal_test2003
{txt}{hline 77}

{com}.         // If the i-j combination contains a missing value for primary, 
.         // then reshape returns a missing value
. 
.         foreach var of varlist bal_test* {c -(}
{txt}  2{com}.                 assert `var' != .
{txt}  3{com}.         {c )-}
{txt}
{com}. restore
{txt}
{com}. // ANS: balanced indeed
. 
. 
. // Q1a.2 ----------------------
. // twoway (line primary year if state == 1) ///
. //         (line primary year if state == 4)
. 
. // I can't run this on my computer for some reason :(
. *panelview primary, i(state) t(year) type(treat)
. 
. 
. // Q1a.3 ----------------------
. preserve 
{txt}
{com}. //      br state year primary
. //      keep state year primary
.         byso state (year) : gen prim_delta = primary[_n]-primary[_n-1]
{txt}(48 missing values generated)

{com}.         assert prim_delta >= 0 | prim_delta == . 
{txt}
{com}. restore
{txt}
{com}. // ANS: Change in primary law within states is never negative
. 
. 
. // Q1a.4 ----------------------
. byso state : egen prim_ever = max(primary)
{txt}
{com}. preserve 
{txt}
{com}.         collapse (max) prim_ever, by(state)
{txt}
{com}.         count if prim_ever == 0 
  {res}30
{txt}
{com}. restore
{txt}
{com}. // ANS: 30 states are never-treated
. 
. 
. // Q1a.5 ----------------------
. preserve
{txt}
{com}.         keep state year primary secondary
{txt}
{com}.         count if primary == 1 & secondary == 1 // no state applies both laws at once
  {res}0
{txt}
{com}.         foreach law in primary secondary {c -(}
{txt}  2{com}.                 gen year_`law' = year if `law' == 1
{txt}  3{com}.         {c )-}
{txt}(922 missing values generated)
(589 missing values generated)

{com}.         byso state secondary (year) : egen yr_sec_end = max(year_secondary)
{txt}(589 missing values generated)

{com}.         byso state primary (year) : egen yr_prim_start = min(year_primary)
{txt}(922 missing values generated)

{com}.         sort state year primary secondary
{txt}
{com}.         collapse (mean) yr_sec_end yr_prim_start , by(state)
{txt}
{com}.         assert yr_sec_end < yr_prim_start if !missing(yr_prim_start) & !missing(yr_sec_end)
{txt}
{com}.         assert yr_sec_end + 1 == yr_prim_start if !missing(yr_prim_start) & !missing(yr_sec_end)
{txt}
{com}. restore
{txt}
{com}. // ANS: Primary and secondary laws never overlapped. 
. // Primary laws were adopted (if at all) one year after secondary laws were phased out.
. 
. // correlate adopting prim and sec within state
. preserve
{txt}
{com}.         collapse (max) primary secondary , by(state)
{txt}
{com}.         corr primary secondary 
{txt}(obs=48)

             {c |}  primary second~y
{hline 13}{c +}{hline 18}
     primary {c |}{res}   1.0000
   {txt}secondary {c |}{res}  -0.4619   1.0000

{txt}
{com}.         tab primary secondary 

     {txt}(max) {c |}    (max) secondary
   primary {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         1         29 {txt}{c |}{res}        30 
{txt}         1 {c |}{res}         7         11 {txt}{c |}{res}        18 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}         8         40 {txt}{c |}{res}        48 
{txt}
{com}.         // not immediately useful
. restore
{txt}
{com}. 
. 
. // Q1b ----------------------
. gen fat_pc = fatalities/population
{txt}
{com}. gen ln_fat_pc = ln(fatalities/population)
{txt}
{com}. label var ln_fat_pc "Log fatalities per capita"
{txt}
{com}. // hist ln_fat_pc
. // ANS: taking the log of the fraction of fatalities per capita (the outcome) 
. // is a good idea because it normalizes its distribution.
. 
. 
. // Q1c ----------------------
. 
. /*
> // First try
> collapse (mean) fatalities ln_fat_pc fat_pc, by(prim_ever year)
> // States that adopt the law have lower log fatalities/cap every year
> twoway (scatter ln_fat_pc year if prim_ever == 0) ///
>            (scatter ln_fat_pc year if prim_ever == 1), ///
>                 legend(label(1 "Never treated") label(2 "Treated"))
> 
> // States that adopt the law have higher total fatalities every year
> twoway (scatter fatalities year if prim_ever == 0) ///
>            (scatter fatalities year if prim_ever == 1), ///
>                 legend(label(1 "Never treated") label(2 "Treated"))
> 
> // States that adopt the law have lower fatalities/cap every year
> twoway (scatter fat_pc year if prim_ever == 0) ///
>            (scatter fat_pc year if prim_ever == 1), ///
>                 legend(label(1 "Never treated") label(2 "Treated"))
> 
> // Can also do relative to event time
> gen year_primary = year if primary == 1
> byso state primary (year) : egen yr_prim_start = min(year_primary)
> byso state (yr_prim_start): replace yr_prim_start = yr_prim_start[1]
> gen yr_relative = year - yr_prim_start if yr_prim_start != .
> sort state year
> tab yr_relative
> // hard to choose cutoff
> */
. 
. 
. // Plot raw data as in his "favorite event plot" by Fadlon and Nielsen (2015)
. // plot a few states that do and do not adopt with vertical lines for E_i
. gen year_primary = year if primary == 1
{txt}(922 missing values generated)

{com}. byso state primary (year) : egen cohort = min(year_primary)
{txt}(922 missing values generated)

{com}. byso state (cohort): replace cohort = cohort[1]
{txt}(232 real changes made)

{com}. replace cohort = 999 if cohort == .
{txt}(690 real changes made)

{com}. 
. sort state year // clean up
{txt}
{com}. drop year_primary
{txt}
{com}. 
. label define cohort 999 "No shock" ///
>                          1984 "1984" ///
>                          1986 "1986" ///
>                          1987 "1987" ///
>                          1991 "1991" ///
>                          1993 "1993" ///
>                          1996 "1996" ///
>                          1998 "1998" ///
>                          2000 "2000" ///
>                          2002 "2002" ///
>                          2003 "2003"
{txt}
{com}. label values cohort cohort
{txt}
{com}. 
. preserve
{txt}
{com}.         collapse (mean) fatalities ln_fat_pc fat_pc, by(cohort year)
{txt}
{com}. 
.         // plot raw data by cohort with vertical E_i
.         twoway (line ln_fat_pc year if cohort == 999, lcolor(black) ) ///
>                    (line ln_fat_pc year if cohort == 1984, lcolor(ebblue) ) ///
>                    (line ln_fat_pc year if cohort == 1987, lcolor(gs10) ) ///
>                    (line ln_fat_pc year if cohort == 1993, lcolor(midgreen) ) ///
>                    (line ln_fat_pc year if cohort == 2002, lcolor(dkorange) ), ///
>                         legend(label(1 "No shock") ///
>                                    label(2 "1984") /// 
>                                    label(3 "1987") /// 
>                                    label(4 "1993") /// 
>                                    label(5 "2002")) ///
>                            xline(1984, lcolor(ebblue) lpatter(dash)) ///
>                            xline(1987, lcolor(gs10) lpatter(dash)) ///
>                            xline(1993, lcolor(midgreen) lpatter(dash)) ///
>                            xline(2000, lcolor(dkorange) lpatter(dash))
{res}{txt}
{com}. restore
{txt}
{com}. 
. 
. // save new dta with additional vars
. compress
  {txt}variable {bf}fatalities{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}rural_speed{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}urban_speed{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}prim_ever{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}cohort{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (14,352 bytes saved)

{com}. save "$dta_loc/pset2_q1", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data/pset2_q1.dta saved

{com}. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q2.do"
{txt}
{com}. /*
> Title:          02_analysis_q2.do
> Outline:        Question 1, PSet 2 
> 
> Q2 Testing assumptions for DinD design
> 
> */
. 
. pause on 
{txt}
{com}. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. 
. ** Q2a -----------------
. /* List the assumptions. Then perform tests you find feasible and useful. 
> For each of them, describe the alternative and the testing procedure.
> 
> We assume 
> 1) No spillovers
> 2) No anticipation effects: Y_i1 does not depend on D_i2
> 3) No lagged effects: Y_i2 does not depend on D_i1 (not sure about this. Carried from C2 slides)
> 4) Parallel trends: 
>         - This can be applied to (monotonically) transformed data
>         - This can only be tested in the pre-period
> 5) Target estimand tau is linear in tau_it
> 
> // I test assumption 4 which is a first order concern for ID
> Following Marcus and Santanna (2020), page 250:
> "...one can directly test if E[Y_3 – Y_2|C=1]= E[Y_3 – Y_2|G=1] using a standard t-test. 
> Rejecting the null hypothesis would provide direct evidence against the identifying assumptions."
> */
. 
. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. // Get cohort averages \bar{c -(}y{c )-}_gt
. // average across states with cohort-year (g,t)
. // Get delta Y and test means
. byso state (year) : gen del_lny = ln_fat_pc[_n] - ln_fat_pc[_n-1]
{txt}(48 missing values generated)

{com}. 
. labellist cohort
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         dis as result "----------------------"
{txt}  3{com}.         dis as result "COHORT g=`g'"
{txt}  4{com}.     preserve
{txt}  5{com}.                 keep if inlist(cohort, 999, `g') 
{txt}  6{com}.                 forval t = 1984/`g' {c -(}
{txt}  7{com}.                     dis as text ""
{txt}  8{com}.                     dis as result "Run ttest comparing dely_C,`t' with dely_g`g',`t'"
{txt}  9{com}.                         qui sum del_lny if cohort == 999 & year == `t' // get control mean
{txt} 10{com}.                         local delyc_rd = round(`r(mean)', 0.001)
{txt} 11{com}.                     qui count if cohort == `g' & year == `t'
{txt} 12{com}.                         local n_g `r(N)'
{txt} 13{com}.                         if `n_g' == 1 {c -(}
{txt} 14{com}.                             // test cohort C (control group) against cohort g's scalar
.                             qui sum del_lny if cohort == `g' & year == `t'
{txt} 15{com}.                                 local delyg = `r(mean)'
{txt} 16{com}.                                 local delyg_rd = round(`r(mean)', 0.001)
{txt} 17{com}.                             qui ttest del_lny == `r(mean)' if year == `t' & cohort == 999
{txt} 18{com}.                         {c )-}
{txt} 19{com}.                         else if `r(N)' > 1 qui ttest del_lny if year == `t', by (cohort)
{txt} 20{com}.                         // collect test stats
.                         local se_rd = round(`r(se)', 0.001)
{txt} 21{com}.                         local t_rd = round(`r(t)', 0.001)
{txt} 22{com}.                         local p_rd = round(`r(p)', 0.001)
{txt} 23{com}.                         
.                         // display results
.                         dis as text "ttest E[del_ly|C=1]-E[del_ly|g=`g'] with g size = `n_g'"
{txt} 24{com}.                         dis as text "ttest `delyc_rd'-`delyg_rd'"
{txt} 25{com}.                         if `p_rd' < 0.05 dis as error "SE = `se_rd', t-stat = `t_rd', p-value= `p_rd'"
{txt} 26{com}.                         else dis as text "SE = `se_rd', t-stat = `t_rd', p-value= `p_rd'"
{txt} 27{com}.                 {c )-}
{txt} 28{com}.         restore
{txt} 29{com}. {c )-}
{res}----------------------
COHORT g=999
{txt}(414 observations deleted)
{res}----------------------
COHORT g=1984
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1984,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1984] with g size = 1
ttest .006--.012
SE = .021, t-stat = .838, p-value= .409
{res}----------------------
COHORT g=1986
{txt}(322 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1986,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1986] with g size = 4
ttest .006--.012
SE = .062, t-stat = 1.048, p-value= .303

{res}Run ttest comparing dely_C,1985 with dely_g1986,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1986] with g size = 4
ttest -.02--.012
SE = .046, t-stat = -.756, p-value= .455

{res}Run ttest comparing dely_C,1986 with dely_g1986,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1986] with g size = 4
ttest .049--.012
{err}SE = .042, t-stat = 2.357, p-value= .025
{res}----------------------
COHORT g=1987
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1987,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest .006-.147
{err}SE = .021, t-stat = -6.553, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1985 with dely_g1987,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest -.02-.009
SE = .016, t-stat = -1.893, p-value= .068

{res}Run ttest comparing dely_C,1986 with dely_g1987,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest .049-.095
{err}SE = .015, t-stat = -3.085, p-value= .004
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g1987,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest -.006--.052
{err}SE = .014, t-stat = 3.352, p-value= .002
{res}----------------------
COHORT g=1991
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1991,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest .006-.036
SE = .021, t-stat = -1.384, p-value= .177

{res}Run ttest comparing dely_C,1985 with dely_g1991,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.02--.024
SE = .016, t-stat = .231, p-value= .8190000000000001

{res}Run ttest comparing dely_C,1986 with dely_g1991,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest .049-.098
{err}SE = .015, t-stat = -3.247, p-value= .003
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g1991,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.006--.005
SE = .014, t-stat = -.111, p-value= .912

{res}Run ttest comparing dely_C,1988 with dely_g1991,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest .006-.073
{err}SE = .015, t-stat = -4.384, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g1991,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.054--.096
{err}SE = .018, t-stat = 2.331, p-value= .027
{txt}
{res}Run ttest comparing dely_C,1990 with dely_g1991,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.024--.103
{err}SE = .022, t-stat = 3.658, p-value= .001
{txt}
{res}Run ttest comparing dely_C,1991 with dely_g1991,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.057--.203
{err}SE = .015, t-stat = 9.499000000000001, p-value= 0
{res}----------------------
COHORT g=1993
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1993,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest .006-.074
{err}SE = .021, t-stat = -3.172, p-value= .004
{txt}
{res}Run ttest comparing dely_C,1985 with dely_g1993,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.02--.035
SE = .016, t-stat = .9490000000000001, p-value= .351

{res}Run ttest comparing dely_C,1986 with dely_g1993,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest .049-.032
SE = .015, t-stat = 1.139, p-value= .264

{res}Run ttest comparing dely_C,1987 with dely_g1993,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.006-.022
{err}SE = .014, t-stat = -2.096, p-value= .045
{txt}
{res}Run ttest comparing dely_C,1988 with dely_g1993,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest .006--.045
{err}SE = .015, t-stat = 3.397, p-value= .002
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g1993,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.054--.022
SE = .018, t-stat = -1.807, p-value= .081

{res}Run ttest comparing dely_C,1990 with dely_g1993,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.024--.067
SE = .022, t-stat = 2.012, p-value= .054

{res}Run ttest comparing dely_C,1991 with dely_g1993,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.057--.119
{err}SE = .015, t-stat = 4.044, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1992 with dely_g1993,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.061--.128
{err}SE = .014, t-stat = 4.646, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1993 with dely_g1993,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.004--.016
SE = .012, t-stat = .9570000000000001, p-value= .347
{res}----------------------
COHORT g=1996
{txt}(368 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1996,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .006--.016
SE = .085, t-stat = -.065, p-value= .9480000000000001

{res}Run ttest comparing dely_C,1985 with dely_g1996,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.02--.016
SE = .062, t-stat = -.179, p-value= .859

{res}Run ttest comparing dely_C,1986 with dely_g1996,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .049--.016
SE = .059, t-stat = .007, p-value= .995

{res}Run ttest comparing dely_C,1987 with dely_g1996,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.006--.016
SE = .055, t-stat = .625, p-value= .537

{res}Run ttest comparing dely_C,1988 with dely_g1996,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .006--.016
SE = .061, t-stat = -1.054, p-value= .3

{res}Run ttest comparing dely_C,1989 with dely_g1996,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.054--.016
SE = .07, t-stat = -.233, p-value= .8170000000000001

{res}Run ttest comparing dely_C,1990 with dely_g1996,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.024--.016
SE = .086, t-stat = -.491, p-value= .627

{res}Run ttest comparing dely_C,1991 with dely_g1996,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.057--.016
SE = .06, t-stat = 1.181, p-value= .247

{res}Run ttest comparing dely_C,1992 with dely_g1996,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.061--.016
SE = .058, t-stat = -.5700000000000001, p-value= .5730000000000001

{res}Run ttest comparing dely_C,1993 with dely_g1996,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.004--.016
SE = .048, t-stat = -.336, p-value= .739

{res}Run ttest comparing dely_C,1994 with dely_g1996,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.001--.016
SE = .079, t-stat = .351, p-value= .728

{res}Run ttest comparing dely_C,1995 with dely_g1996,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .023--.016
SE = .06, t-stat = -.154, p-value= .879

{res}Run ttest comparing dely_C,1996 with dely_g1996,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.02--.016
SE = .059, t-stat = -.752, p-value= .458
{res}----------------------
COHORT g=1998
{txt}(345 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1998,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .006--.016
SE = .069, t-stat = .891, p-value= .38

{res}Run ttest comparing dely_C,1985 with dely_g1998,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.02--.016
SE = .052, t-stat = -.884, p-value= .383

{res}Run ttest comparing dely_C,1986 with dely_g1998,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .049--.016
SE = .049, t-stat = .521, p-value= .606

{res}Run ttest comparing dely_C,1987 with dely_g1998,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.006--.016
SE = .046, t-stat = .662, p-value= .513

{res}Run ttest comparing dely_C,1988 with dely_g1998,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .006--.016
SE = .05, t-stat = -.224, p-value= .8240000000000001

{res}Run ttest comparing dely_C,1989 with dely_g1998,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.054--.016
SE = .059, t-stat = .171, p-value= .865

{res}Run ttest comparing dely_C,1990 with dely_g1998,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.024--.016
SE = .07, t-stat = -.252, p-value= .803

{res}Run ttest comparing dely_C,1991 with dely_g1998,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.057--.016
SE = .049, t-stat = -.984, p-value= .333

{res}Run ttest comparing dely_C,1992 with dely_g1998,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.061--.016
SE = .047, t-stat = .643, p-value= .525

{res}Run ttest comparing dely_C,1993 with dely_g1998,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.004--.016
SE = .04, t-stat = -.5600000000000001, p-value= .58

{res}Run ttest comparing dely_C,1994 with dely_g1998,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.001--.016
SE = .065, t-stat = -.351, p-value= .728

{res}Run ttest comparing dely_C,1995 with dely_g1998,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .023--.016
SE = .049, t-stat = .726, p-value= .474

{res}Run ttest comparing dely_C,1996 with dely_g1998,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.02--.016
SE = .051, t-stat = -.657, p-value= .516

{res}Run ttest comparing dely_C,1997 with dely_g1998,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .023--.016
SE = .054, t-stat = .404, p-value= .6890000000000001

{res}Run ttest comparing dely_C,1998 with dely_g1998,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.006--.016
SE = .038, t-stat = .583, p-value= .5640000000000001
{res}----------------------
COHORT g=2000
{txt}(345 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g2000,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .006--.016
SE = .07, t-stat = -.513, p-value= .612

{res}Run ttest comparing dely_C,1985 with dely_g2000,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.02--.016
SE = .05, t-stat = -.171, p-value= .865

{res}Run ttest comparing dely_C,1986 with dely_g2000,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .049--.016
SE = .05, t-stat = -1.01, p-value= .32

{res}Run ttest comparing dely_C,1987 with dely_g2000,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.006--.016
SE = .044, t-stat = -.101, p-value= .92

{res}Run ttest comparing dely_C,1988 with dely_g2000,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .006--.016
SE = .05, t-stat = .131, p-value= .897

{res}Run ttest comparing dely_C,1989 with dely_g2000,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.054--.016
SE = .059, t-stat = .266, p-value= .792

{res}Run ttest comparing dely_C,1990 with dely_g2000,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.024--.016
SE = .07, t-stat = -.435, p-value= .666

{res}Run ttest comparing dely_C,1991 with dely_g2000,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.057--.016
SE = .05, t-stat = .606, p-value= .549

{res}Run ttest comparing dely_C,1992 with dely_g2000,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.061--.016
SE = .047, t-stat = .21, p-value= .835

{res}Run ttest comparing dely_C,1993 with dely_g2000,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.004--.016
SE = .04, t-stat = -.887, p-value= .382

{res}Run ttest comparing dely_C,1994 with dely_g2000,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.001--.016
SE = .065, t-stat = .053, p-value= .9580000000000001

{res}Run ttest comparing dely_C,1995 with dely_g2000,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .023--.016
SE = .049, t-stat = -.167, p-value= .868

{res}Run ttest comparing dely_C,1996 with dely_g2000,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.02--.016
SE = .048, t-stat = -.6840000000000001, p-value= .499

{res}Run ttest comparing dely_C,1997 with dely_g2000,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .023--.016
SE = .054, t-stat = .904, p-value= .373

{res}Run ttest comparing dely_C,1998 with dely_g2000,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.006--.016
SE = .037, t-stat = 1.897, p-value= .067

{res}Run ttest comparing dely_C,1999 with dely_g2000,1999
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .01--.016
SE = .054, t-stat = -.014, p-value= .989

{res}Run ttest comparing dely_C,2000 with dely_g2000,2000
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.031--.016
SE = .058, t-stat = .314, p-value= .756
{res}----------------------
COHORT g=2002
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g2002,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .006-.011
SE = .021, t-stat = -.226, p-value= .8230000000000001

{res}Run ttest comparing dely_C,1985 with dely_g2002,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.02-.027
{err}SE = .016, t-stat = -3.023, p-value= .005
{txt}
{res}Run ttest comparing dely_C,1986 with dely_g2002,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .049--.066
{err}SE = .015, t-stat = 7.736, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g2002,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.006-.086
{err}SE = .014, t-stat = -6.826000000000001, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1988 with dely_g2002,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .006--.026
{err}SE = .015, t-stat = 2.133, p-value= .042
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g2002,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.054--.019
SE = .018, t-stat = -1.988, p-value= .056

{res}Run ttest comparing dely_C,1990 with dely_g2002,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.024-.022
{err}SE = .022, t-stat = -2.123, p-value= .042
{txt}
{res}Run ttest comparing dely_C,1991 with dely_g2002,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.057--.215
{err}SE = .015, t-stat = 10.3, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1992 with dely_g2002,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.061--.073
SE = .014, t-stat = .8230000000000001, p-value= .417

{res}Run ttest comparing dely_C,1993 with dely_g2002,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.004--.007
SE = .012, t-stat = .264, p-value= .794

{res}Run ttest comparing dely_C,1994 with dely_g2002,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.001--.053
{err}SE = .02, t-stat = 2.615, p-value= .014
{txt}
{res}Run ttest comparing dely_C,1995 with dely_g2002,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .023-.004
SE = .015, t-stat = 1.253, p-value= .22

{res}Run ttest comparing dely_C,1996 with dely_g2002,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.02-.07
{err}SE = .015, t-stat = -6.043, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1997 with dely_g2002,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .023--.071
{err}SE = .017, t-stat = 5.668, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1998 with dely_g2002,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.006--.037
{err}SE = .011, t-stat = 2.8, p-value= .009
{txt}
{res}Run ttest comparing dely_C,1999 with dely_g2002,1999
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .01--.051
{err}SE = .017, t-stat = 3.63, p-value= .001
{txt}
{res}Run ttest comparing dely_C,2000 with dely_g2002,2000
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.031--.02
SE = .018, t-stat = -.646, p-value= .523

{res}Run ttest comparing dely_C,2001 with dely_g2002,2001
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.007-.013
SE = .019, t-stat = -1.035, p-value= .309

{res}Run ttest comparing dely_C,2002 with dely_g2002,2002
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .034-.003
SE = .016, t-stat = 1.922, p-value= .064
{res}----------------------
COHORT g=2003
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g2003,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .006-.157
{err}SE = .021, t-stat = -7.031000000000001, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1985 with dely_g2003,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.02--.234
{err}SE = .016, t-stat = 13.806, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1986 with dely_g2003,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .049-.253
{err}SE = .015, t-stat = -13.673, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g2003,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.006-.056
{err}SE = .014, t-stat = -4.602, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1988 with dely_g2003,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .006-.075
{err}SE = .015, t-stat = -4.502, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g2003,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.054--.338
{err}SE = .018, t-stat = 15.836, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1990 with dely_g2003,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.024-.157
{err}SE = .022, t-stat = -8.333, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1991 with dely_g2003,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.057--.322
{err}SE = .015, t-stat = 17.29, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1992 with dely_g2003,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.061-.299
{err}SE = .014, t-stat = -24.956, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1993 with dely_g2003,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.004--.248
{err}SE = .012, t-stat = 19.931, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1994 with dely_g2003,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.001--.007
SE = .02, t-stat = .281, p-value= .78

{res}Run ttest comparing dely_C,1995 with dely_g2003,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .023-.06
{err}SE = .015, t-stat = -2.473, p-value= .02
{txt}
{res}Run ttest comparing dely_C,1996 with dely_g2003,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.02--.057
{err}SE = .015, t-stat = 2.542, p-value= .017
{txt}
{res}Run ttest comparing dely_C,1997 with dely_g2003,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .023-.195
{err}SE = .017, t-stat = -10.395, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1998 with dely_g2003,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.006--.234
{err}SE = .011, t-stat = 20.188, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1999 with dely_g2003,1999
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .01--.155
{err}SE = .017, t-stat = 9.794, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2000 with dely_g2003,2000
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.031-.192
{err}SE = .018, t-stat = -12.675, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2001 with dely_g2003,2001
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.007-.089
{err}SE = .019, t-stat = -5.053, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2002 with dely_g2003,2002
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .034--.105
{err}SE = .016, t-stat = 8.6, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2003 with dely_g2003,2003
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.019-.121
{err}SE = .014, t-stat = -9.881, p-value= 0
{txt}
{com}. 
. 
. 
. 
. 
. ** Q2b -----------------
. /*
> Do secondary belt laws pose a potential problem for your DiD design? If so, test
> whether that problem is likely to be significant. If not, explain why not.
> 
> ANS: States implement secondary belt laws before switching to primary. Thus
> secondary laws are indeed a threat to any effect caused by the primary laws in 
> that primary laws have anticipatory effects wrought by the preceeding secondary 
> laws or perhaps even some national awareness (spilovers). 
> 
> Not sure how to test this. Taker-uppers of 2ndary laws are not the same as
> primary. That is, within a primary cohort, there exist different secondary 
> cohorts. 
> 
> */
. 
. 
. 
. // Secondary cohorts for sole states in primary cohort: 
. // list cohort_sec if inlist(cohort, 1987, 1993, 2002) & year == 1981
. // 1986 -> 1987
. // 1986 -> 1993
. // 1987 -> 2002
. 
. // replot q1 graph with secondary cohort verticals
. preserve
{txt}
{com}.         collapse (mean) fatalities ln_fat_pc fat_pc, by(cohort year)
{txt}
{com}. 
.         // plot raw data by cohort with vertical E_i
.         twoway (line ln_fat_pc year if cohort == 999, lcolor(black) ) ///
>                    (line ln_fat_pc year if cohort == 1987, lcolor(gs10) ) ///              
>                    (line ln_fat_pc year if cohort == 1993, lcolor(red) ) ///
>                    (line ln_fat_pc year if cohort == 2002, lcolor(blue) ), ///
>                         legend(label(1 "No shock") ///
>                                    label(2 "1987") /// 
>                                    label(3 "1993") /// 
>                                    label(4 "2002")) ///
>                            xline(1986.1, lcolor(gs10) lpatter(dot)) ///
>                            xline(1986.2, lcolor(red) lpatter(dot)) ///
>                            xline(1987.1, lcolor(blue) lpatter(dot)) ///
>                            ///
>                            xline(1987, lcolor(gs10) lpatter(dash)) ///
>                            xline(1993, lcolor(red) lpatter(dash)) ///
>                            xline(2002, lcolor(blue) lpatter(dash))
{res}{txt}
{com}. restore
{txt}
{com}. // ANS: Let the data speak for themselves. The raw data show that, in some states, 
. // the secondary laws were better markers of declines in fatality rates. The 1993
. // cohort is interesting in that both sets of laws seem to be associated with 
. // declines in fatalities.
. 
. // Meeting todos: Run Max's test and discuss theoretically
. // States with out any laws will have seen states take up secondary before primary
. 
. ** Q2c -----------------
. /*
> Repeat the tests from part 2(a) (and, if any, 2(b)) using fatalities per capita as
> the outcome, without logs. Do the conclusions change? Discuss.
> 
> */
. 
. byso state (year) : gen del_y = fat_pc[_n] - fat_pc[_n-1]
{txt}(48 missing values generated)

{com}. 
. labellist cohort
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         dis as result "----------------------"
{txt}  3{com}.         dis as result "COHORT g=`g'"
{txt}  4{com}.     preserve
{txt}  5{com}.                 keep if inlist(cohort, 999, `g') 
{txt}  6{com}.                 forval t = 1984/`g' {c -(}
{txt}  7{com}.                     dis as text ""
{txt}  8{com}.                     dis as result "Run ttest comparing dely_C,`t' with dely_g`g',`t'"
{txt}  9{com}.                         qui sum del_y if cohort == 999 & year == `t' // get control mean
{txt} 10{com}.                         local delyc_rd = round(`r(mean)', 0.001)
{txt} 11{com}.                     qui count if cohort == `g' & year == `t'
{txt} 12{com}.                         local n_g `r(N)'
{txt} 13{com}.                         if `n_g' == 1 {c -(}
{txt} 14{com}.                             // test cohort C (control group) against cohort g's scalar
.                             qui sum del_y if cohort == `g' & year == `t'
{txt} 15{com}.                                 local delyg = `r(mean)'
{txt} 16{com}.                                 local delyg_rd = round(`r(mean)', 0.001)
{txt} 17{com}.                             qui ttest del_y == `r(mean)' if year == `t' & cohort == 999
{txt} 18{com}.                         {c )-}
{txt} 19{com}.                         else if `r(N)' > 1 qui ttest del_y if year == `t', by (cohort)
{txt} 20{com}.                         // collect test stats
.                         local se_rd = round(`r(se)', 0.001)
{txt} 21{com}.                         local t_rd = round(`r(t)', 0.001)
{txt} 22{com}.                         local p_rd = round(`r(p)', 0.001)
{txt} 23{com}.                         
.                         // display results
.                         dis as text "ttest E[del_ly|C=1]-E[del_ly|g=`g'] with g size = `n_g'"
{txt} 24{com}.                         dis as text "ttest `delyc_rd'-`delyg_rd'"
{txt} 25{com}.                         if `p_rd' < 0.05 dis as error "SE = `se_rd', t-stat = `t_rd', p-value= `p_rd'"
{txt} 26{com}.                         else dis as text "SE = `se_rd', t-stat = `t_rd', p-value= `p_rd'"
{txt} 27{com}.                 {c )-}
{txt} 28{com}.         restore
{txt} 29{com}. {c )-}
{res}----------------------
COHORT g=999
{txt}(414 observations deleted)
{res}----------------------
COHORT g=1984
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1984,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1984] with g size = 1
ttest 0--.001
SE = .005, t-stat = .396, p-value= .6950000000000001
{res}----------------------
COHORT g=1986
{txt}(322 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1986,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1986] with g size = 4
ttest 0--.001
SE = .013, t-stat = 1.219, p-value= .232

{res}Run ttest comparing dely_C,1985 with dely_g1986,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1986] with g size = 4
ttest -.005--.001
SE = .007, t-stat = -1.283, p-value= .209

{res}Run ttest comparing dely_C,1986 with dely_g1986,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1986] with g size = 4
ttest .011--.001
{err}SE = .009, t-stat = 2.533, p-value= .016
{res}----------------------
COHORT g=1987
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1987,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest 0-.032
{err}SE = .005, t-stat = -6.923, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1985 with dely_g1987,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest -.005-.002
{err}SE = .002, t-stat = -3.249, p-value= .003
{txt}
{res}Run ttest comparing dely_C,1986 with dely_g1987,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest .011-.024
{err}SE = .003, t-stat = -4.075, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g1987,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1987] with g size = 1
ttest -.001--.013
{err}SE = .003, t-stat = 3.629, p-value= .001
{res}----------------------
COHORT g=1991
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1991,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest 0-.008
SE = .005, t-stat = -1.562, p-value= .129

{res}Run ttest comparing dely_C,1985 with dely_g1991,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.005--.005
SE = .002, t-stat = -.002, p-value= .999

{res}Run ttest comparing dely_C,1986 with dely_g1991,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest .011-.022
{err}SE = .003, t-stat = -3.39, p-value= .002
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g1991,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.001--.001
SE = .003, t-stat = -.068, p-value= .9460000000000001

{res}Run ttest comparing dely_C,1988 with dely_g1991,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest .001-.017
{err}SE = .003, t-stat = -4.84, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g1991,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.011--.023
{err}SE = .004, t-stat = 3.325, p-value= .002
{txt}
{res}Run ttest comparing dely_C,1990 with dely_g1991,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.003--.022
{err}SE = .004, t-stat = 5.248, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1991 with dely_g1991,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1991] with g size = 1
ttest -.012--.037
{err}SE = .003, t-stat = 8.218999999999999, p-value= 0
{res}----------------------
COHORT g=1993
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1993,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest 0-.014
{err}SE = .005, t-stat = -2.952, p-value= .006
{txt}
{res}Run ttest comparing dely_C,1985 with dely_g1993,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.005--.007
SE = .002, t-stat = .738, p-value= .466

{res}Run ttest comparing dely_C,1986 with dely_g1993,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest .011-.006
SE = .003, t-stat = 1.338, p-value= .191

{res}Run ttest comparing dely_C,1987 with dely_g1993,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.001-.004
SE = .003, t-stat = -1.739, p-value= .093

{res}Run ttest comparing dely_C,1988 with dely_g1993,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest .001--.009
{err}SE = .003, t-stat = 2.835, p-value= .008
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g1993,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.011--.004
SE = .004, t-stat = -1.934, p-value= .063

{res}Run ttest comparing dely_C,1990 with dely_g1993,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.003--.012
{err}SE = .004, t-stat = 2.555, p-value= .016
{txt}
{res}Run ttest comparing dely_C,1991 with dely_g1993,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.012--.019
{err}SE = .003, t-stat = 2.506, p-value= .018
{txt}
{res}Run ttest comparing dely_C,1992 with dely_g1993,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest -.01--.019
{err}SE = .003, t-stat = 3.415, p-value= .002
{txt}
{res}Run ttest comparing dely_C,1993 with dely_g1993,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1993] with g size = 1
ttest 0--.002
SE = .002, t-stat = .769, p-value= .448
{res}----------------------
COHORT g=1996
{txt}(368 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1996,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest 0--.002
SE = .018, t-stat = -.161, p-value= .873

{res}Run ttest comparing dely_C,1985 with dely_g1996,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.005--.002
SE = .009, t-stat = -.26, p-value= .796

{res}Run ttest comparing dely_C,1986 with dely_g1996,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .011--.002
SE = .013, t-stat = -.094, p-value= .926

{res}Run ttest comparing dely_C,1987 with dely_g1996,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.001--.002
SE = .013, t-stat = .471, p-value= .641

{res}Run ttest comparing dely_C,1988 with dely_g1996,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .001--.002
SE = .014, t-stat = -1.019, p-value= .316

{res}Run ttest comparing dely_C,1989 with dely_g1996,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.011--.002
SE = .014, t-stat = -.165, p-value= .87

{res}Run ttest comparing dely_C,1990 with dely_g1996,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.003--.002
SE = .015, t-stat = -.39, p-value= .6990000000000001

{res}Run ttest comparing dely_C,1991 with dely_g1996,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.012--.002
SE = .012, t-stat = 1.349, p-value= .188

{res}Run ttest comparing dely_C,1992 with dely_g1996,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.01--.002
SE = .01, t-stat = -.379, p-value= .708

{res}Run ttest comparing dely_C,1993 with dely_g1996,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest 0--.002
SE = .009, t-stat = -.32, p-value= .751

{res}Run ttest comparing dely_C,1994 with dely_g1996,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .001--.002
SE = .014, t-stat = .485, p-value= .631

{res}Run ttest comparing dely_C,1995 with dely_g1996,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest .006--.002
SE = .011, t-stat = -.066, p-value= .9480000000000001

{res}Run ttest comparing dely_C,1996 with dely_g1996,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1996] with g size = 2
ttest -.005--.002
SE = .012, t-stat = -.8230000000000001, p-value= .417
{res}----------------------
COHORT g=1998
{txt}(345 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g1998,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest 0--.002
SE = .015, t-stat = .744, p-value= .463

{res}Run ttest comparing dely_C,1985 with dely_g1998,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.005--.002
SE = .008, t-stat = -.919, p-value= .365

{res}Run ttest comparing dely_C,1986 with dely_g1998,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .011--.002
SE = .011, t-stat = .662, p-value= .513

{res}Run ttest comparing dely_C,1987 with dely_g1998,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.001--.002
SE = .011, t-stat = .5710000000000001, p-value= .5720000000000001

{res}Run ttest comparing dely_C,1988 with dely_g1998,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .001--.002
SE = .011, t-stat = -.265, p-value= .793

{res}Run ttest comparing dely_C,1989 with dely_g1998,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.011--.002
SE = .012, t-stat = .02, p-value= .984

{res}Run ttest comparing dely_C,1990 with dely_g1998,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.003--.002
SE = .012, t-stat = -.201, p-value= .842

{res}Run ttest comparing dely_C,1991 with dely_g1998,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.012--.002
SE = .01, t-stat = -1.015, p-value= .318

{res}Run ttest comparing dely_C,1992 with dely_g1998,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.01--.002
SE = .008, t-stat = .7010000000000001, p-value= .488

{res}Run ttest comparing dely_C,1993 with dely_g1998,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest 0--.002
SE = .007, t-stat = -.614, p-value= .543

{res}Run ttest comparing dely_C,1994 with dely_g1998,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .001--.002
SE = .011, t-stat = -.263, p-value= .794

{res}Run ttest comparing dely_C,1995 with dely_g1998,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .006--.002
SE = .009, t-stat = .9440000000000001, p-value= .353

{res}Run ttest comparing dely_C,1996 with dely_g1998,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest -.005--.002
SE = .01, t-stat = -1.052, p-value= .301

{res}Run ttest comparing dely_C,1997 with dely_g1998,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest .004--.002
SE = .011, t-stat = .138, p-value= .891

{res}Run ttest comparing dely_C,1998 with dely_g1998,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=1998] with g size = 3
ttest 0--.002
SE = .008, t-stat = .863, p-value= .395
{res}----------------------
COHORT g=2000
{txt}(345 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g2000,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest 0--.002
SE = .015, t-stat = -.411, p-value= .6840000000000001

{res}Run ttest comparing dely_C,1985 with dely_g2000,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.005--.002
SE = .007, t-stat = -.171, p-value= .865

{res}Run ttest comparing dely_C,1986 with dely_g2000,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .011--.002
SE = .011, t-stat = -.9550000000000001, p-value= .347

{res}Run ttest comparing dely_C,1987 with dely_g2000,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.001--.002
SE = .01, t-stat = -.188, p-value= .852

{res}Run ttest comparing dely_C,1988 with dely_g2000,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .001--.002
SE = .011, t-stat = .323, p-value= .748

{res}Run ttest comparing dely_C,1989 with dely_g2000,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.011--.002
SE = .011, t-stat = -.127, p-value= .9

{res}Run ttest comparing dely_C,1990 with dely_g2000,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.003--.002
SE = .012, t-stat = -.54, p-value= .593

{res}Run ttest comparing dely_C,1991 with dely_g2000,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.012--.002
SE = .01, t-stat = .064, p-value= .9490000000000001

{res}Run ttest comparing dely_C,1992 with dely_g2000,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.01--.002
SE = .009, t-stat = .411, p-value= .6840000000000001

{res}Run ttest comparing dely_C,1993 with dely_g2000,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest 0--.002
SE = .007, t-stat = -.621, p-value= .539

{res}Run ttest comparing dely_C,1994 with dely_g2000,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .001--.002
SE = .011, t-stat = .003, p-value= .998

{res}Run ttest comparing dely_C,1995 with dely_g2000,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .006--.002
SE = .009, t-stat = .042, p-value= .967

{res}Run ttest comparing dely_C,1996 with dely_g2000,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.005--.002
SE = .01, t-stat = -.6900000000000001, p-value= .495

{res}Run ttest comparing dely_C,1997 with dely_g2000,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .004--.002
SE = .011, t-stat = .493, p-value= .626

{res}Run ttest comparing dely_C,1998 with dely_g2000,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest 0--.002
SE = .008, t-stat = 1.736, p-value= .093

{res}Run ttest comparing dely_C,1999 with dely_g2000,1999
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest .002--.002
SE = .011, t-stat = -.186, p-value= .854

{res}Run ttest comparing dely_C,2000 with dely_g2000,2000
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2000] with g size = 3
ttest -.005--.002
SE = .012, t-stat = .518, p-value= .608
{res}----------------------
COHORT g=2002
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g2002,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest 0-.002
SE = .005, t-stat = -.301, p-value= .765

{res}Run ttest comparing dely_C,1985 with dely_g2002,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.005-.004
{err}SE = .002, t-stat = -4.27, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1986 with dely_g2002,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .011--.011
{err}SE = .003, t-stat = 6.572, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g2002,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.001-.014
{err}SE = .003, t-stat = -4.777, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1988 with dely_g2002,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .001--.004
SE = .003, t-stat = 1.56, p-value= .13

{res}Run ttest comparing dely_C,1989 with dely_g2002,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.011--.003
{err}SE = .004, t-stat = -2.219, p-value= .034
{txt}
{res}Run ttest comparing dely_C,1990 with dely_g2002,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.003-.004
SE = .004, t-stat = -1.738, p-value= .093

{res}Run ttest comparing dely_C,1991 with dely_g2002,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.012--.033
{err}SE = .003, t-stat = 6.738, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1992 with dely_g2002,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.01--.01
SE = .003, t-stat = -.017, p-value= .986

{res}Run ttest comparing dely_C,1993 with dely_g2002,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest 0--.001
SE = .002, t-stat = .222, p-value= .8260000000000001

{res}Run ttest comparing dely_C,1994 with dely_g2002,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .001--.007
{err}SE = .004, t-stat = 2.145, p-value= .04
{txt}
{res}Run ttest comparing dely_C,1995 with dely_g2002,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .006-0
SE = .003, t-stat = 1.864, p-value= .073

{res}Run ttest comparing dely_C,1996 with dely_g2002,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.005-.009
{err}SE = .003, t-stat = -4.456, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1997 with dely_g2002,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .004--.009
{err}SE = .003, t-stat = 3.678, p-value= .001
{txt}
{res}Run ttest comparing dely_C,1998 with dely_g2002,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest 0--.004
SE = .002, t-stat = 1.804, p-value= .082

{res}Run ttest comparing dely_C,1999 with dely_g2002,1999
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .002--.006
{err}SE = .004, t-stat = 2.16, p-value= .039
{txt}
{res}Run ttest comparing dely_C,2000 with dely_g2002,2000
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.005--.002
SE = .004, t-stat = -.8290000000000001, p-value= .414

{res}Run ttest comparing dely_C,2001 with dely_g2002,2001
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest -.002-.001
SE = .004, t-stat = -.849, p-value= .403

{res}Run ttest comparing dely_C,2002 with dely_g2002,2002
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2002] with g size = 1
ttest .007-0
{err}SE = .003, t-stat = 2.174, p-value= .038
{res}----------------------
COHORT g=2003
{txt}(391 observations deleted)

{res}Run ttest comparing dely_C,1984 with dely_g2003,1984
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest 0-.031
{err}SE = .005, t-stat = -6.675, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1985 with dely_g2003,1985
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.005--.044
{err}SE = .002, t-stat = 17.767, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1986 with dely_g2003,1986
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .011-.049
{err}SE = .003, t-stat = -11.726, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1987 with dely_g2003,1987
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.001-.013
{err}SE = .003, t-stat = -4.248, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1988 with dely_g2003,1988
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .001-.018
{err}SE = .003, t-stat = -4.963, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1989 with dely_g2003,1989
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.011--.071
{err}SE = .004, t-stat = 17.023, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1990 with dely_g2003,1990
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.003-.03
{err}SE = .004, t-stat = -8.875, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1991 with dely_g2003,1991
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.012--.057
{err}SE = .003, t-stat = 14.555, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1992 with dely_g2003,1992
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.01-.052
{err}SE = .003, t-stat = -23.665, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1993 with dely_g2003,1993
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest 0--.044
{err}SE = .002, t-stat = 19.983, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1994 with dely_g2003,1994
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .001--.001
SE = .004, t-stat = .595, p-value= .5570000000000001

{res}Run ttest comparing dely_C,1995 with dely_g2003,1995
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .006-.01
SE = .003, t-stat = -1.472, p-value= .152

{res}Run ttest comparing dely_C,1996 with dely_g2003,1996
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.005--.009
SE = .003, t-stat = 1.516, p-value= .14

{res}Run ttest comparing dely_C,1997 with dely_g2003,1997
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .004-.034
{err}SE = .003, t-stat = -8.846, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1998 with dely_g2003,1998
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest 0--.04
{err}SE = .002, t-stat = 15.976, p-value= 0
{txt}
{res}Run ttest comparing dely_C,1999 with dely_g2003,1999
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .002--.022
{err}SE = .004, t-stat = 6.667, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2000 with dely_g2003,2000
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.005-.027
{err}SE = .004, t-stat = -8.833, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2001 with dely_g2003,2001
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.002-.015
{err}SE = .004, t-stat = -4.19, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2002 with dely_g2003,2002
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest .007--.017
{err}SE = .003, t-stat = 7.884, p-value= 0
{txt}
{res}Run ttest comparing dely_C,2003 with dely_g2003,2003
{txt}ttest E[del_ly|C=1]-E[del_ly|g=2003] with g size = 1
ttest -.004-.02
{err}SE = .002, t-stat = -9.979000000000001, p-value= 0
{txt}
{com}. // The conclusion doesn't change much as the pre-trend test can be scaled monotonically
. // without altering the qualitative comparison between means.
. 
. 
. // repeat 2b
. preserve
{txt}
{com}.         collapse (mean) fatalities ln_fat_pc fat_pc, by(cohort year)
{txt}
{com}. 
.         // plot raw data by cohort with vertical E_i
.         twoway (line fat_pc year if cohort == 999, lcolor(black) ) ///
>                    (line fat_pc year if cohort == 1987, lcolor(gs10) ) ///                 
>                    (line fat_pc year if cohort == 1993, lcolor(red) ) ///
>                    (line fat_pc year if cohort == 2002, lcolor(blue) ), ///
>                         legend(label(1 "No shock") ///
>                                    label(2 "1987") /// 
>                                    label(3 "1993") /// 
>                                    label(4 "2002")) ///
>                            xline(1986.1, lcolor(gs10) lpatter(dot)) ///
>                            xline(1986.2, lcolor(red) lpatter(dot)) ///
>                            xline(1987.1, lcolor(blue) lpatter(dot)) ///
>                            ///
>                            xline(1987, lcolor(gs10) lpatter(dash)) ///
>                            xline(1993, lcolor(red) lpatter(dash)) ///
>                            xline(2002, lcolor(blue) lpatter(dash))
{res}{txt}
{com}. restore
{txt}
{com}. 
. // 2c) The raw data show the same general trend.
. /*
> As per Roth and Santanna (2023), we can test against the null that the PTA is
> invariant to (strictly monotonic) transformations. Compare change in pdfs of 
> raw outcome (fatalities per capita) over time across treatment and control. If
> the distributions are indistinguishable, then the PTA holds under tranformation.
> 
> */
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3a.do"
{txt}
{com}. /*
> Title:          02_analysis_q2.do
> Outline:        Question 3a, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Now proceed with the DiD estimation. 
> 
> (a) Report the de Chaisemartin and D’Haultfouille’s manual averaging estimates of
> the dynamic ATTs for the horizons where a reasonable sample is available.
> */
. 
. 
. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. 
. 
. // I start with Sun and Abraham (2021) where control is never-treated 
. // as opposed to not yet treated.
. 
. // Compute cohort-horizon specific CATT_{c -(}g,e+h{c )-} as Y_{c -(}g,e+h{c )-} - Y_{c -(}g,e-1{c )-}
. // Consider 1997 first.
. // get cohort level data
. collapse (mean) fatalities ln_fat_pc fat_pc, by(cohort year)
{txt}
{com}. 
. preserve
{txt}
{com}.         local n1996 = 1996-1981 + 1
{txt}
{com}.         dis `n1996'
{res}16
{txt}
{com}.         // get y_bar for each cohort at horizon 2
.         byso cohort (year) : gen del_y_1996_h2 = ln_fat_pc[`n1996'+2] - ln_fat_pc[`n1996'-1]
{txt}
{com}. 
.         keep del_y_1996_h2 cohort 
{txt}
{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)

{com}.         keep if inlist(cohort, 999, 1996)
{txt}(9 observations deleted)

{com}.         gen CATT_1996_h2 = del_y_1996_h2[_n]-del_y_1996_h2[_n-1]
{txt}(1 missing value generated)

{com}. restore
{txt}
{com}. 
. // 1) loop over all cohorts and horizons
. labellist cohort
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         if `g' != 999 {c -(} // omit control group
{txt}  3{com}.                 dis as error "g=`g'"
{txt}  4{com}.                 local n`g' = `g'-1981 + 1
{txt}  5{com}.                 dis `n`g''
{txt}  6{com}.                 
.                 // get y_bar for each cohort at horizon h
.                 local h_max = 2003-`g'
{txt}  7{com}.                 dis `h_max'
{txt}  8{com}.                 forval h = 0/`h_max' {c -(}
{txt}  9{com}.                         preserve
{txt} 10{com}.                                 dis as error "h=`h'"
{txt} 11{com}.                                 byso cohort (year) : gen del_y_g`g'_h`h' = ///
>                                         ln_fat_pc[`n`g''+`h'] - ln_fat_pc[`n`g''-1]
{txt} 12{com}.                                 keep del_y_g`g'_h`h' cohort 
{txt} 13{com}.                                 duplicates drop
{txt} 14{com}.                                 keep if inlist(cohort, 999, `g')
{txt} 15{com}.                                 gen CATT_`g'_h`h' = del_y_g`g'_h`h'[_n] - del_y_g`g'_h`h'[_n-1]
{txt} 16{com}. //                              pause
.                                 keep cohort CATT_`g'_h`h' 
{txt} 17{com}.                                 keep if CATT_`g'_h`h' != .
{txt} 18{com}.                                 gen h = `h'
{txt} 19{com}.                                 rename CATT_`g'_h`h' CATT_hg
{txt} 20{com}.                                 
.                                 // save to stack later
.                                 tempfile est_CATT_`g'_h`h'
{txt} 21{com}.                                 save    `est_CATT_`g'_h`h''
{txt} 22{com}.                                 
.                         restore
{txt} 23{com}.                 {c )-}
{txt} 24{com}.         {c )-}
{txt} 25{com}. {c )-}
{err}g=1984
4
19
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000003.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000005.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000007.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000009.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000b.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000d.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000f.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000h.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000j.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000l.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000n.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000p.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000r.tmp saved
{err}h=13

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000t.tmp saved
{err}h=14

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000v.tmp saved
{err}h=15

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00000x.tmp saved
{err}h=16

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000011.tmp saved
{err}h=17

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000013.tmp saved
{err}h=18

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000015.tmp saved
{err}h=19

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000017.tmp saved
{err}g=1986
6
17
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000019.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001b.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001d.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001f.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001h.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001j.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001l.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001n.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001p.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001r.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001t.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001v.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00001x.tmp saved
{err}h=13

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000021.tmp saved
{err}h=14

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000023.tmp saved
{err}h=15

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000025.tmp saved
{err}h=16

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000027.tmp saved
{err}h=17

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000029.tmp saved
{err}g=1987
7
16
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002b.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002d.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002f.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002h.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002j.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002l.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002n.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002p.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002r.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002t.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002v.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00002x.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000031.tmp saved
{err}h=13

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000033.tmp saved
{err}h=14

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000035.tmp saved
{err}h=15

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000037.tmp saved
{err}h=16

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000039.tmp saved
{err}g=1991
11
12
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003b.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003d.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003f.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003h.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003j.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003l.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003n.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003p.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003r.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003t.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003v.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00003x.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000041.tmp saved
{err}g=1993
13
10
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000043.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000045.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000047.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000049.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004b.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004d.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004f.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004h.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004j.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004l.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004n.tmp saved
{err}g=1996
16
7
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004p.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004r.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004t.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004v.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00004x.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000051.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000053.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000055.tmp saved
{err}g=1998
18
5
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000057.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000059.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005b.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005d.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005f.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005h.tmp saved
{err}g=2000
20
3
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005j.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005l.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005n.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005p.tmp saved
{err}g=2002
22
1
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005r.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005t.tmp saved
{err}g=2003
23
0
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005v.tmp saved

{com}. 
. // 2) stack CATTs in new dta
. use `est_CATT_1984_h0', clear // call first cohort
{txt}
{com}. local counter 0
{txt}
{com}. labellist cohort
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         if `g' != 999 {c -(} // omit control group
{txt}  3{com}.                 local h_max = 2003-`g'
{txt}  4{com}.                 dis `h_max'
{txt}  5{com}.                 forval h = 0/`h_max' {c -(}
{txt}  6{com}.                         dis "g, h = `g', `h'"
{txt}  7{com}.                         if `counter' > 0 {c -(}
{txt}  8{com}.                                 append using `est_CATT_`g'_h`h''        
{txt}  9{com}.                         {c )-}
{txt} 10{com}.                         local counter = `counter' + 1
{txt} 11{com}.                 {c )-}
{txt} 12{com}.         {c )-}
{txt} 13{com}. {c )-}
19
g, h = 1984, 0
g, h = 1984, 1
{txt}(label cohort already defined)
g, h = 1984, 2
(label cohort already defined)
g, h = 1984, 3
(label cohort already defined)
g, h = 1984, 4
(label cohort already defined)
g, h = 1984, 5
(label cohort already defined)
g, h = 1984, 6
(label cohort already defined)
g, h = 1984, 7
(label cohort already defined)
g, h = 1984, 8
(label cohort already defined)
g, h = 1984, 9
(label cohort already defined)
g, h = 1984, 10
(label cohort already defined)
g, h = 1984, 11
(label cohort already defined)
g, h = 1984, 12
(label cohort already defined)
g, h = 1984, 13
(label cohort already defined)
g, h = 1984, 14
(label cohort already defined)
g, h = 1984, 15
(label cohort already defined)
g, h = 1984, 16
(label cohort already defined)
g, h = 1984, 17
(label cohort already defined)
g, h = 1984, 18
(label cohort already defined)
g, h = 1984, 19
(label cohort already defined)
17
g, h = 1986, 0
(label cohort already defined)
g, h = 1986, 1
(label cohort already defined)
g, h = 1986, 2
(label cohort already defined)
g, h = 1986, 3
(label cohort already defined)
g, h = 1986, 4
(label cohort already defined)
g, h = 1986, 5
(label cohort already defined)
g, h = 1986, 6
(label cohort already defined)
g, h = 1986, 7
(label cohort already defined)
g, h = 1986, 8
(label cohort already defined)
g, h = 1986, 9
(label cohort already defined)
g, h = 1986, 10
(label cohort already defined)
g, h = 1986, 11
(label cohort already defined)
g, h = 1986, 12
(label cohort already defined)
g, h = 1986, 13
(label cohort already defined)
g, h = 1986, 14
(label cohort already defined)
g, h = 1986, 15
(label cohort already defined)
g, h = 1986, 16
(label cohort already defined)
g, h = 1986, 17
(label cohort already defined)
16
g, h = 1987, 0
(label cohort already defined)
g, h = 1987, 1
(label cohort already defined)
g, h = 1987, 2
(label cohort already defined)
g, h = 1987, 3
(label cohort already defined)
g, h = 1987, 4
(label cohort already defined)
g, h = 1987, 5
(label cohort already defined)
g, h = 1987, 6
(label cohort already defined)
g, h = 1987, 7
(label cohort already defined)
g, h = 1987, 8
(label cohort already defined)
g, h = 1987, 9
(label cohort already defined)
g, h = 1987, 10
(label cohort already defined)
g, h = 1987, 11
(label cohort already defined)
g, h = 1987, 12
(label cohort already defined)
g, h = 1987, 13
(label cohort already defined)
g, h = 1987, 14
(label cohort already defined)
g, h = 1987, 15
(label cohort already defined)
g, h = 1987, 16
(label cohort already defined)
12
g, h = 1991, 0
(label cohort already defined)
g, h = 1991, 1
(label cohort already defined)
g, h = 1991, 2
(label cohort already defined)
g, h = 1991, 3
(label cohort already defined)
g, h = 1991, 4
(label cohort already defined)
g, h = 1991, 5
(label cohort already defined)
g, h = 1991, 6
(label cohort already defined)
g, h = 1991, 7
(label cohort already defined)
g, h = 1991, 8
(label cohort already defined)
g, h = 1991, 9
(label cohort already defined)
g, h = 1991, 10
(label cohort already defined)
g, h = 1991, 11
(label cohort already defined)
g, h = 1991, 12
(label cohort already defined)
10
g, h = 1993, 0
(label cohort already defined)
g, h = 1993, 1
(label cohort already defined)
g, h = 1993, 2
(label cohort already defined)
g, h = 1993, 3
(label cohort already defined)
g, h = 1993, 4
(label cohort already defined)
g, h = 1993, 5
(label cohort already defined)
g, h = 1993, 6
(label cohort already defined)
g, h = 1993, 7
(label cohort already defined)
g, h = 1993, 8
(label cohort already defined)
g, h = 1993, 9
(label cohort already defined)
g, h = 1993, 10
(label cohort already defined)
7
g, h = 1996, 0
(label cohort already defined)
g, h = 1996, 1
(label cohort already defined)
g, h = 1996, 2
(label cohort already defined)
g, h = 1996, 3
(label cohort already defined)
g, h = 1996, 4
(label cohort already defined)
g, h = 1996, 5
(label cohort already defined)
g, h = 1996, 6
(label cohort already defined)
g, h = 1996, 7
(label cohort already defined)
5
g, h = 1998, 0
(label cohort already defined)
g, h = 1998, 1
(label cohort already defined)
g, h = 1998, 2
(label cohort already defined)
g, h = 1998, 3
(label cohort already defined)
g, h = 1998, 4
(label cohort already defined)
g, h = 1998, 5
(label cohort already defined)
3
g, h = 2000, 0
(label cohort already defined)
g, h = 2000, 1
(label cohort already defined)
g, h = 2000, 2
(label cohort already defined)
g, h = 2000, 3
(label cohort already defined)
1
g, h = 2002, 0
(label cohort already defined)
g, h = 2002, 1
(label cohort already defined)
0
g, h = 2003, 0
(label cohort already defined)

{com}. tempfile CATT_w_`g'
{txt}
{com}. save    `CATT_w_`g'', replace
{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005w.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00005w.tmp saved

{com}. 
. 
. // 3) Generate cohort-specific weights
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. byso cohort: egen w_g = count(cohort)
{txt}
{com}. replace w_g = w_g/23 // 23 is number of periods (works due to balance)
{txt}(1,104 real changes made)

{com}. preserve // get total w
{txt}
{com}.         keep cohort w_g 
{txt}
{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(1,093 observations deleted)

{com}.         egen tot_w_g = total(w_g) 
{txt}
{com}.         assert tot_w_g == 48 // states
{txt}
{com}.         replace w_g = w_g/tot_w_g // get relative weights
{txt}(11 real changes made)

{com}.         drop tot_w_g
{txt}
{com}.         
.         tempfile est_w_`g'
{txt}
{com}.         save    `est_w_`g''
{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000060.tmp saved

{com}. restore
{txt}
{com}. 
. 
. // 4) take weighted average of CATT_{c -(}g,h{c )-} where weights are cohort size.
. use `CATT_w_`g'', clear
{txt}
{com}. merge m:1 cohort using `est_w_`g''
{res}{txt}(label cohort already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             100{txt}  (_merge==3)
{col 5}{hline 41}

{com}. assert cohort == 999 if _merge == 2 // no CATT for control group
{txt}
{com}. drop _merge
{txt}
{com}. 
. 
. // take sum product of CATT_{c -(}gh{c )-}*w_{c -(}g{c )-} for different horizons
. byso h (cohort) : gen product_h = CATT_hg * w_g
{txt}(1 missing value generated)

{com}. byso h (cohort) : egen ATT_h_SnA = sum(product_h)
{txt}
{com}. 
. drop if cohort == 999 // drop control cohort with no ATT
{txt}(1 observation deleted)

{com}. keep h ATT_h_SnA
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(80 observations deleted)

{com}. 
. tempfile tau_SnA
{txt}
{com}. save    `tau_SnA', replace
{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000061.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000061.tmp saved

{com}. // How to get SE? Bootstrap. Ignore, not asked for.
. 
. 
. 
. 
. 
. 
. // -----------------------------
. // Now get dCDH equivalent where control cohort is larger and then shrinking 
. // to the control I used above. There will be a control group for each cohort, g.
. 
. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. sort cohort state year
{txt}
{com}. assert !missing(cohort)
{txt}
{com}. 
. // 0) Get cohort specific cohort list
. labellist cohort
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         if `g' != 999 {c -(} // omit control group
{txt}  3{com}.                 gen cohort_`g' = cohort
{txt}  4{com}.                 replace cohort_`g' = 999 if cohort_`g' > `g'
{txt}  5{com}.                 label values cohort_`g' cohort
{txt}  6{com}.         {c )-}
{txt}  7{com}. {c )-}
{txt}(391 real changes made)
(299 real changes made)
(276 real changes made)
(253 real changes made)
(230 real changes made)
(184 real changes made)
(115 real changes made)
(46 real changes made)
(23 real changes made)
(0 real changes made)

{com}. sort cohort state year
{txt}
{com}. 
. // 1) loop over all cohorts and horizons
. labellist cohort // same list of cohorts (cohort_g) comes later
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         if `g' != 999 {c -(} // omit control group
{txt}  3{com}.                 dis as error "g=`g'"
{txt}  4{com}.                 local n`g' = `g'-1981 + 1
{txt}  5{com}.                 dis `n`g''
{txt}  6{com}.                 
.                 // get y_bar for each cohort at horizon h
.                 local h_max = 2003-`g'
{txt}  7{com}.                 dis `h_max'
{txt}  8{com}.                 forval h = 0/`h_max' {c -(}
{txt}  9{com}.                         preserve
{txt} 10{com}.                                 dis as error "h=`h'"
{txt} 11{com}.                                 
.                                 // get new cohort specific annual means across states
.                                 collapse (mean) fatalities ln_fat_pc fat_pc, by(cohort_`g' year)
{txt} 12{com}.                                 
.                                 byso cohort_`g' (year) : gen del_y_g`g'_h`h' = ///
>                                         ln_fat_pc[`n`g''+`h'] - ln_fat_pc[`n`g''-1]
{txt} 13{com}.                                 keep del_y_g`g'_h`h' cohort_`g' 
{txt} 14{com}.                                 duplicates drop
{txt} 15{com}. 
.                                 keep if inlist(cohort_`g', 999, `g') 
{txt} 16{com}.                                 // this step is also necessary for dCDH for 2nd cohort onward
.                                 
.                                 gen CATT_`g'_h`h' = del_y_g`g'_h`h'[_n] - del_y_g`g'_h`h'[_n-1]
{txt} 17{com}.                                 keep cohort_`g' CATT_`g'_h`h' 
{txt} 18{com}.                                 keep if CATT_`g'_h`h' != .
{txt} 19{com}.                                 gen h = `h'
{txt} 20{com}.                                 rename CATT_`g'_h`h' CATT_hg
{txt} 21{com}.                                 rename cohort_`g' cohort // for append later
{txt} 22{com}.                                 
.                                 // save to stack later
.                                 tempfile dCDH_CATT_`g'_h`h'
{txt} 23{com}.                                 save    `dCDH_CATT_`g'_h`h'', replace
{txt} 24{com}.                                 
.                         restore
{txt} 25{com}.                 {c )-}
{txt} 26{com}.         {c )-}
{txt} 27{com}. {c )-}
{err}g=1984
4
19
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000063.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000063.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000065.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000065.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000067.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000067.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000069.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000069.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006b.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006b.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006d.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006d.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006f.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006f.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006h.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006h.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006j.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006j.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006l.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006l.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006n.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006n.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006p.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006p.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006r.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006r.tmp saved
{err}h=13

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006t.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006t.tmp saved
{err}h=14

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006v.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006v.tmp saved
{err}h=15

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006x.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00006x.tmp saved
{err}h=16

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000071.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000071.tmp saved
{err}h=17

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000073.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000073.tmp saved
{err}h=18

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000075.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000075.tmp saved
{err}h=19

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(44 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000077.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000077.tmp saved
{err}g=1986
6
17
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000079.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000079.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007b.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007b.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007d.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007d.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007f.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007f.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007h.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007h.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007j.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007j.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007l.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007l.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007n.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007n.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007p.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007p.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007r.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007r.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007t.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007t.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007v.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007v.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007x.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00007x.tmp saved
{err}h=13

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000081.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000081.tmp saved
{err}h=14

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000083.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000083.tmp saved
{err}h=15

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000085.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000085.tmp saved
{err}h=16

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000087.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000087.tmp saved
{err}h=17

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(66 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000089.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000089.tmp saved
{err}g=1987
7
16
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008b.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008b.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008d.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008d.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008f.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008f.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008h.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008h.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008j.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008j.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008l.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008l.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008n.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008n.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008p.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008p.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008r.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008r.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008t.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008t.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008v.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008v.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008x.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00008x.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000091.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000091.tmp saved
{err}h=13

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000093.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000093.tmp saved
{err}h=14

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000095.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000095.tmp saved
{err}h=15

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000097.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000097.tmp saved
{err}h=16

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(88 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000099.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_000099.tmp saved
{err}g=1991
11
12
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009b.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009b.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009d.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009d.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009f.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009f.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009h.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009h.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009j.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009j.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009l.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009l.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009n.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009n.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009p.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009p.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009r.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009r.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009t.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009t.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009v.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009v.tmp saved
{err}h=11

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009x.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_00009x.tmp saved
{err}h=12

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(110 observations deleted)
(3 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a1.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a1.tmp saved
{err}g=1993
13
10
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a3.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a3.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a5.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a5.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a7.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a7.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a9.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000a9.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ab.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ab.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ad.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ad.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000af.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000af.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ah.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ah.tmp saved
{err}h=8

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000aj.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000aj.tmp saved
{err}h=9

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000al.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000al.tmp saved
{err}h=10

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(132 observations deleted)
(4 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000an.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000an.tmp saved
{err}g=1996
16
7
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ap.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ap.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ar.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ar.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000at.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000at.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000av.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000av.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ax.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000ax.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b1.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b1.tmp saved
{err}h=6

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b3.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b3.tmp saved
{err}h=7

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(154 observations deleted)
(5 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b5.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b5.tmp saved
{err}g=1998
18
5
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(176 observations deleted)
(6 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b7.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b7.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(176 observations deleted)
(6 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b9.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000b9.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(176 observations deleted)
(6 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bb.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bb.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(176 observations deleted)
(6 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bd.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bd.tmp saved
{err}h=4

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(176 observations deleted)
(6 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bf.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bf.tmp saved
{err}h=5

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(176 observations deleted)
(6 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bh.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bh.tmp saved
{err}g=2000
20
3
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(198 observations deleted)
(7 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bj.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bj.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(198 observations deleted)
(7 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bl.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bl.tmp saved
{err}h=2

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(198 observations deleted)
(7 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bn.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bn.tmp saved
{err}h=3

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(198 observations deleted)
(7 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bp.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bp.tmp saved
{err}g=2002
22
1
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(220 observations deleted)
(8 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000br.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000br.tmp saved
{err}h=1

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(220 observations deleted)
(8 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bt.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bt.tmp saved
{err}g=2003
23
0
h=0

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(242 observations deleted)
(9 observations deleted)
(1 missing value generated)
(1 observation deleted)
{res}{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bv.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bv.tmp saved

{com}. 
. // 2) stack CATTs in new dta
. use `dCDH_CATT_1984_h0', clear // call first cohort
{txt}
{com}. local counter 0
{txt}
{com}. labellist cohort
{res}cohort:
         999 No shock 
        1984 1984 
        1986 1986 
        1987 1987 
        1991 1991 
        1993 1993 
        1996 1996 
        1998 1998 
        2000 2000 
        2002 2002 
        2003 2003 
{txt}
{com}. foreach g in `r(values)' {c -(}
{txt}  2{com}.         if `g' != 999 {c -(} // omit control group
{txt}  3{com}.                 local h_max = 2003-`g'
{txt}  4{com}.                 dis `h_max'
{txt}  5{com}.                 forval h = 0/`h_max' {c -(}
{txt}  6{com}.                         dis "g, h = `g', `h'"
{txt}  7{com}.                         if `counter' > 0 {c -(}
{txt}  8{com}.                                 append using `dCDH_CATT_`g'_h`h''       
{txt}  9{com}.                         {c )-}
{txt} 10{com}.                         local counter = `counter' + 1
{txt} 11{com}.                 {c )-}
{txt} 12{com}.         {c )-}
{txt} 13{com}. {c )-}
19
g, h = 1984, 0
g, h = 1984, 1
{txt}(label cohort already defined)
g, h = 1984, 2
(label cohort already defined)
g, h = 1984, 3
(label cohort already defined)
g, h = 1984, 4
(label cohort already defined)
g, h = 1984, 5
(label cohort already defined)
g, h = 1984, 6
(label cohort already defined)
g, h = 1984, 7
(label cohort already defined)
g, h = 1984, 8
(label cohort already defined)
g, h = 1984, 9
(label cohort already defined)
g, h = 1984, 10
(label cohort already defined)
g, h = 1984, 11
(label cohort already defined)
g, h = 1984, 12
(label cohort already defined)
g, h = 1984, 13
(label cohort already defined)
g, h = 1984, 14
(label cohort already defined)
g, h = 1984, 15
(label cohort already defined)
g, h = 1984, 16
(label cohort already defined)
g, h = 1984, 17
(label cohort already defined)
g, h = 1984, 18
(label cohort already defined)
g, h = 1984, 19
(label cohort already defined)
17
g, h = 1986, 0
(label cohort already defined)
g, h = 1986, 1
(label cohort already defined)
g, h = 1986, 2
(label cohort already defined)
g, h = 1986, 3
(label cohort already defined)
g, h = 1986, 4
(label cohort already defined)
g, h = 1986, 5
(label cohort already defined)
g, h = 1986, 6
(label cohort already defined)
g, h = 1986, 7
(label cohort already defined)
g, h = 1986, 8
(label cohort already defined)
g, h = 1986, 9
(label cohort already defined)
g, h = 1986, 10
(label cohort already defined)
g, h = 1986, 11
(label cohort already defined)
g, h = 1986, 12
(label cohort already defined)
g, h = 1986, 13
(label cohort already defined)
g, h = 1986, 14
(label cohort already defined)
g, h = 1986, 15
(label cohort already defined)
g, h = 1986, 16
(label cohort already defined)
g, h = 1986, 17
(label cohort already defined)
16
g, h = 1987, 0
(label cohort already defined)
g, h = 1987, 1
(label cohort already defined)
g, h = 1987, 2
(label cohort already defined)
g, h = 1987, 3
(label cohort already defined)
g, h = 1987, 4
(label cohort already defined)
g, h = 1987, 5
(label cohort already defined)
g, h = 1987, 6
(label cohort already defined)
g, h = 1987, 7
(label cohort already defined)
g, h = 1987, 8
(label cohort already defined)
g, h = 1987, 9
(label cohort already defined)
g, h = 1987, 10
(label cohort already defined)
g, h = 1987, 11
(label cohort already defined)
g, h = 1987, 12
(label cohort already defined)
g, h = 1987, 13
(label cohort already defined)
g, h = 1987, 14
(label cohort already defined)
g, h = 1987, 15
(label cohort already defined)
g, h = 1987, 16
(label cohort already defined)
12
g, h = 1991, 0
(label cohort already defined)
g, h = 1991, 1
(label cohort already defined)
g, h = 1991, 2
(label cohort already defined)
g, h = 1991, 3
(label cohort already defined)
g, h = 1991, 4
(label cohort already defined)
g, h = 1991, 5
(label cohort already defined)
g, h = 1991, 6
(label cohort already defined)
g, h = 1991, 7
(label cohort already defined)
g, h = 1991, 8
(label cohort already defined)
g, h = 1991, 9
(label cohort already defined)
g, h = 1991, 10
(label cohort already defined)
g, h = 1991, 11
(label cohort already defined)
g, h = 1991, 12
(label cohort already defined)
10
g, h = 1993, 0
(label cohort already defined)
g, h = 1993, 1
(label cohort already defined)
g, h = 1993, 2
(label cohort already defined)
g, h = 1993, 3
(label cohort already defined)
g, h = 1993, 4
(label cohort already defined)
g, h = 1993, 5
(label cohort already defined)
g, h = 1993, 6
(label cohort already defined)
g, h = 1993, 7
(label cohort already defined)
g, h = 1993, 8
(label cohort already defined)
g, h = 1993, 9
(label cohort already defined)
g, h = 1993, 10
(label cohort already defined)
7
g, h = 1996, 0
(label cohort already defined)
g, h = 1996, 1
(label cohort already defined)
g, h = 1996, 2
(label cohort already defined)
g, h = 1996, 3
(label cohort already defined)
g, h = 1996, 4
(label cohort already defined)
g, h = 1996, 5
(label cohort already defined)
g, h = 1996, 6
(label cohort already defined)
g, h = 1996, 7
(label cohort already defined)
5
g, h = 1998, 0
(label cohort already defined)
g, h = 1998, 1
(label cohort already defined)
g, h = 1998, 2
(label cohort already defined)
g, h = 1998, 3
(label cohort already defined)
g, h = 1998, 4
(label cohort already defined)
g, h = 1998, 5
(label cohort already defined)
3
g, h = 2000, 0
(label cohort already defined)
g, h = 2000, 1
(label cohort already defined)
g, h = 2000, 2
(label cohort already defined)
g, h = 2000, 3
(label cohort already defined)
1
g, h = 2002, 0
(label cohort already defined)
g, h = 2002, 1
(label cohort already defined)
0
g, h = 2003, 0
(label cohort already defined)

{com}. tempfile dCDH_CATT_w_`g'
{txt}
{com}. save    `dCDH_CATT_w_`g'', replace
{txt}(note: file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bw.tmp not found)
file C:\Users\YFKASH~1\AppData\Local\Temp\47\ST_20e8_0000bw.tmp saved

{com}. 
. 
. // 3) skip. Same as before?
. 
. // 4) take weighted average of CATT_{c -(}g,h{c )-} where weights are cohort size.
. use `dCDH_CATT_w_`g'', clear
{txt}
{com}. merge m:1 cohort using `est_w_`g''
{res}{txt}(label cohort already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             100{txt}  (_merge==3)
{col 5}{hline 41}

{com}. assert cohort == 999 if _merge == 2 // no CATT for control group
{txt}
{com}. drop _merge
{txt}
{com}. 
. // take sum product of CATT_{c -(}gh{c )-}*w_{c -(}g{c )-} for different horizons
. byso h (cohort) : gen product_h = CATT_hg * w_g
{txt}(1 missing value generated)

{com}. byso h (cohort) : egen ATT_h_dCDH = sum(product_h)
{txt}
{com}. 
. drop if cohort == 999 // drop control cohort with no ATT
{txt}(1 observation deleted)

{com}. keep h ATT_h_dCDH
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(80 observations deleted)

{com}. 
. merge 1:1 h using `tau_SnA'
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              20{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. // visualize: S&A estimates are larger in absolute terms
. // twoway (kdensity ATT_h_dCDH) (kdensity ATT_h_SnA)
. sum ATT_h_dCDH ATT_h_SnA

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}ATT_h_dCDH {c |}{res}         20   -.0161386    .0048723  -.0223849  -.0041717
{txt}{space 3}ATT_h_SnA {c |}{res}         20   -.0182031    .0055064  -.0256901  -.0052039
{txt}
{com}. drop _merge
{txt}
{com}. 
. label var h "Horizon"
{txt}
{com}. label var ATT_h_dCDH "ATT dCDH (C = not-yet-treated)"
{txt}
{com}. label var ATT_h_SnA  "ATT Sun and Abraham (C = never-treated)"
{txt}
{com}. 
. // get overall mean
. qui sum ATT_h_dCDH
{txt}
{com}. global att_est_3a = round(`r(mean)', 0.001)
{txt}
{com}. 
. // plot
. line ATT_h_dCDH h, ///
>         yline($att_est_3a) ///
>         note("Note: Displayed are horizon-specific ATT estimates along with the general average in red.") ///
>         saving("$do_loc/Graphs/ATT_dCDH", replace)
{res}{txt}(file //Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/Graphs/ATT_dCDH.gph saved)

{com}. 
. graph export "$do_loc/Graphs/ATT_dCDH.png", ///
>         width(1200) height(900) ///
>         replace
{txt}(file //Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/Graphs/ATT_dCDH.png written in PNG format)

{com}.         
. // save
. compress
  {txt}variable {bf}h{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (60 bytes saved)

{com}. save "$dta_loc\q3a_ATTs", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data\q3a_ATTs.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3b.do"
{txt}
{com}. /*
> Title:          02_analysis_q3b.do
> Outline:        Question 3, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Now proceed with the DiD estimation. 
> 
> (b) Report the Borusyak, Jaravel, and Spiess’s imputation estimates for the same
> estimands. Use the most appropriate standard errors. Do the results mostly
> agree with part 3(a)?
> 
> Approach: following Theorem 2 in BJS (2023):
> 1) Get predictions for alpha_i and beta_t by OLS in the omega_0 
> (untreated or not yet treated) population only.
> 2) Get \hat{c -(}tau{c )-}
>         2a. Compute \hat{c -(}y(0){c )-} = in omega_1 population and 
>         2b. compute \hat{c -(}tau{c )-} = y-\hat{c -(}y(0){c )-}
> 3) Estimate tau_w by a weighted sum over omega_q
> 4) Estimate SEs
>         4a. Pool multiple cohorts for simplicity
>         4b. get eps_it = tau_hat_{c -(}it{c )-} - tau_hat_{c -(}Et{c )-}
>         4c. let v_it = w_it = size of omega_1 for simplicity
>         4d. Compute var(tau_it) = sum_i (sum_t v_it eps_it)^2
> 
> */
. // set graphics off
. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. 
. // 1) Get predictions for alpha_i and beta_t by OLS in omega_0 
. reg ln_fat_pc i.state i.year if primary == 0

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       922
{txt}{hline 13}{c +}{hline 34}   F(69, 852)      = {res}   114.44
{txt}       Model {c |} {res} 90.1782575        69  1.30693127   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9.72961864       852   .01141974   {txt}R-squared       ={res}    0.9026
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8947
{txt}       Total {c |} {res} 99.9078762       921  .108477607   {txt}Root MSE        =   {res} .10686

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ln_fat_pc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2}-.0162001{col 26}{space 2} .0331796{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-.0813235{col 67}{space 3} .0489233
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} -.068485{col 26}{space 2} .0331796{col 37}{space 1}   -2.06{col 46}{space 3}0.039{col 54}{space 4}-.1336084{col 67}{space 3}-.0033616
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.3846694{col 26}{space 2} .0395199{col 37}{space 1}   -9.73{col 46}{space 3}0.000{col 54}{space 4}-.4622371{col 67}{space 3}-.3071017
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.3826142{col 26}{space 2} .0331796{col 37}{space 1}  -11.53{col 46}{space 3}0.000{col 54}{space 4}-.4477376{col 67}{space 3}-.3174908
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.6053001{col 26}{space 2} .0540901{col 37}{space 1}  -11.19{col 46}{space 3}0.000{col 54}{space 4}-.7114656{col 67}{space 3}-.4991345
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.3341957{col 26}{space 2} .0335068{col 37}{space 1}   -9.97{col 46}{space 3}0.000{col 54}{space 4}-.3999612{col 67}{space 3}-.2684302
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.1625973{col 26}{space 2} .0331796{col 37}{space 1}   -4.90{col 46}{space 3}0.000{col 54}{space 4}-.2277207{col 67}{space 3}-.0974739
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.1255506{col 26}{space 2} .0369693{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.1981123{col 67}{space 3}-.0529889
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.4685753{col 26}{space 2} .0540901{col 37}{space 1}   -8.66{col 46}{space 3}0.000{col 54}{space 4}-.5747408{col 67}{space 3}-.3624097
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0594742{col 26}{space 2} .0331796{col 37}{space 1}   -1.79{col 46}{space 3}0.073{col 54}{space 4}-.1245976{col 67}{space 3} .0056492
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6493499{col 26}{space 2} .0331796{col 37}{space 1}  -19.57{col 46}{space 3}0.000{col 54}{space 4}-.7144733{col 67}{space 3}-.5842265
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.3668006{col 26}{space 2} .0357045{col 37}{space 1}  -10.27{col 46}{space 3}0.000{col 54}{space 4}-.4368796{col 67}{space 3}-.2967216
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.2902963{col 26}{space 2} .0331796{col 37}{space 1}   -8.75{col 46}{space 3}0.000{col 54}{space 4}-.3554197{col 67}{space 3}-.2251729
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.1388279{col 26}{space 2} .0331796{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-.2039513{col 67}{space 3}-.0737045
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.1926516{col 26}{space 2} .0369693{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.2652133{col 67}{space 3}  -.12009
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.016931{col 26}{space 2} .0331796{col 37}{space 1}  -30.65{col 46}{space 3}0.000{col 54}{space 4}-1.082055{col 67}{space 3}-.9518079
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5501205{col 26}{space 2} .0357045{col 37}{space 1}  -15.41{col 46}{space 3}0.000{col 54}{space 4}-.6201996{col 67}{space 3}-.4800415
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.4103948{col 26}{space 2} .0331796{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-.4755182{col 67}{space 3}-.3452714
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.4697366{col 26}{space 2}  .034671{col 37}{space 1}  -13.55{col 46}{space 3}0.000{col 54}{space 4}-.5377872{col 67}{space 3}-.4016861
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.6256298{col 26}{space 2} .0331796{col 37}{space 1}  -18.86{col 46}{space 3}0.000{col 54}{space 4}-.6907532{col 67}{space 3}-.5605064
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.2010471{col 26}{space 2} .0331796{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4}-.2661705{col 67}{space 3}-.1359238
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} .1729473{col 26}{space 2} .0331796{col 37}{space 1}    5.21{col 46}{space 3}0.000{col 54}{space 4}  .107824{col 67}{space 3} .2380707
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .0858541{col 26}{space 2} .0331796{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0207307{col 67}{space 3} .1509775
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.1706971{col 26}{space 2}  .050361{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-.2695434{col 67}{space 3}-.0718509
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.4756038{col 26}{space 2} .0331796{col 37}{space 1}  -14.33{col 46}{space 3}0.000{col 54}{space 4}-.5407272{col 67}{space 3}-.4104804
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.3672645{col 26}{space 2} .0331796{col 37}{space 1}  -11.07{col 46}{space 3}0.000{col 54}{space 4}-.4323879{col 67}{space 3}-.3021411
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.6292035{col 26}{space 2} .0331796{col 37}{space 1}  -18.96{col 46}{space 3}0.000{col 54}{space 4}-.6943268{col 67}{space 3}-.5640801
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.8072599{col 26}{space 2}  .034671{col 37}{space 1}  -23.28{col 46}{space 3}0.000{col 54}{space 4}-.8753105{col 67}{space 3}-.7392093
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} .3435514{col 26}{space 2} .0540901{col 37}{space 1}    6.35{col 46}{space 3}0.000{col 54}{space 4} .2373859{col 67}{space 3}  .449717
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.1127945{col 26}{space 2} .0331796{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.1779179{col 67}{space 3}-.0476711
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8041455{col 26}{space 2} .0669386{col 37}{space 1}  -12.01{col 46}{space 3}0.000{col 54}{space 4}-.9355293{col 67}{space 3}-.6727617
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.5828151{col 26}{space 2} .0331796{col 37}{space 1}  -17.57{col 46}{space 3}0.000{col 54}{space 4}-.6479385{col 67}{space 3}-.5176917
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1240088{col 26}{space 2} .0357045{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-.1940878{col 67}{space 3}-.0539298
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.2197645{col 26}{space 2} .0419141{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.3020315{col 67}{space 3}-.1374975
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.5876597{col 26}{space 2} .0331796{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-.6527831{col 67}{space 3}-.5225363
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.037679{col 26}{space 2} .0331796{col 37}{space 1}  -31.27{col 46}{space 3}0.000{col 54}{space 4}-1.102802{col 67}{space 3}-.9725552
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}    .0494{col 26}{space 2} .0331796{col 37}{space 1}    1.49{col 46}{space 3}0.137{col 54}{space 4}-.0157234{col 67}{space 3} .1145234
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.1332017{col 26}{space 2} .0331796{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4} -.198325{col 67}{space 3}-.0680783
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0729816{col 26}{space 2} .0331796{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4} -.138105{col 67}{space 3}-.0078582
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0642178{col 26}{space 2} .0540901{col 37}{space 1}   -1.19{col 46}{space 3}0.235{col 54}{space 4}-.1703834{col 67}{space 3} .0419477
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.3947249{col 26}{space 2} .0331796{col 37}{space 1}  -11.90{col 46}{space 3}0.000{col 54}{space 4}-.4598483{col 67}{space 3}-.3296016
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.5028121{col 26}{space 2} .0331796{col 37}{space 1}  -15.15{col 46}{space 3}0.000{col 54}{space 4}-.5679354{col 67}{space 3}-.4376887
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.3550252{col 26}{space 2} .0331796{col 37}{space 1}  -10.70{col 46}{space 3}0.000{col 54}{space 4}-.4201486{col 67}{space 3}-.2899018
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.570901{col 26}{space 2} .0338619{col 37}{space 1}  -16.86{col 46}{space 3}0.000{col 54}{space 4}-.6373635{col 67}{space 3}-.5044386
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.4850967{col 26}{space 2} .0331796{col 37}{space 1}  -14.62{col 46}{space 3}0.000{col 54}{space 4}-.5502201{col 67}{space 3}-.4199733
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0951201{col 26}{space 2} .0331796{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-.1602435{col 67}{space 3}-.0299968
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .2530209{col 26}{space 2} .0331796{col 37}{space 1}    7.63{col 46}{space 3}0.000{col 54}{space 4} .1878975{col 67}{space 3} .3181443
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-.1216089{col 26}{space 2} .0218134{col 37}{space 1}   -5.57{col 46}{space 3}0.000{col 54}{space 4}-.1644231{col 67}{space 3}-.0787947
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-.1579019{col 26}{space 2} .0218134{col 37}{space 1}   -7.24{col 46}{space 3}0.000{col 54}{space 4}-.2007161{col 67}{space 3}-.1150877
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-.1498036{col 26}{space 2} .0219675{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.1929204{col 67}{space 3}-.1066868
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.1661469{col 26}{space 2} .0219675{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.2092637{col 67}{space 3}-.1230301
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-.1089457{col 26}{space 2} .0225764{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-.1532576{col 67}{space 3}-.0646338
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-.1168819{col 26}{space 2} .0227392{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4}-.1615134{col 67}{space 3}-.0722505
{txt}{space 7}1988  {c |}{col 14}{res}{space 2}-.1059111{col 26}{space 2} .0227392{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-.1505425{col 67}{space 3}-.0612797
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}-.1675115{col 26}{space 2} .0227392{col 37}{space 1}   -7.37{col 46}{space 3}0.000{col 54}{space 4}-.2121429{col 67}{space 3}-.1228801
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}-.1831926{col 26}{space 2} .0227392{col 37}{space 1}   -8.06{col 46}{space 3}0.000{col 54}{space 4} -.227824{col 67}{space 3}-.1385612
{txt}{space 7}1991  {c |}{col 14}{res}{space 2}-.2536254{col 26}{space 2}  .022899{col 37}{space 1}  -11.08{col 46}{space 3}0.000{col 54}{space 4}-.2985705{col 67}{space 3}-.2086802
{txt}{space 7}1992  {c |}{col 14}{res}{space 2}-.3092342{col 26}{space 2}  .022899{col 37}{space 1}  -13.50{col 46}{space 3}0.000{col 54}{space 4}-.3541794{col 67}{space 3}-.2642891
{txt}{space 7}1993  {c |}{col 14}{res}{space 2}-.3109858{col 26}{space 2} .0230632{col 37}{space 1}  -13.48{col 46}{space 3}0.000{col 54}{space 4}-.3562531{col 67}{space 3}-.2657185
{txt}{space 7}1994  {c |}{col 14}{res}{space 2}-.3134476{col 26}{space 2} .0230632{col 37}{space 1}  -13.59{col 46}{space 3}0.000{col 54}{space 4}-.3587149{col 67}{space 3}-.2681803
{txt}{space 7}1995  {c |}{col 14}{res}{space 2} -.291764{col 26}{space 2} .0230632{col 37}{space 1}  -12.65{col 46}{space 3}0.000{col 54}{space 4}-.3370313{col 67}{space 3}-.2464967
{txt}{space 7}1996  {c |}{col 14}{res}{space 2}-.3059367{col 26}{space 2} .0234081{col 37}{space 1}  -13.07{col 46}{space 3}0.000{col 54}{space 4}-.3518809{col 67}{space 3}-.2599924
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}-.2862229{col 26}{space 2} .0234081{col 37}{space 1}  -12.23{col 46}{space 3}0.000{col 54}{space 4}-.3321671{col 67}{space 3}-.2402787
{txt}{space 7}1998  {c |}{col 14}{res}{space 2}-.3062277{col 26}{space 2} .0239836{col 37}{space 1}  -12.77{col 46}{space 3}0.000{col 54}{space 4}-.3533015{col 67}{space 3}-.2591539
{txt}{space 7}1999  {c |}{col 14}{res}{space 2}-.3025445{col 26}{space 2} .0239836{col 37}{space 1}  -12.61{col 46}{space 3}0.000{col 54}{space 4}-.3496183{col 67}{space 3}-.2554707
{txt}{space 7}2000  {c |}{col 14}{res}{space 2}-.3236965{col 26}{space 2} .0246457{col 37}{space 1}  -13.13{col 46}{space 3}0.000{col 54}{space 4}-.3720699{col 67}{space 3}-.2753232
{txt}{space 7}2001  {c |}{col 14}{res}{space 2}-.3268277{col 26}{space 2} .0246457{col 37}{space 1}  -13.26{col 46}{space 3}0.000{col 54}{space 4}-.3752011{col 67}{space 3}-.2784543
{txt}{space 7}2002  {c |}{col 14}{res}{space 2}-.2920869{col 26}{space 2} .0248892{col 37}{space 1}  -11.74{col 46}{space 3}0.000{col 54}{space 4}-.3409381{col 67}{space 3}-.2432356
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-.3085507{col 26}{space 2} .0251457{col 37}{space 1}  -12.27{col 46}{space 3}0.000{col 54}{space 4}-.3579055{col 67}{space 3}-.2591959
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.169429{col 26}{space 2} .0288583{col 37}{space 1}  -40.52{col 46}{space 3}0.000{col 54}{space 4} -1.22607{col 67}{space 3}-1.112787
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. // 2) Get \hat{c -(}tau{c )-}
. // 2a) Compute \hat{c -(}y(0){c )-} = in omega_1 population
. predict yhat, xb
{txt}
{com}. // 2b) Compute \hat{c -(}tau{c )-} = y-\hat{c -(}y(0){c )-}
. gen tau_hat_it = ln_fat_pc - yhat if primary == 1 // 
{txt}(922 missing values generated)

{com}. 
. // 3) Estimate tau_w by a weighted sum over omega_q
. // For weights, w_it, I follow Liu et al. (2022) AJPS who use a regular average
. gen h = year - cohort if cohort != 999
{txt}(690 missing values generated)

{com}. byso h (cohort) : egen ATT_h_Liu = mean(tau_hat_it) // get horizon specific ATT
{txt}(922 missing values generated)

{com}. 
. // why are these ATTs much larger than ATT dCDH? 
. // Are my tau_hats right? What about my weights/averaging method?
. label var h "Horizon"
{txt}
{com}. label var ATT_h_Liu "ATT_h (Imputation ATTs by horizon, weighted regularly)"
{txt}
{com}. 
. egen ATT_Liu = mean(tau_hat_it) // tau_w (tau given weights)
{txt}
{com}. label var ATT_Liu "ATT Liu et al (Imputation ATT, weighted regularly)"
{txt}
{com}. 
. 
. preserve
{txt}
{com}.         keep h ATT_h_Liu ATT_Liu
{txt}
{com}.         keep if ATT_h_Liu != .
{txt}(922 observations deleted)

{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(162 observations deleted)

{com}.         
.         // save
.         compress
  {txt}variable {bf}h{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (60 bytes saved)

{com}.         save "$dta_loc\q3b_ATTs", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data\q3b_ATTs.dta saved

{com}.         
.         // get overall mean
.         qui sum ATT_Liu
{txt}
{com}.         global att_est_3b = round(`r(mean)', 0.001)
{txt}
{com}. 
.         // plot
.         line ATT_h_Liu h, ///
>                 yline($att_est) ///
>                 note("Note: Displayed are horizon-specific ATT estimates along with the general average in red.") ///
>                 saving("$do_loc/Graphs/ATT_BJS", replace)
{res}{txt}(file //Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/Graphs/ATT_BJS.gph saved)

{com}. 
.         graph export "$do_loc/Graphs/ATT_BJS.png", ///
>                 width(1200) height(900) ///
>                 replace 
{txt}(file //Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/Graphs/ATT_BJS.png written in PNG format)

{com}.         
. restore
{txt}
{com}. 
. 
. // 4) Estimate standard error (conservative estimate)
. // Following Theorem 3 in BJS (2023), the plug-in estimator (eqn (7))
. // Approach 1: Pool multiple cohorts for simplicity 
. gen cohort_coarse = 999 if cohort == 999 // decade cohort
{txt}(414 missing values generated)

{com}. replace cohort_coarse = 1980 if inrange(cohort, 1980, 1989)
{txt}(138 real changes made)

{com}. replace cohort_coarse = 1990 if inrange(cohort, 1990, 1999)
{txt}(161 real changes made)

{com}. replace cohort_coarse = 2000 if inrange(cohort, 2000, 2009)
{txt}(115 real changes made)

{com}. 
. // get eps_it = tau_hat_{c -(}it{c )-} - tau_hat_{c -(}Et{c )-}
. byso cohort_coarse (h) : egen tau_hat_coarset = mean(tau_hat_it) 
{txt}(690 missing values generated)

{com}. replace tau_hat_coarset = . if primary != 1
{txt}(232 real changes made, 232 to missing)

{com}. gen eps_it = tau_hat_it - tau_hat_coarset
{txt}(922 missing values generated)

{com}. sum eps_it

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}eps_it {c |}{res}        182    5.32e-10    .1400621  -.3030793   .3451158
{txt}
{com}. 
. // let v_it = w_it = size of omega_1
. count if primary == 1
  {res}182
{txt}
{com}. gen v_it = 1/`r(N)'
{txt}
{com}. gen v_e_it = v_it * eps_it
{txt}(922 missing values generated)

{com}. 
. // var(tau_it) = sum_i (sum_t v_it eps_it)^2
. byso state : egen sumt_v_e = total(v_e_it) // sum over time within state, i
{txt}
{com}. gen sumt_v_e_sq = sumt_v_e^2
{txt}
{com}. keep state sumt_v_e_sq
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(1,056 observations deleted)

{com}. egen sumi_sumt_v_e_sq = total(sumt_v_e_sq)
{txt}
{com}. gen se = sqrt(sumi_sumt_v_e_sq)
{txt}
{com}. qui sum se
{txt}
{com}. global se_est_3b = round(`r(mean)', 0.001)
{txt}
{com}. 
. 
. 
. dis "ATT = $att_est_3b"
{res}ATT = -.108
{txt}
{com}. dis "SE = $se_est_3b"
{res}SE = .033
{txt}
{com}. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3c.do"
{txt}
{com}. /*
> Title:          02_analysis_q3c.do
> Outline:        Question 3, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Now proceed with the DiD estimation. 
> 
> (c) Researchers sometimes use state population as weights. Describe two distinct reasons
> for using such weights. For this part only, modify the imputation procedure
> to accommodate each of these reasons one by one. Discuss how the estimates
> change from part 3(b).
> 
> */
. 
. 
. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. 
. 
. 
. 
. // Weighting approach 1: weight in regression step to address endogenous sampling
. /*
> 
> */
. 
. 
. // 1) Get predictions for alpha_i and beta_t by OLS in omega_0 
. reg ln_fat_pc i.state i.year if primary == 0 [aw=population]
{txt}(sum of wgt is 4,202,955.018)

      Source {c |}       SS           df       MS      Number of obs   ={res}       922
{txt}{hline 13}{c +}{hline 34}   F(69, 852)      = {res}   160.13
{txt}       Model {c |} {res} 77.8691429        69   1.1285383   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.00440134       852  .007047419   {txt}R-squared       ={res}    0.9284
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9226
{txt}       Total {c |} {res} 83.8735443       921  .091067909   {txt}Root MSE        =   {res} .08395

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ln_fat_pc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2}-.0136918{col 26}{space 2} .0312761{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4}-.0750791{col 67}{space 3} .0476955
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.0766459{col 26}{space 2} .0275124{col 37}{space 1}   -2.79{col 46}{space 3}0.005{col 54}{space 4}-.1306459{col 67}{space 3}-.0226459
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.3966732{col 26}{space 2} .0226667{col 37}{space 1}  -17.50{col 46}{space 3}0.000{col 54}{space 4}-.4411624{col 67}{space 3}-.3521841
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.3845504{col 26}{space 2} .0282065{col 37}{space 1}  -13.63{col 46}{space 3}0.000{col 54}{space 4}-.4399128{col 67}{space 3} -.329188
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.6097192{col 26}{space 2} .0496856{col 37}{space 1}  -12.27{col 46}{space 3}0.000{col 54}{space 4}-.7072398{col 67}{space 3}-.5121986
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.3379033{col 26}{space 2} .0502288{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.4364899{col 67}{space 3}-.2393166
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.1705662{col 26}{space 2} .0227173{col 37}{space 1}   -7.51{col 46}{space 3}0.000{col 54}{space 4}-.2151547{col 67}{space 3}-.1259777
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} -.133798{col 26}{space 2} .0273966{col 37}{space 1}   -4.88{col 46}{space 3}0.000{col 54}{space 4}-.1875708{col 67}{space 3}-.0800252
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.4725144{col 26}{space 2} .0517185{col 37}{space 1}   -9.14{col 46}{space 3}0.000{col 54}{space 4} -.574025{col 67}{space 3}-.3710038
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0623958{col 26}{space 2} .0407776{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4} -.142432{col 67}{space 3} .0176405
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6513126{col 26}{space 2} .0230313{col 37}{space 1}  -28.28{col 46}{space 3}0.000{col 54}{space 4}-.6965174{col 67}{space 3}-.6061078
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.3737395{col 26}{space 2} .0273553{col 37}{space 1}  -13.66{col 46}{space 3}0.000{col 54}{space 4}-.4274311{col 67}{space 3}-.3200479
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.2896731{col 26}{space 2} .0310044{col 37}{space 1}   -9.34{col 46}{space 3}0.000{col 54}{space 4}-.3505271{col 67}{space 3}-.2288191
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.1372316{col 26}{space 2}  .027877{col 37}{space 1}   -4.92{col 46}{space 3}0.000{col 54}{space 4}-.1919473{col 67}{space 3}-.0825159
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.2024003{col 26}{space 2}   .03013{col 37}{space 1}   -6.72{col 46}{space 3}0.000{col 54}{space 4} -.261538{col 67}{space 3}-.1432626
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.022963{col 26}{space 2} .0253401{col 37}{space 1}  -40.37{col 46}{space 3}0.000{col 54}{space 4}-1.072699{col 67}{space 3}-.9732266
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5591775{col 26}{space 2} .0285128{col 37}{space 1}  -19.61{col 46}{space 3}0.000{col 54}{space 4}-.6151411{col 67}{space 3} -.503214
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.4115746{col 26}{space 2} .0394184{col 37}{space 1}  -10.44{col 46}{space 3}0.000{col 54}{space 4}-.4889431{col 67}{space 3}-.3342061
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -.473601{col 26}{space 2} .0242856{col 37}{space 1}  -19.50{col 46}{space 3}0.000{col 54}{space 4}-.5212677{col 67}{space 3}-.4259343
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -.624383{col 26}{space 2}  .026855{col 37}{space 1}  -23.25{col 46}{space 3}0.000{col 54}{space 4}-.6770928{col 67}{space 3}-.5716733
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.1973964{col 26}{space 2} .0260311{col 37}{space 1}   -7.58{col 46}{space 3}0.000{col 54}{space 4}-.2484891{col 67}{space 3}-.1463038
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} .1768944{col 26}{space 2} .0305549{col 37}{space 1}    5.79{col 46}{space 3}0.000{col 54}{space 4} .1169228{col 67}{space 3}  .236866
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .0869567{col 26}{space 2} .0453893{col 37}{space 1}    1.92{col 46}{space 3}0.056{col 54}{space 4}-.0021312{col 67}{space 3} .1760446
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.1764174{col 26}{space 2} .0361154{col 37}{space 1}   -4.88{col 46}{space 3}0.000{col 54}{space 4} -.247303{col 67}{space 3}-.1055317
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.4781701{col 26}{space 2} .0505684{col 37}{space 1}   -9.46{col 46}{space 3}0.000{col 54}{space 4}-.5774234{col 67}{space 3}-.3789168
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.3666605{col 26}{space 2} .0356008{col 37}{space 1}  -10.30{col 46}{space 3}0.000{col 54}{space 4} -.436536{col 67}{space 3} -.296785
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.6431222{col 26}{space 2} .0407744{col 37}{space 1}  -15.77{col 46}{space 3}0.000{col 54}{space 4}-.7231523{col 67}{space 3}-.5630921
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.8146541{col 26}{space 2}  .025021{col 37}{space 1}  -32.56{col 46}{space 3}0.000{col 54}{space 4}-.8637641{col 67}{space 3} -.765544
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} .3391503{col 26}{space 2} .0711472{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} .1995059{col 67}{space 3} .4787946
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.1512801{col 26}{space 2} .0373354{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-.2245603{col 67}{space 3}    -.078
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.7998004{col 26}{space 2} .0326363{col 37}{space 1}  -24.51{col 46}{space 3}0.000{col 54}{space 4}-.8638574{col 67}{space 3}-.7357433
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.5849555{col 26}{space 2} .0232125{col 37}{space 1}  -25.20{col 46}{space 3}0.000{col 54}{space 4}-.6305159{col 67}{space 3}-.5393951
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1304838{col 26}{space 2} .0315468{col 37}{space 1}   -4.14{col 46}{space 3}0.000{col 54}{space 4}-.1924024{col 67}{space 3}-.0685653
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.2332761{col 26}{space 2}  .040061{col 37}{space 1}   -5.82{col 46}{space 3}0.000{col 54}{space 4} -.311906{col 67}{space 3}-.1546462
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.5894162{col 26}{space 2} .0229826{col 37}{space 1}  -25.65{col 46}{space 3}0.000{col 54}{space 4}-.6345255{col 67}{space 3} -.544307
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.040371{col 26}{space 2} .0423878{col 37}{space 1}  -24.54{col 46}{space 3}0.000{col 54}{space 4}-1.123568{col 67}{space 3}-.9571747
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .0519495{col 26}{space 2} .0282416{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0034818{col 67}{space 3} .1073807
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.1306376{col 26}{space 2} .0484748{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.2257815{col 67}{space 3}-.0354937
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0705534{col 26}{space 2}  .026157{col 37}{space 1}   -2.70{col 46}{space 3}0.007{col 54}{space 4}-.1218931{col 67}{space 3}-.0192137
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0706298{col 26}{space 2} .0291231{col 37}{space 1}   -2.43{col 46}{space 3}0.016{col 54}{space 4}-.1277913{col 67}{space 3}-.0134684
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.3979894{col 26}{space 2} .0338897{col 37}{space 1}  -11.74{col 46}{space 3}0.000{col 54}{space 4}-.4645064{col 67}{space 3}-.3314724
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.5074085{col 26}{space 2} .0251292{col 37}{space 1}  -20.19{col 46}{space 3}0.000{col 54}{space 4}-.5567308{col 67}{space 3}-.4580862
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.3611723{col 26}{space 2} .0535115{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-.4662021{col 67}{space 3}-.2561424
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.584587{col 26}{space 2} .0267385{col 37}{space 1}  -21.86{col 46}{space 3}0.000{col 54}{space 4}-.6370681{col 67}{space 3}-.5321059
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.4851933{col 26}{space 2}  .026258{col 37}{space 1}  -18.48{col 46}{space 3}0.000{col 54}{space 4}-.5367312{col 67}{space 3}-.4336554
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0988467{col 26}{space 2} .0341986{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.1659702{col 67}{space 3}-.0317233
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .2545207{col 26}{space 2} .0573303{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} .1419955{col 67}{space 3} .3670459
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-.1271942{col 26}{space 2} .0167686{col 37}{space 1}   -7.59{col 46}{space 3}0.000{col 54}{space 4}-.1601068{col 67}{space 3}-.0942816
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-.1679014{col 26}{space 2} .0167314{col 37}{space 1}  -10.04{col 46}{space 3}0.000{col 54}{space 4} -.200741{col 67}{space 3}-.1350618
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-.1345965{col 26}{space 2} .0171462{col 37}{space 1}   -7.85{col 46}{space 3}0.000{col 54}{space 4}-.1682502{col 67}{space 3}-.1009427
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.1487544{col 26}{space 2} .0171061{col 37}{space 1}   -8.70{col 46}{space 3}0.000{col 54}{space 4}-.1823295{col 67}{space 3}-.1151794
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-.0897004{col 26}{space 2} .0176796{col 37}{space 1}   -5.07{col 46}{space 3}0.000{col 54}{space 4} -.124401{col 67}{space 3}-.0549998
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-.0930505{col 26}{space 2} .0178107{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.1280086{col 67}{space 3}-.0580925
{txt}{space 7}1988  {c |}{col 14}{res}{space 2}-.0846886{col 26}{space 2} .0177631{col 37}{space 1}   -4.77{col 46}{space 3}0.000{col 54}{space 4}-.1195533{col 67}{space 3} -.049824
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}-.1318734{col 26}{space 2} .0177154{col 37}{space 1}   -7.44{col 46}{space 3}0.000{col 54}{space 4}-.1666443{col 67}{space 3}-.0971024
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}-.1703383{col 26}{space 2} .0176602{col 37}{space 1}   -9.65{col 46}{space 3}0.000{col 54}{space 4}-.2050008{col 67}{space 3}-.1356757
{txt}{space 7}1991  {c |}{col 14}{res}{space 2}-.2559687{col 26}{space 2} .0176731{col 37}{space 1}  -14.48{col 46}{space 3}0.000{col 54}{space 4}-.2906566{col 67}{space 3}-.2212807
{txt}{space 7}1992  {c |}{col 14}{res}{space 2}-.3323497{col 26}{space 2} .0176096{col 37}{space 1}  -18.87{col 46}{space 3}0.000{col 54}{space 4}-.3669131{col 67}{space 3}-.2977863
{txt}{space 7}1993  {c |}{col 14}{res}{space 2}-.3029031{col 26}{space 2} .0184107{col 37}{space 1}  -16.45{col 46}{space 3}0.000{col 54}{space 4}-.3390387{col 67}{space 3}-.2667675
{txt}{space 7}1994  {c |}{col 14}{res}{space 2}-.3024628{col 26}{space 2}  .018346{col 37}{space 1}  -16.49{col 46}{space 3}0.000{col 54}{space 4}-.3384715{col 67}{space 3}-.2664541
{txt}{space 7}1995  {c |}{col 14}{res}{space 2}-.2866623{col 26}{space 2} .0182836{col 37}{space 1}  -15.68{col 46}{space 3}0.000{col 54}{space 4}-.3225486{col 67}{space 3}-.2507761
{txt}{space 7}1996  {c |}{col 14}{res}{space 2}-.3026957{col 26}{space 2} .0185996{col 37}{space 1}  -16.27{col 46}{space 3}0.000{col 54}{space 4}-.3392021{col 67}{space 3}-.2661893
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}-.3021214{col 26}{space 2} .0185431{col 37}{space 1}  -16.29{col 46}{space 3}0.000{col 54}{space 4} -.338517{col 67}{space 3}-.2657259
{txt}{space 7}1998  {c |}{col 14}{res}{space 2}-.3270152{col 26}{space 2} .0189969{col 37}{space 1}  -17.21{col 46}{space 3}0.000{col 54}{space 4}-.3643015{col 67}{space 3}-.2897289
{txt}{space 7}1999  {c |}{col 14}{res}{space 2}-.3241551{col 26}{space 2} .0189426{col 37}{space 1}  -17.11{col 46}{space 3}0.000{col 54}{space 4}-.3613348{col 67}{space 3}-.2869753
{txt}{space 7}2000  {c |}{col 14}{res}{space 2}-.3282362{col 26}{space 2} .0198264{col 37}{space 1}  -16.56{col 46}{space 3}0.000{col 54}{space 4}-.3671506{col 67}{space 3}-.2893219
{txt}{space 7}2001  {c |}{col 14}{res}{space 2} -.341557{col 26}{space 2} .0197713{col 37}{space 1}  -17.28{col 46}{space 3}0.000{col 54}{space 4}-.3803633{col 67}{space 3}-.3027508
{txt}{space 7}2002  {c |}{col 14}{res}{space 2}  -.30742{col 26}{space 2}  .019996{col 37}{space 1}  -15.37{col 46}{space 3}0.000{col 54}{space 4}-.3466673{col 67}{space 3}-.2681728
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-.3289171{col 26}{space 2} .0199794{col 37}{space 1}  -16.46{col 46}{space 3}0.000{col 54}{space 4}-.3681317{col 67}{space 3}-.2897025
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  -1.1686{col 26}{space 2} .0234874{col 37}{space 1}  -49.75{col 46}{space 3}0.000{col 54}{space 4}  -1.2147{col 67}{space 3}  -1.1225
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. // 2) Get \hat{c -(}tau{c )-}
. // 2a) Compute \hat{c -(}y(0){c )-} = in omega_1 population
. predict yhat, xb
{txt}
{com}. // 2b) Compute \hat{c -(}tau{c )-} = y-\hat{c -(}y(0){c )-}
. gen tau_hat_it = ln_fat_pc - yhat if primary == 1 // 
{txt}(922 missing values generated)

{com}. 
. // 3) Estimate tau_w by a weighted sum over omega_q
. // For weights, w_it, I follow Liu et al. (2022) AJPS who use a regular average
. gen h = year - cohort if cohort != 999
{txt}(690 missing values generated)

{com}. byso h (cohort) : egen ATT_h_Liu = mean(tau_hat_it) // get horizon specific ATT
{txt}(922 missing values generated)

{com}. label var ATT_h_Liu "ATT_h Liu et al (Imputation ATTs by horizon weighted regularly)"
{txt}
{com}. 
. egen ATT_Liu = mean(tau_hat_it) // tau_w (tau given weights)
{txt}
{com}. label var ATT_Liu "ATT Liu et al (Imputation ATT weighted regularly)"
{txt}
{com}. qui sum ATT_Liu
{txt}
{com}. global att_est_3c1 = round(`r(mean)', 0.001)
{txt}
{com}. 
. 
. preserve
{txt}
{com}.         keep h ATT_h_Liu ATT_Liu
{txt}
{com}.         keep if ATT_h_Liu != .
{txt}(922 observations deleted)

{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(162 observations deleted)

{com}.         
.         // save
.         compress
  {txt}variable {bf}h{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (60 bytes saved)

{com}.         save "$dta_loc\q3c_ATTs", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data\q3c_ATTs.dta saved

{com}. restore
{txt}
{com}. 
. 
. 
. // 4) Estimate standard error (conservative estimate)
. // Following Theorem 3 in BJS (2023), the plug-in estimator (eqn (7))
. // Approach 1: Pool multiple cohorts for simplicity 
. gen cohort_coarse = 999 if cohort == 999 // decade cohort
{txt}(414 missing values generated)

{com}. replace cohort_coarse = 1980 if inrange(cohort, 1980, 1989)
{txt}(138 real changes made)

{com}. replace cohort_coarse = 1990 if inrange(cohort, 1990, 1999)
{txt}(161 real changes made)

{com}. replace cohort_coarse = 2000 if inrange(cohort, 2000, 2009)
{txt}(115 real changes made)

{com}. 
. // get eps_it = tau_hat_{c -(}it{c )-} - tau_hat_{c -(}Et{c )-}
. byso cohort_coarse (h) : egen tau_hat_coarset = mean(tau_hat_it) 
{txt}(690 missing values generated)

{com}. replace tau_hat_coarset = . if primary != 1
{txt}(232 real changes made, 232 to missing)

{com}. gen eps_it = tau_hat_it - tau_hat_coarset
{txt}(922 missing values generated)

{com}. sum eps_it

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}eps_it {c |}{res}        182   -2.74e-09    .1370698  -.2923916   .3408962
{txt}
{com}. 
. // let v_it = w_it = size of omega_1
. count if primary == 1
  {res}182
{txt}
{com}. local treat_n `r(N)'
{txt}
{com}. gen v_it = 1/`treat_n'
{txt}
{com}. gen v_e_it = v_it * eps_it
{txt}(922 missing values generated)

{com}. 
. // var(tau_it) = sum_i (sum_t v_it eps_it)^2
. byso state : egen sumt_v_e = total(v_e_it) // sum over time within state, i
{txt}
{com}. gen sumt_v_e_sq = sumt_v_e^2
{txt}
{com}. 
. preserve 
{txt}
{com}.         keep state sumt_v_e_sq
{txt}
{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(1,056 observations deleted)

{com}.         egen sumi_sumt_v_e_sq = total(sumt_v_e_sq)
{txt}
{com}.         gen se = sqrt(sumi_sumt_v_e_sq)
{txt}
{com}.         qui sum se
{txt}
{com}.         global se_est_3c1 = round(`r(mean)', 0.001)
{txt}
{com}. restore
{txt}
{com}. 
. 
. 
. 
. 
. // Weighting approach 2: weight in averaging step to address HTE by it
. egen pop_tot = total(population) if primary == 1
{txt}(922 missing values generated)

{com}. gen pop_w_it = population/pop_tot
{txt}(922 missing values generated)

{com}. gen weighted_tau_it = tau_hat_it * pop_w_it
{txt}(922 missing values generated)

{com}. egen ATT_popw = sum(weighted_tau_it)
{txt}
{com}. qui sum ATT_popw
{txt}
{com}. global att_est_3c2 = round(`r(mean)', 0.001)
{txt}
{com}. 
. 
. 
. // 4) Estimate standard error (conservative estimate)
. // Following Theorem 3 in BJS (2023), the plug-in estimator (eqn (7))
. // Approach 1: Pool multiple cohorts for simplicity 
. // let v_it = new weight = pop weights omega_1
. gen popw_e_it = pop_w_it * eps_it
{txt}(922 missing values generated)

{com}. 
. // var(tau_it) = sum_i (sum_t v_it eps_it)^2
. byso state : egen sumt_popw_e = total(popw_e_it) // sum over time within state, i
{txt}
{com}. gen sumt_popw_e_sq = sumt_popw_e^2
{txt}
{com}. 
. preserve 
{txt}
{com}.         keep state sumt_popw_e_sq
{txt}
{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(1,056 observations deleted)

{com}.         egen sumi_sumt_popw_e_sq = total(sumt_popw_e_sq)
{txt}
{com}.         gen se = sqrt(sumi_sumt_popw_e_sq)
{txt}
{com}.         
.         qui sum se
{txt}
{com}.         global se_est_3c2 = round(`r(mean)', 0.001)
{txt}
{com}. restore
{txt}
{com}. 
. 
. 
. 
. dis "Weighting method 1 gives ""
{res}Weighting method 1 gives 
{txt}
{com}. dis "   ATT = $att_est_3c1"
{res}   ATT = -.098
{txt}
{com}. dis "   SE = $se_est_3c1"
{res}   SE = .033
{txt}
{com}. 
. dis "Weighting method 2 gives "
{res}Weighting method 2 gives 
{txt}
{com}. dis "   ATT = $att_est_3c2"
{res}   ATT = -.142
{txt}
{com}. dis "   SE = $se_est_3c2"
{res}   SE = .044
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3d.do"
{txt}
{com}. /*
> Title:          02_analysis_q3d.do
> Outline:        Question 3, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Now proceed with the DiD estimation. 
> 
> (d) How sensitive are the estimates to including state-specific linear trends into your
> model of untreated potential outcomes?
> 
> */
. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. 
. // 1) Get predictions for alpha_i and beta_t by OLS in omega_0 
. // using state specific time trends atop state and time trends
. // reg ln_fat_pc i.state##i.year if primary == 0 
. gen state_yr = state*year
{txt}
{com}. tab state, gen(state_)

      {txt}state {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         AL {c |}{res}         23        2.08        2.08
{txt}         AR {c |}{res}         23        2.08        4.17
{txt}         AZ {c |}{res}         23        2.08        6.25
{txt}         CA {c |}{res}         23        2.08        8.33
{txt}         CO {c |}{res}         23        2.08       10.42
{txt}         CT {c |}{res}         23        2.08       12.50
{txt}         DE {c |}{res}         23        2.08       14.58
{txt}         FL {c |}{res}         23        2.08       16.67
{txt}         GA {c |}{res}         23        2.08       18.75
{txt}         IA {c |}{res}         23        2.08       20.83
{txt}         ID {c |}{res}         23        2.08       22.92
{txt}         IL {c |}{res}         23        2.08       25.00
{txt}         IN {c |}{res}         23        2.08       27.08
{txt}         KS {c |}{res}         23        2.08       29.17
{txt}         KY {c |}{res}         23        2.08       31.25
{txt}         LA {c |}{res}         23        2.08       33.33
{txt}         MA {c |}{res}         23        2.08       35.42
{txt}         MD {c |}{res}         23        2.08       37.50
{txt}         ME {c |}{res}         23        2.08       39.58
{txt}         MI {c |}{res}         23        2.08       41.67
{txt}         MN {c |}{res}         23        2.08       43.75
{txt}         MO {c |}{res}         23        2.08       45.83
{txt}         MS {c |}{res}         23        2.08       47.92
{txt}         MT {c |}{res}         23        2.08       50.00
{txt}         NC {c |}{res}         23        2.08       52.08
{txt}         ND {c |}{res}         23        2.08       54.17
{txt}         NE {c |}{res}         23        2.08       56.25
{txt}         NH {c |}{res}         23        2.08       58.33
{txt}         NJ {c |}{res}         23        2.08       60.42
{txt}         NM {c |}{res}         23        2.08       62.50
{txt}         NV {c |}{res}         23        2.08       64.58
{txt}         NY {c |}{res}         23        2.08       66.67
{txt}         OH {c |}{res}         23        2.08       68.75
{txt}         OK {c |}{res}         23        2.08       70.83
{txt}         OR {c |}{res}         23        2.08       72.92
{txt}         PA {c |}{res}         23        2.08       75.00
{txt}         RI {c |}{res}         23        2.08       77.08
{txt}         SC {c |}{res}         23        2.08       79.17
{txt}         SD {c |}{res}         23        2.08       81.25
{txt}         TN {c |}{res}         23        2.08       83.33
{txt}         TX {c |}{res}         23        2.08       85.42
{txt}         UT {c |}{res}         23        2.08       87.50
{txt}         VA {c |}{res}         23        2.08       89.58
{txt}         VT {c |}{res}         23        2.08       91.67
{txt}         WA {c |}{res}         23        2.08       93.75
{txt}         WI {c |}{res}         23        2.08       95.83
{txt}         WV {c |}{res}         23        2.08       97.92
{txt}         WY {c |}{res}         23        2.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,104      100.00
{txt}
{com}. foreach var of varlist state_* {c -(}
{txt}  2{com}.         gen `var'_yr = `var'*year
{txt}  3{com}. {c )-}
{txt}
{com}. reg ln_fat_pc i.state i.year state_*_yr if primary == 0 
{p 0 6 2}{txt}note: state_48_yr omitted because of collinearity{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       922
{txt}{hline 13}{c +}{hline 34}   F(117, 804)     = {res}   110.60
{txt}       Model {c |} {res} 94.0633664       117  .803960397   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5.84450977       804  .007269291   {txt}R-squared       ={res}    0.9415
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9330
{txt}       Total {c |} {res} 99.9078762       921  .108477607   {txt}Root MSE        =   {res} .08526

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ln_fat_pc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2} 48.96881{col 26}{space 2} 22.81741{col 37}{space 1}    2.15{col 46}{space 3}0.032{col 54}{space 4} 4.180084{col 67}{space 3} 93.75754
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} 112.2704{col 26}{space 2} 44.04238{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} 25.81883{col 67}{space 3} 198.7221
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} 149.8659{col 26}{space 2} 69.75859{col 37}{space 1}    2.15{col 46}{space 3}0.032{col 54}{space 4} 12.93544{col 67}{space 3} 286.7963
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} 166.3448{col 26}{space 2} 87.84234{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4}-6.082639{col 67}{space 3} 338.7722
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} 208.8586{col 26}{space 2}  125.797{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-38.07069{col 67}{space 3}  455.788
{txt}{space 9}DE  {c |}{col 14}{res}{space 2} 223.9196{col 26}{space 2}  132.182{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-35.54286{col 67}{space 3} 483.3821
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}  263.505{col 26}{space 2} 154.0356{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4} -38.8545{col 67}{space 3} 565.8644
{txt}{space 9}GA  {c |}{col 14}{res}{space 2} 272.4701{col 26}{space 2} 177.8553{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-76.64554{col 67}{space 3} 621.5857
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} 356.4303{col 26}{space 2} 208.3445{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}  -52.533{col 67}{space 3} 765.3936
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} 344.0352{col 26}{space 2} 220.3468{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-88.48784{col 67}{space 3} 776.5582
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} 370.5491{col 26}{space 2} 242.4601{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-105.3803{col 67}{space 3} 846.4786
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} 387.5745{col 26}{space 2} 265.5375{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-133.6541{col 67}{space 3} 908.8032
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}  416.084{col 26}{space 2} 286.6942{col 37}{space 1}    1.45{col 46}{space 3}0.147{col 54}{space 4}-146.6734{col 67}{space 3} 978.8414
{txt}{space 9}KY  {c |}{col 14}{res}{space 2} 432.7424{col 26}{space 2}  308.814{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-173.4344{col 67}{space 3} 1038.919
{txt}{space 9}LA  {c |}{col 14}{res}{space 2} 479.8401{col 26}{space 2} 331.9409{col 37}{space 1}    1.45{col 46}{space 3}0.149{col 54}{space 4} -171.733{col 67}{space 3} 1131.413
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} 558.7316{col 26}{space 2} 353.0566{col 37}{space 1}    1.58{col 46}{space 3}0.114{col 54}{space 4}-134.2898{col 67}{space 3} 1251.753
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} 556.4788{col 26}{space 2} 375.7865{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-181.1597{col 67}{space 3} 1294.117
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} 575.8995{col 26}{space 2} 397.3042{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-203.9764{col 67}{space 3} 1355.775
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} 594.3768{col 26}{space 2}  419.743{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4}-229.5447{col 67}{space 3} 1418.298
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} 626.3205{col 26}{space 2} 441.5536{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-240.4133{col 67}{space 3} 1493.054
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} 634.8939{col 26}{space 2}  463.679{col 37}{space 1}    1.37{col 46}{space 3}0.171{col 54}{space 4}-275.2704{col 67}{space 3} 1545.058
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} 657.9198{col 26}{space 2} 485.8048{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-295.6758{col 67}{space 3} 1611.515
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} 719.7109{col 26}{space 2}  507.931{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4}-277.3165{col 67}{space 3} 1716.738
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}  681.554{col 26}{space 2} 531.6586{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-362.0487{col 67}{space 3} 1725.157
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} 776.0523{col 26}{space 2} 552.1842{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-307.8406{col 67}{space 3} 1859.945
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} 798.3354{col 26}{space 2} 574.3112{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-328.9908{col 67}{space 3} 1925.662
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} 885.0697{col 26}{space 2} 596.4383{col 37}{space 1}    1.48{col 46}{space 3}0.138{col 54}{space 4}-285.6903{col 67}{space 3}  2055.83
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} 902.0602{col 26}{space 2}  618.473{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-311.9521{col 67}{space 3} 2116.072
{txt}{space 9}NM  {c |}{col 14}{res}{space 2}  906.007{col 26}{space 2} 642.0076{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4}-354.2019{col 67}{space 3} 2166.216
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}  971.481{col 26}{space 2} 662.8209{col 37}{space 1}    1.47{col 46}{space 3}0.143{col 54}{space 4}-329.5826{col 67}{space 3} 2272.545
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} 993.2382{col 26}{space 2} 694.0043{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-369.0359{col 67}{space 3} 2355.512
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} 999.4689{col 26}{space 2} 707.0766{col 37}{space 1}    1.41{col 46}{space 3}0.158{col 54}{space 4}-388.4651{col 67}{space 3} 2387.403
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} 1024.039{col 26}{space 2} 728.7188{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-406.3767{col 67}{space 3} 2454.455
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} 1023.455{col 26}{space 2}  750.187{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4} -449.101{col 67}{space 3} 2496.012
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} 1084.304{col 26}{space 2}  773.461{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4} -433.937{col 67}{space 3} 2602.545
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} 1125.671{col 26}{space 2} 795.5893{col 37}{space 1}    1.41{col 46}{space 3}0.157{col 54}{space 4}-436.0066{col 67}{space 3} 2687.348
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} 1128.535{col 26}{space 2} 817.7177{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-476.5787{col 67}{space 3} 2733.648
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} 1140.275{col 26}{space 2} 839.8461{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-508.2753{col 67}{space 3} 2788.824
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}  1186.93{col 26}{space 2} 861.9747{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-505.0565{col 67}{space 3} 2878.916
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} 1308.976{col 26}{space 2} 882.6304{col 37}{space 1}    1.48{col 46}{space 3}0.138{col 54}{space 4}-423.5563{col 67}{space 3} 3041.507
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} 1267.509{col 26}{space 2} 906.2319{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-511.3504{col 67}{space 3} 3046.369
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} 1301.539{col 26}{space 2} 928.3605{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4}-520.7572{col 67}{space 3} 3123.836
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} 1345.846{col 26}{space 2} 950.4893{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4} -519.887{col 67}{space 3}  3211.58
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} 1379.634{col 26}{space 2} 972.2108{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-528.7369{col 67}{space 3} 3288.005
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} 1373.078{col 26}{space 2} 994.7469{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-579.5297{col 67}{space 3} 3325.685
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} 1393.608{col 26}{space 2} 1016.876{col 37}{space 1}    1.37{col 46}{space 3}0.171{col 54}{space 4}-602.4369{col 67}{space 3} 3389.653
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} 1422.634{col 26}{space 2} 1039.005{col 37}{space 1}    1.37{col 46}{space 3}0.171{col 54}{space 4}-616.8482{col 67}{space 3} 3462.116
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-1.542473{col 26}{space 2} 1.063712{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-3.630454{col 67}{space 3} .5455083
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-2.999989{col 26}{space 2} 2.127479{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-7.176057{col 67}{space 3} 1.176079
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-4.414161{col 26}{space 2} 3.191565{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-10.67894{col 67}{space 3} 1.850622
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-5.852798{col 26}{space 2} 4.255933{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-14.20685{col 67}{space 3} 2.501253
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-7.223272{col 26}{space 2} 5.320591{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-17.66716{col 67}{space 3} 3.220616
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-8.652941{col 26}{space 2} 6.385514{col 37}{space 1}   -1.36{col 46}{space 3}0.176{col 54}{space 4}-21.18719{col 67}{space 3} 3.881304
{txt}{space 7}1988  {c |}{col 14}{res}{space 2} -10.0662{col 26}{space 2} 7.450718{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-24.69135{col 67}{space 3} 4.558959
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}-11.55239{col 26}{space 2} 8.516195{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-28.26899{col 67}{space 3} 5.164211
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}-12.99304{col 26}{space 2}  9.58195{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-31.80163{col 67}{space 3} 5.815556
{txt}{space 7}1991  {c |}{col 14}{res}{space 2}  -14.487{col 26}{space 2} 10.64794{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-35.38805{col 67}{space 3} 6.414049
{txt}{space 7}1992  {c |}{col 14}{res}{space 2}-15.96797{col 26}{space 2} 11.71423{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-38.96206{col 67}{space 3} 7.026113
{txt}{space 7}1993  {c |}{col 14}{res}{space 2}-17.39695{col 26}{space 2} 12.78087{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-42.48476{col 67}{space 3} 7.690865
{txt}{space 7}1994  {c |}{col 14}{res}{space 2}-18.82577{col 26}{space 2} 13.84774{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-46.00776{col 67}{space 3} 8.356224
{txt}{space 7}1995  {c |}{col 14}{res}{space 2}-20.23081{col 26}{space 2} 14.91488{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-49.50751{col 67}{space 3} 9.045897
{txt}{space 7}1996  {c |}{col 14}{res}{space 2}-21.67072{col 26}{space 2} 15.98247{col 37}{space 1}   -1.36{col 46}{space 3}0.176{col 54}{space 4}-53.04301{col 67}{space 3} 9.701574
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}-23.07836{col 26}{space 2} 17.05023{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-56.54657{col 67}{space 3} 10.38986
{txt}{space 7}1998  {c |}{col 14}{res}{space 2} -24.5265{col 26}{space 2} 18.11838{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4} -60.0914{col 67}{space 3} 11.03841
{txt}{space 7}1999  {c |}{col 14}{res}{space 2}  -25.951{col 26}{space 2} 19.18674{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-63.61301{col 67}{space 3} 11.71101
{txt}{space 7}2000  {c |}{col 14}{res}{space 2} -27.3975{col 26}{space 2} 20.25572{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-67.15784{col 67}{space 3} 12.36285
{txt}{space 7}2001  {c |}{col 14}{res}{space 2}-28.82936{col 26}{space 2} 21.32476{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-70.68814{col 67}{space 3} 13.02942
{txt}{space 7}2002  {c |}{col 14}{res}{space 2}-30.22882{col 26}{space 2} 22.39382{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-74.18608{col 67}{space 3} 13.72844
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-31.67667{col 26}{space 2}  23.4637{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-77.73402{col 67}{space 3} 14.38067
{txt}{space 12} {c |}
{space 1}state_yr_yr {c |}{col 14}{res}{space 2} 7.50e-06{col 26}{space 2} 5.58e-06{col 37}{space 1}    1.34{col 46}{space 3}0.179{col 54}{space 4}-3.45e-06{col 67}{space 3} .0000184
{txt}{space 2}state_1_yr {c |}{col 14}{res}{space 2} 1.416101{col 26}{space 2} 1.043727{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-.6326505{col 67}{space 3} 3.464852
{txt}{space 2}state_2_yr {c |}{col 14}{res}{space 2} 1.376554{col 26}{space 2} 1.022075{col 37}{space 1}    1.35{col 46}{space 3}0.178{col 54}{space 4}-.6296963{col 67}{space 3} 3.382803
{txt}{space 2}state_3_yr {c |}{col 14}{res}{space 2} 1.329812{col 26}{space 2}  .999856{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.6328239{col 67}{space 3} 3.292449
{txt}{space 2}state_4_yr {c |}{col 14}{res}{space 2} 1.295815{col 26}{space 2} .9763268{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.6206356{col 67}{space 3} 3.212265
{txt}{space 2}state_5_yr {c |}{col 14}{res}{space 2} 1.272635{col 26}{space 2} .9554186{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.6027741{col 67}{space 3} 3.148044
{txt}{space 2}state_6_yr {c |}{col 14}{res}{space 2}   1.2362{col 26}{space 2} .9316624{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.5925775{col 67}{space 3} 3.064978
{txt}{space 2}state_7_yr {c |}{col 14}{res}{space 2} 1.213882{col 26}{space 2}  .910872{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.5740863{col 67}{space 3}  3.00185
{txt}{space 2}state_8_yr {c |}{col 14}{res}{space 2}  1.17916{col 26}{space 2} .8887626{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.5654092{col 67}{space 3} 2.923729
{txt}{space 2}state_9_yr {c |}{col 14}{res}{space 2} 1.159746{col 26}{space 2} .8657931{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.5397355{col 67}{space 3} 2.859228
{txt}{space 1}state_10_yr {c |}{col 14}{res}{space 2} 1.102374{col 26}{space 2} .8432308{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}  -.55282{col 67}{space 3} 2.757567
{txt}{space 1}state_11_yr {c |}{col 14}{res}{space 2} 1.093974{col 26}{space 2} .8221067{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.5197548{col 67}{space 3} 2.707703
{txt}{space 1}state_12_yr {c |}{col 14}{res}{space 2} 1.065431{col 26}{space 2}  .799888{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.5046847{col 67}{space 3} 2.635546
{txt}{space 1}state_13_yr {c |}{col 14}{res}{space 2} 1.042095{col 26}{space 2} .7772321{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4}-.4835481{col 67}{space 3} 2.567739
{txt}{space 1}state_14_yr {c |}{col 14}{res}{space 2} 1.012878{col 26}{space 2} .7554509{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4}-.4700105{col 67}{space 3} 2.495767
{txt}{space 1}state_15_yr {c |}{col 14}{res}{space 2} .9896548{col 26}{space 2} .7332323{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-.4496208{col 67}{space 3}  2.42893
{txt}{space 1}state_16_yr {c |}{col 14}{res}{space 2} .9510538{col 26}{space 2} .7105776{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.4437525{col 67}{space 3}  2.34586
{txt}{space 1}state_17_yr {c |}{col 14}{res}{space 2} .8960925{col 26}{space 2} .6887955{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-.4559573{col 67}{space 3} 2.248142
{txt}{space 1}state_18_yr {c |}{col 14}{res}{space 2} .8825124{col 26}{space 2} .6663078{col 37}{space 1}    1.32{col 46}{space 3}0.186{col 54}{space 4}-.4253958{col 67}{space 3} 2.190421
{txt}{space 1}state_19_yr {c |}{col 14}{res}{space 2} .8579048{col 26}{space 2} .6443582{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.4069181{col 67}{space 3} 2.122728
{txt}{space 1}state_20_yr {c |}{col 14}{res}{space 2} .8336676{col 26}{space 2} .6219989{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.3872658{col 67}{space 3} 2.054601
{txt}{space 1}state_21_yr {c |}{col 14}{res}{space 2} .8026111{col 26}{space 2} .5999213{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.3749857{col 67}{space 3} 1.980208
{txt}{space 1}state_22_yr {c |}{col 14}{res}{space 2} .7835835{col 26}{space 2} .5777029{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-.3504005{col 67}{space 3} 1.917567
{txt}{space 1}state_23_yr {c |}{col 14}{res}{space 2} .7572751{col 26}{space 2} .5554845{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-.3330959{col 67}{space 3} 1.847646
{txt}{space 1}state_24_yr {c |}{col 14}{res}{space 2} .7112749{col 26}{space 2} .5332662{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.3354834{col 67}{space 3} 1.758033
{txt}{space 1}state_25_yr {c |}{col 14}{res}{space 2} .7155205{col 26}{space 2} .5114299{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-.2883749{col 67}{space 3} 1.719416
{txt}{space 1}state_26_yr {c |}{col 14}{res}{space 2} .6528354{col 26}{space 2} .4888297{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 54}{space 4}-.3066977{col 67}{space 3} 1.612368
{txt}{space 1}state_27_yr {c |}{col 14}{res}{space 2} .6267665{col 26}{space 2} .4666115{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4}-.2891541{col 67}{space 3} 1.542687
{txt}{space 1}state_28_yr {c |}{col 14}{res}{space 2} .5681568{col 26}{space 2} .4443934{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.3041515{col 67}{space 3} 1.440465
{txt}{space 1}state_29_yr {c |}{col 14}{res}{space 2} .5445865{col 26}{space 2} .4222376{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.2842316{col 67}{space 3} 1.373405
{txt}{space 1}state_30_yr {c |}{col 14}{res}{space 2} .5282539{col 26}{space 2} .4013526{col 37}{space 1}    1.32{col 46}{space 3}0.188{col 54}{space 4}-.2595687{col 67}{space 3} 1.316077
{txt}{space 1}state_31_yr {c |}{col 14}{res}{space 2} .4802262{col 26}{space 2} .3777397{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.2612462{col 67}{space 3} 1.221699
{txt}{space 1}state_32_yr {c |}{col 14}{res}{space 2} .4539389{col 26}{space 2} .3614488{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-.2555557{col 67}{space 3} 1.163434
{txt}{space 1}state_33_yr {c |}{col 14}{res}{space 2} .4360663{col 26}{space 2} .3333045{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}-.2181835{col 67}{space 3} 1.090316
{txt}{space 1}state_34_yr {c |}{col 14}{res}{space 2} .4090241{col 26}{space 2} .3113637{col 37}{space 1}    1.31{col 46}{space 3}0.189{col 54}{space 4}-.2021576{col 67}{space 3} 1.020206
{txt}{space 1}state_35_yr {c |}{col 14}{res}{space 2} .3943797{col 26}{space 2} .2896996{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.1742772{col 67}{space 3} .9630365
{txt}{space 1}state_36_yr {c |}{col 14}{res}{space 2} .3486651{col 26}{space 2} .2666533{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}-.1747538{col 67}{space 3}  .872084
{txt}{space 1}state_37_yr {c |}{col 14}{res}{space 2}  .312736{col 26}{space 2} .2444369{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.1670739{col 67}{space 3} .7925458
{txt}{space 1}state_38_yr {c |}{col 14}{res}{space 2}  .296907{col 26}{space 2}  .222221{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 54}{space 4}-.1392948{col 67}{space 3} .7331088
{txt}{space 1}state_39_yr {c |}{col 14}{res}{space 2}  .275985{col 26}{space 2} .2000057{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}  -.11661{col 67}{space 3}   .66858
{txt}{space 1}state_40_yr {c |}{col 14}{res}{space 2}  .237657{col 26}{space 2} .1777913{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 54}{space 4} -.111333{col 67}{space 3}  .586647
{txt}{space 1}state_41_yr {c |}{col 14}{res}{space 2} .1612748{col 26}{space 2} .1594742{col 37}{space 1}    1.01{col 46}{space 3}0.312{col 54}{space 4}-.1517602{col 67}{space 3} .4743097
{txt}{space 1}state_42_yr {c |}{col 14}{res}{space 2} .1671701{col 26}{space 2} .1333671{col 37}{space 1}    1.25{col 46}{space 3}0.210{col 54}{space 4}-.0946187{col 67}{space 3} .4289589
{txt}{space 1}state_43_yr {c |}{col 14}{res}{space 2} .1350956{col 26}{space 2}  .111159{col 37}{space 1}    1.22{col 46}{space 3}0.225{col 54}{space 4}-.0831005{col 67}{space 3} .3532917
{txt}{space 1}state_44_yr {c |}{col 14}{res}{space 2} .0979903{col 26}{space 2} .0889563{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-.0766236{col 67}{space 3} .2726043
{txt}{space 1}state_45_yr {c |}{col 14}{res}{space 2}  .065976{col 26}{space 2} .0669885{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4} -.065517{col 67}{space 3} .1974691
{txt}{space 1}state_46_yr {c |}{col 14}{res}{space 2} .0543808{col 26}{space 2} .0445991{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.0331636{col 67}{space 3} .1419253
{txt}{space 1}state_47_yr {c |}{col 14}{res}{space 2} .0293335{col 26}{space 2} .0225399{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}-.0149105{col 67}{space 3} .0735774
{txt}{space 1}state_48_yr {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} -2836.09{col 26}{space 2} 2089.516{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4} -6937.64{col 67}{space 3}  1265.46
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. // 2) Get \hat{c -(}tau{c )-}
. // 2a) Compute \hat{c -(}y(0){c )-} = in omega_1 population
. predict yhat, xb
{txt}
{com}. // 2b) Compute \hat{c -(}tau{c )-} = y-\hat{c -(}y(0){c )-}
. gen tau_hat_it = ln_fat_pc - yhat if primary == 1 // 
{txt}(922 missing values generated)

{com}. 
. // 3) Estimate tau_w by a weighted sum over omega_q
. // For weights, w_it, I follow Liu et al. (2022) AJPS who use a regular average
. gen h = year - cohort if cohort != 999
{txt}(690 missing values generated)

{com}. byso h (cohort) : egen ATT_h_Liu = mean(tau_hat_it) // get horizon specific ATT
{txt}(922 missing values generated)

{com}. 
. // to confirm: Are my tau_hats right? What about my weights/averaging method?
. 
. label var h "Horizon"
{txt}
{com}. label var ATT_h_Liu "ATT_h Liu et al (Imputation ATTs by horizon weighted regularly)"
{txt}
{com}. 
. egen ATT_Liu = mean(tau_hat_it) // tau_w (tau given weights)
{txt}
{com}. label var ATT_Liu "ATT Liu et al (Imputation ATT weighted regularly)"
{txt}
{com}. 
. 
. preserve
{txt}
{com}.         keep h ATT_h_Liu ATT_Liu
{txt}
{com}.         keep if ATT_h_Liu != .
{txt}(922 observations deleted)

{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(162 observations deleted)

{com}.         
.         qui sum ATT_Liu
{txt}
{com}.         global att_est_3d = round(`r(mean)', 0.001)
{txt}
{com}.         
.         // save
.         compress
  {txt}variable {bf}h{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (60 bytes saved)

{com}.         save "$dta_loc\q3d_ATTs", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data\q3d_ATTs.dta saved

{com}. restore
{txt}
{com}. 
. 
. // 4) Estimate standard error (conservative estimate)
. // Following Theorem 3 in BJS (2023), the plug-in estimator (eqn (7))
. // Approach 1: Pool multiple cohorts for simplicity 
. gen cohort_coarse = 999 if cohort == 999 // decade cohort
{txt}(414 missing values generated)

{com}. replace cohort_coarse = 1980 if inrange(cohort, 1980, 1989)
{txt}(138 real changes made)

{com}. replace cohort_coarse = 1990 if inrange(cohort, 1990, 1999)
{txt}(161 real changes made)

{com}. replace cohort_coarse = 2000 if inrange(cohort, 2000, 2009)
{txt}(115 real changes made)

{com}. 
. // get eps_it = tau_hat_{c -(}it{c )-} - tau_hat_{c -(}Et{c )-}
. byso cohort_coarse (h) : egen tau_hat_coarset = mean(tau_hat_it) 
{txt}(690 missing values generated)

{com}. replace tau_hat_coarset = . if primary != 1
{txt}(232 real changes made, 232 to missing)

{com}. gen eps_it = tau_hat_it - tau_hat_coarset
{txt}(922 missing values generated)

{com}. sum eps_it

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}eps_it {c |}{res}        182   -1.40e-09    .2523583  -.7702122   .5465338
{txt}
{com}. 
. // let v_it = w_it = size of omega_1
. count if primary == 1
  {res}182
{txt}
{com}. gen v_it = 1/`r(N)'
{txt}
{com}. gen v_e_it = v_it * eps_it
{txt}(922 missing values generated)

{com}. 
. // var(tau_it) = sum_i (sum_t v_it eps_it)^2
. byso state : egen sumt_v_e = total(v_e_it) // sum over time within state, i
{txt}
{com}. gen sumt_v_e_sq = sumt_v_e^2
{txt}
{com}. keep state sumt_v_e_sq
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(1,056 observations deleted)

{com}. egen sumi_sumt_v_e_sq = total(sumt_v_e_sq)
{txt}
{com}. gen se = sqrt(sumi_sumt_v_e_sq)
{txt}
{com}. 
. qui sum se
{txt}
{com}. global se_est_3d = round(`r(mean)', 0.001)
{txt}
{com}. 
. 
. // results very sensitive to including state-specific linear trends
. 
. dis "ATT = $att_est_3d"
{res}ATT = -.048
{txt}
{com}. dis "SE = $se_est_3d"
{res}SE = .066
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3e.do"
{txt}
{com}. /*
> Title:          02_analysis_q3e.do
> Outline:        Question 3, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Now proceed with the DiD estimation. 
> 
> (e) The dataset includes several covariates measuring, e.g., weather, percent of college
> graduates, and vehicle miles traveled. Illustrate some ways how covariates can be
> correctly incorporated in your analysis. Describe the procedures you follow and
> argue why they are potentially useful.
> 
> */
. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. 
. // 1) Get predictions for alpha_i and beta_t by OLS in omega_0 
. // using state specific time trends atop state and time trends
. reg ln_fat_pc i.state i.year if primary == 0 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       922
{txt}{hline 13}{c +}{hline 34}   F(69, 852)      = {res}   114.44
{txt}       Model {c |} {res} 90.1782575        69  1.30693127   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9.72961864       852   .01141974   {txt}R-squared       ={res}    0.9026
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8947
{txt}       Total {c |} {res} 99.9078762       921  .108477607   {txt}Root MSE        =   {res} .10686

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ln_fat_pc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2}-.0162001{col 26}{space 2} .0331796{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-.0813235{col 67}{space 3} .0489233
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} -.068485{col 26}{space 2} .0331796{col 37}{space 1}   -2.06{col 46}{space 3}0.039{col 54}{space 4}-.1336084{col 67}{space 3}-.0033616
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.3846694{col 26}{space 2} .0395199{col 37}{space 1}   -9.73{col 46}{space 3}0.000{col 54}{space 4}-.4622371{col 67}{space 3}-.3071017
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.3826142{col 26}{space 2} .0331796{col 37}{space 1}  -11.53{col 46}{space 3}0.000{col 54}{space 4}-.4477376{col 67}{space 3}-.3174908
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.6053001{col 26}{space 2} .0540901{col 37}{space 1}  -11.19{col 46}{space 3}0.000{col 54}{space 4}-.7114656{col 67}{space 3}-.4991345
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.3341957{col 26}{space 2} .0335068{col 37}{space 1}   -9.97{col 46}{space 3}0.000{col 54}{space 4}-.3999612{col 67}{space 3}-.2684302
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.1625973{col 26}{space 2} .0331796{col 37}{space 1}   -4.90{col 46}{space 3}0.000{col 54}{space 4}-.2277207{col 67}{space 3}-.0974739
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.1255506{col 26}{space 2} .0369693{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.1981123{col 67}{space 3}-.0529889
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.4685753{col 26}{space 2} .0540901{col 37}{space 1}   -8.66{col 46}{space 3}0.000{col 54}{space 4}-.5747408{col 67}{space 3}-.3624097
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.0594742{col 26}{space 2} .0331796{col 37}{space 1}   -1.79{col 46}{space 3}0.073{col 54}{space 4}-.1245976{col 67}{space 3} .0056492
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6493499{col 26}{space 2} .0331796{col 37}{space 1}  -19.57{col 46}{space 3}0.000{col 54}{space 4}-.7144733{col 67}{space 3}-.5842265
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.3668006{col 26}{space 2} .0357045{col 37}{space 1}  -10.27{col 46}{space 3}0.000{col 54}{space 4}-.4368796{col 67}{space 3}-.2967216
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.2902963{col 26}{space 2} .0331796{col 37}{space 1}   -8.75{col 46}{space 3}0.000{col 54}{space 4}-.3554197{col 67}{space 3}-.2251729
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.1388279{col 26}{space 2} .0331796{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-.2039513{col 67}{space 3}-.0737045
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.1926516{col 26}{space 2} .0369693{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.2652133{col 67}{space 3}  -.12009
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.016931{col 26}{space 2} .0331796{col 37}{space 1}  -30.65{col 46}{space 3}0.000{col 54}{space 4}-1.082055{col 67}{space 3}-.9518079
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5501205{col 26}{space 2} .0357045{col 37}{space 1}  -15.41{col 46}{space 3}0.000{col 54}{space 4}-.6201996{col 67}{space 3}-.4800415
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.4103948{col 26}{space 2} .0331796{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-.4755182{col 67}{space 3}-.3452714
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.4697366{col 26}{space 2}  .034671{col 37}{space 1}  -13.55{col 46}{space 3}0.000{col 54}{space 4}-.5377872{col 67}{space 3}-.4016861
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.6256298{col 26}{space 2} .0331796{col 37}{space 1}  -18.86{col 46}{space 3}0.000{col 54}{space 4}-.6907532{col 67}{space 3}-.5605064
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.2010471{col 26}{space 2} .0331796{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4}-.2661705{col 67}{space 3}-.1359238
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} .1729473{col 26}{space 2} .0331796{col 37}{space 1}    5.21{col 46}{space 3}0.000{col 54}{space 4}  .107824{col 67}{space 3} .2380707
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .0858541{col 26}{space 2} .0331796{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0207307{col 67}{space 3} .1509775
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.1706971{col 26}{space 2}  .050361{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-.2695434{col 67}{space 3}-.0718509
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.4756038{col 26}{space 2} .0331796{col 37}{space 1}  -14.33{col 46}{space 3}0.000{col 54}{space 4}-.5407272{col 67}{space 3}-.4104804
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.3672645{col 26}{space 2} .0331796{col 37}{space 1}  -11.07{col 46}{space 3}0.000{col 54}{space 4}-.4323879{col 67}{space 3}-.3021411
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.6292035{col 26}{space 2} .0331796{col 37}{space 1}  -18.96{col 46}{space 3}0.000{col 54}{space 4}-.6943268{col 67}{space 3}-.5640801
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.8072599{col 26}{space 2}  .034671{col 37}{space 1}  -23.28{col 46}{space 3}0.000{col 54}{space 4}-.8753105{col 67}{space 3}-.7392093
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} .3435514{col 26}{space 2} .0540901{col 37}{space 1}    6.35{col 46}{space 3}0.000{col 54}{space 4} .2373859{col 67}{space 3}  .449717
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.1127945{col 26}{space 2} .0331796{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.1779179{col 67}{space 3}-.0476711
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8041455{col 26}{space 2} .0669386{col 37}{space 1}  -12.01{col 46}{space 3}0.000{col 54}{space 4}-.9355293{col 67}{space 3}-.6727617
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.5828151{col 26}{space 2} .0331796{col 37}{space 1}  -17.57{col 46}{space 3}0.000{col 54}{space 4}-.6479385{col 67}{space 3}-.5176917
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1240088{col 26}{space 2} .0357045{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-.1940878{col 67}{space 3}-.0539298
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.2197645{col 26}{space 2} .0419141{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.3020315{col 67}{space 3}-.1374975
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.5876597{col 26}{space 2} .0331796{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-.6527831{col 67}{space 3}-.5225363
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.037679{col 26}{space 2} .0331796{col 37}{space 1}  -31.27{col 46}{space 3}0.000{col 54}{space 4}-1.102802{col 67}{space 3}-.9725552
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}    .0494{col 26}{space 2} .0331796{col 37}{space 1}    1.49{col 46}{space 3}0.137{col 54}{space 4}-.0157234{col 67}{space 3} .1145234
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.1332017{col 26}{space 2} .0331796{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4} -.198325{col 67}{space 3}-.0680783
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0729816{col 26}{space 2} .0331796{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4} -.138105{col 67}{space 3}-.0078582
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.0642178{col 26}{space 2} .0540901{col 37}{space 1}   -1.19{col 46}{space 3}0.235{col 54}{space 4}-.1703834{col 67}{space 3} .0419477
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.3947249{col 26}{space 2} .0331796{col 37}{space 1}  -11.90{col 46}{space 3}0.000{col 54}{space 4}-.4598483{col 67}{space 3}-.3296016
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.5028121{col 26}{space 2} .0331796{col 37}{space 1}  -15.15{col 46}{space 3}0.000{col 54}{space 4}-.5679354{col 67}{space 3}-.4376887
{txt}{space 9}VT  {c |}{col 14}{res}{space 2}-.3550252{col 26}{space 2} .0331796{col 37}{space 1}  -10.70{col 46}{space 3}0.000{col 54}{space 4}-.4201486{col 67}{space 3}-.2899018
{txt}{space 9}WA  {c |}{col 14}{res}{space 2} -.570901{col 26}{space 2} .0338619{col 37}{space 1}  -16.86{col 46}{space 3}0.000{col 54}{space 4}-.6373635{col 67}{space 3}-.5044386
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.4850967{col 26}{space 2} .0331796{col 37}{space 1}  -14.62{col 46}{space 3}0.000{col 54}{space 4}-.5502201{col 67}{space 3}-.4199733
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.0951201{col 26}{space 2} .0331796{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-.1602435{col 67}{space 3}-.0299968
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .2530209{col 26}{space 2} .0331796{col 37}{space 1}    7.63{col 46}{space 3}0.000{col 54}{space 4} .1878975{col 67}{space 3} .3181443
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-.1216089{col 26}{space 2} .0218134{col 37}{space 1}   -5.57{col 46}{space 3}0.000{col 54}{space 4}-.1644231{col 67}{space 3}-.0787947
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-.1579019{col 26}{space 2} .0218134{col 37}{space 1}   -7.24{col 46}{space 3}0.000{col 54}{space 4}-.2007161{col 67}{space 3}-.1150877
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-.1498036{col 26}{space 2} .0219675{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.1929204{col 67}{space 3}-.1066868
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.1661469{col 26}{space 2} .0219675{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.2092637{col 67}{space 3}-.1230301
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-.1089457{col 26}{space 2} .0225764{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-.1532576{col 67}{space 3}-.0646338
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-.1168819{col 26}{space 2} .0227392{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4}-.1615134{col 67}{space 3}-.0722505
{txt}{space 7}1988  {c |}{col 14}{res}{space 2}-.1059111{col 26}{space 2} .0227392{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-.1505425{col 67}{space 3}-.0612797
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}-.1675115{col 26}{space 2} .0227392{col 37}{space 1}   -7.37{col 46}{space 3}0.000{col 54}{space 4}-.2121429{col 67}{space 3}-.1228801
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}-.1831926{col 26}{space 2} .0227392{col 37}{space 1}   -8.06{col 46}{space 3}0.000{col 54}{space 4} -.227824{col 67}{space 3}-.1385612
{txt}{space 7}1991  {c |}{col 14}{res}{space 2}-.2536254{col 26}{space 2}  .022899{col 37}{space 1}  -11.08{col 46}{space 3}0.000{col 54}{space 4}-.2985705{col 67}{space 3}-.2086802
{txt}{space 7}1992  {c |}{col 14}{res}{space 2}-.3092342{col 26}{space 2}  .022899{col 37}{space 1}  -13.50{col 46}{space 3}0.000{col 54}{space 4}-.3541794{col 67}{space 3}-.2642891
{txt}{space 7}1993  {c |}{col 14}{res}{space 2}-.3109858{col 26}{space 2} .0230632{col 37}{space 1}  -13.48{col 46}{space 3}0.000{col 54}{space 4}-.3562531{col 67}{space 3}-.2657185
{txt}{space 7}1994  {c |}{col 14}{res}{space 2}-.3134476{col 26}{space 2} .0230632{col 37}{space 1}  -13.59{col 46}{space 3}0.000{col 54}{space 4}-.3587149{col 67}{space 3}-.2681803
{txt}{space 7}1995  {c |}{col 14}{res}{space 2} -.291764{col 26}{space 2} .0230632{col 37}{space 1}  -12.65{col 46}{space 3}0.000{col 54}{space 4}-.3370313{col 67}{space 3}-.2464967
{txt}{space 7}1996  {c |}{col 14}{res}{space 2}-.3059367{col 26}{space 2} .0234081{col 37}{space 1}  -13.07{col 46}{space 3}0.000{col 54}{space 4}-.3518809{col 67}{space 3}-.2599924
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}-.2862229{col 26}{space 2} .0234081{col 37}{space 1}  -12.23{col 46}{space 3}0.000{col 54}{space 4}-.3321671{col 67}{space 3}-.2402787
{txt}{space 7}1998  {c |}{col 14}{res}{space 2}-.3062277{col 26}{space 2} .0239836{col 37}{space 1}  -12.77{col 46}{space 3}0.000{col 54}{space 4}-.3533015{col 67}{space 3}-.2591539
{txt}{space 7}1999  {c |}{col 14}{res}{space 2}-.3025445{col 26}{space 2} .0239836{col 37}{space 1}  -12.61{col 46}{space 3}0.000{col 54}{space 4}-.3496183{col 67}{space 3}-.2554707
{txt}{space 7}2000  {c |}{col 14}{res}{space 2}-.3236965{col 26}{space 2} .0246457{col 37}{space 1}  -13.13{col 46}{space 3}0.000{col 54}{space 4}-.3720699{col 67}{space 3}-.2753232
{txt}{space 7}2001  {c |}{col 14}{res}{space 2}-.3268277{col 26}{space 2} .0246457{col 37}{space 1}  -13.26{col 46}{space 3}0.000{col 54}{space 4}-.3752011{col 67}{space 3}-.2784543
{txt}{space 7}2002  {c |}{col 14}{res}{space 2}-.2920869{col 26}{space 2} .0248892{col 37}{space 1}  -11.74{col 46}{space 3}0.000{col 54}{space 4}-.3409381{col 67}{space 3}-.2432356
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-.3085507{col 26}{space 2} .0251457{col 37}{space 1}  -12.27{col 46}{space 3}0.000{col 54}{space 4}-.3579055{col 67}{space 3}-.2591959
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.169429{col 26}{space 2} .0288583{col 37}{space 1}  -40.52{col 46}{space 3}0.000{col 54}{space 4} -1.22607{col 67}{space 3}-1.112787
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. local covars college beer totalvmt precip snow32 rural_speed urban_speed
{txt}
{com}. reg ln_fat_pc i.state i.year `covars' if primary == 0 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       922
{txt}{hline 13}{c +}{hline 34}   F(76, 845)      = {res}   157.02
{txt}       Model {c |} {res} 93.3013544        76   1.2276494   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.60652177       845  .007818369   {txt}R-squared       ={res}    0.9339
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9279
{txt}       Total {c |} {res} 99.9078762       921  .108477607   {txt}Root MSE        =   {res} .08842

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ln_fat_pc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2}-.0199329{col 26}{space 2} .0299805{col 37}{space 1}   -0.66{col 46}{space 3}0.506{col 54}{space 4}-.0787779{col 67}{space 3}  .038912
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.5007942{col 26}{space 2} .0481959{col 37}{space 1}  -10.39{col 46}{space 3}0.000{col 54}{space 4}-.5953919{col 67}{space 3}-.4061966
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.6525377{col 26}{space 2} .0908617{col 37}{space 1}   -7.18{col 46}{space 3}0.000{col 54}{space 4}-.8308788{col 67}{space 3}-.4741966
{txt}{space 9}CO  {c |}{col 14}{res}{space 2}-.6249117{col 26}{space 2} .0582889{col 37}{space 1}  -10.72{col 46}{space 3}0.000{col 54}{space 4}-.7393198{col 67}{space 3}-.5105036
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.4782419{col 26}{space 2} .0582229{col 37}{space 1}   -8.21{col 46}{space 3}0.000{col 54}{space 4}-.5925205{col 67}{space 3}-.3639634
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.5554954{col 26}{space 2} .0416343{col 37}{space 1}  -13.34{col 46}{space 3}0.000{col 54}{space 4}-.6372142{col 67}{space 3}-.4737767
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.4622164{col 26}{space 2} .0463587{col 37}{space 1}   -9.97{col 46}{space 3}0.000{col 54}{space 4}-.5532081{col 67}{space 3}-.3712247
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.1816814{col 26}{space 2} .0348983{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.2501789{col 67}{space 3}-.1131838
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.6650447{col 26}{space 2} .0508186{col 37}{space 1}  -13.09{col 46}{space 3}0.000{col 54}{space 4}-.7647902{col 67}{space 3}-.5652993
{txt}{space 9}ID  {c |}{col 14}{res}{space 2}-.2412231{col 26}{space 2} .0440756{col 37}{space 1}   -5.47{col 46}{space 3}0.000{col 54}{space 4}-.3277336{col 67}{space 3}-.1547125
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.8633133{col 26}{space 2} .0417301{col 37}{space 1}  -20.69{col 46}{space 3}0.000{col 54}{space 4}-.9452202{col 67}{space 3}-.7814065
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.4900015{col 26}{space 2} .0337476{col 37}{space 1}  -14.52{col 46}{space 3}0.000{col 54}{space 4}-.5562405{col 67}{space 3}-.4237626
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.3233567{col 26}{space 2} .0417402{col 37}{space 1}   -7.75{col 46}{space 3}0.000{col 54}{space 4}-.4052834{col 67}{space 3}  -.24143
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.1366266{col 26}{space 2} .0288345{col 37}{space 1}   -4.74{col 46}{space 3}0.000{col 54}{space 4}-.1932223{col 67}{space 3} -.080031
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.4516888{col 26}{space 2} .0349797{col 37}{space 1}  -12.91{col 46}{space 3}0.000{col 54}{space 4} -.520346{col 67}{space 3}-.3830316
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.039418{col 26}{space 2} .0476094{col 37}{space 1}  -21.83{col 46}{space 3}0.000{col 54}{space 4}-1.132865{col 67}{space 3}-.9459715
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5720453{col 26}{space 2} .0446859{col 37}{space 1}  -12.80{col 46}{space 3}0.000{col 54}{space 4}-.6597536{col 67}{space 3} -.484337
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.4902376{col 26}{space 2} .0425828{col 37}{space 1}  -11.51{col 46}{space 3}0.000{col 54}{space 4} -.573818{col 67}{space 3}-.4066571
{txt}{space 9}MI  {c |}{col 14}{res}{space 2}-.6613616{col 26}{space 2} .0407724{col 37}{space 1}  -16.22{col 46}{space 3}0.000{col 54}{space 4}-.7413887{col 67}{space 3}-.5813345
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}   -.7769{col 26}{space 2} .0433123{col 37}{space 1}  -17.94{col 46}{space 3}0.000{col 54}{space 4}-.8619123{col 67}{space 3}-.6918878
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.4197178{col 26}{space 2} .0341389{col 37}{space 1}  -12.29{col 46}{space 3}0.000{col 54}{space 4}-.4867247{col 67}{space 3}-.3527108
{txt}{space 9}MS  {c |}{col 14}{res}{space 2}-.0013335{col 26}{space 2} .0301878{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-.0605853{col 67}{space 3} .0579183
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -.353106{col 26}{space 2} .0517146{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.4546101{col 67}{space 3}-.2516019
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.1357279{col 26}{space 2}  .043411{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4} -.220934{col 67}{space 3}-.0505219
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.7736574{col 26}{space 2} .0467594{col 37}{space 1}  -16.55{col 46}{space 3}0.000{col 54}{space 4}-.8654356{col 67}{space 3}-.6818792
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -.652309{col 26}{space 2} .0431309{col 37}{space 1}  -15.12{col 46}{space 3}0.000{col 54}{space 4}-.7369653{col 67}{space 3}-.5676526
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-1.176181{col 26}{space 2} .0564958{col 37}{space 1}  -20.82{col 46}{space 3}0.000{col 54}{space 4} -1.28707{col 67}{space 3}-1.065293
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.7684185{col 26}{space 2} .0402904{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-.8474995{col 67}{space 3}-.6893374
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} -.129449{col 26}{space 2} .0634028{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-.2538943{col 67}{space 3}-.0050036
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} -.874419{col 26}{space 2} .0579544{col 37}{space 1}  -15.09{col 46}{space 3}0.000{col 54}{space 4}-.9881704{col 67}{space 3}-.7606676
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8790078{col 26}{space 2} .0647691{col 37}{space 1}  -13.57{col 46}{space 3}0.000{col 54}{space 4}-1.006135{col 67}{space 3}-.7518805
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.8175857{col 26}{space 2} .0398547{col 37}{space 1}  -20.51{col 46}{space 3}0.000{col 54}{space 4}-.8958115{col 67}{space 3}-.7393599
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1220902{col 26}{space 2} .0351364{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-.1910552{col 67}{space 3}-.0531253
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.3362549{col 26}{space 2}  .047792{col 37}{space 1}   -7.04{col 46}{space 3}0.000{col 54}{space 4}-.4300598{col 67}{space 3}  -.24245
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}  -.79972{col 26}{space 2} .0399786{col 37}{space 1}  -20.00{col 46}{space 3}0.000{col 54}{space 4} -.878189{col 67}{space 3} -.721251
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.126606{col 26}{space 2}  .041233{col 37}{space 1}  -27.32{col 46}{space 3}0.000{col 54}{space 4}-1.207537{col 67}{space 3}-1.045675
{txt}{space 9}SC  {c |}{col 14}{res}{space 2}-.1760835{col 26}{space 2} .0311512{col 37}{space 1}   -5.65{col 46}{space 3}0.000{col 54}{space 4}-.2372263{col 67}{space 3}-.1149408
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.3763007{col 26}{space 2} .0439637{col 37}{space 1}   -8.56{col 46}{space 3}0.000{col 54}{space 4}-.4625916{col 67}{space 3}-.2900099
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}  -.14897{col 26}{space 2} .0281539{col 37}{space 1}   -5.29{col 46}{space 3}0.000{col 54}{space 4}-.2042298{col 67}{space 3}-.0937102
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.6334394{col 26}{space 2} .0715686{col 37}{space 1}   -8.85{col 46}{space 3}0.000{col 54}{space 4}-.7739125{col 67}{space 3}-.4929662
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.1863005{col 26}{space 2} .0529225{col 37}{space 1}   -3.52{col 46}{space 3}0.000{col 54}{space 4}-.2901754{col 67}{space 3}-.0824256
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.6118001{col 26}{space 2} .0398648{col 37}{space 1}  -15.35{col 46}{space 3}0.000{col 54}{space 4}-.6900458{col 67}{space 3}-.5335543
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -.528828{col 26}{space 2} .0507553{col 37}{space 1}  -10.42{col 46}{space 3}0.000{col 54}{space 4}-.6284492{col 67}{space 3}-.4292067
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.6308299{col 26}{space 2} .0423048{col 37}{space 1}  -14.91{col 46}{space 3}0.000{col 54}{space 4}-.7138647{col 67}{space 3} -.547795
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.9794268{col 26}{space 2} .0446473{col 37}{space 1}  -21.94{col 46}{space 3}0.000{col 54}{space 4} -1.06706{col 67}{space 3}-.8917941
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.1769761{col 26}{space 2} .0335382{col 37}{space 1}   -5.28{col 46}{space 3}0.000{col 54}{space 4} -.242804{col 67}{space 3}-.1111482
{txt}{space 9}WY  {c |}{col 14}{res}{space 2}-.1066887{col 26}{space 2} .0496996{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-.2042379{col 67}{space 3}-.0091395
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-.0981667{col 26}{space 2}  .018435{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-.1343505{col 67}{space 3}-.0619828
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-.1217196{col 26}{space 2} .0188632{col 37}{space 1}   -6.45{col 46}{space 3}0.000{col 54}{space 4}-.1587438{col 67}{space 3}-.0846955
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-.0970205{col 26}{space 2} .0187548{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4} -.133832{col 67}{space 3}-.0602089
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.1047062{col 26}{space 2} .0189762{col 37}{space 1}   -5.52{col 46}{space 3}0.000{col 54}{space 4}-.1419523{col 67}{space 3}-.0674601
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-.0553878{col 26}{space 2} .0195285{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.0937178{col 67}{space 3}-.0170578
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-.0540411{col 26}{space 2} .0201192{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.0935304{col 67}{space 3}-.0145517
{txt}{space 7}1988  {c |}{col 14}{res}{space 2}-.0675041{col 26}{space 2} .0241136{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.1148338{col 67}{space 3}-.0201744
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}-.1124198{col 26}{space 2} .0242513{col 37}{space 1}   -4.64{col 46}{space 3}0.000{col 54}{space 4}-.1600196{col 67}{space 3}  -.06482
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}-.1566814{col 26}{space 2} .0239085{col 37}{space 1}   -6.55{col 46}{space 3}0.000{col 54}{space 4}-.2036085{col 67}{space 3}-.1097543
{txt}{space 7}1991  {c |}{col 14}{res}{space 2}-.1982461{col 26}{space 2} .0243983{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-.2461346{col 67}{space 3}-.1503577
{txt}{space 7}1992  {c |}{col 14}{res}{space 2}-.2410331{col 26}{space 2} .0249979{col 37}{space 1}   -9.64{col 46}{space 3}0.000{col 54}{space 4}-.2900984{col 67}{space 3}-.1919678
{txt}{space 7}1993  {c |}{col 14}{res}{space 2}-.2336443{col 26}{space 2} .0255189{col 37}{space 1}   -9.16{col 46}{space 3}0.000{col 54}{space 4}-.2837322{col 67}{space 3}-.1835565
{txt}{space 7}1994  {c |}{col 14}{res}{space 2}-.2256729{col 26}{space 2} .0260818{col 37}{space 1}   -8.65{col 46}{space 3}0.000{col 54}{space 4}-.2768657{col 67}{space 3}-.1744802
{txt}{space 7}1995  {c |}{col 14}{res}{space 2}-.1832571{col 26}{space 2}  .026909{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.2360735{col 67}{space 3}-.1304407
{txt}{space 7}1996  {c |}{col 14}{res}{space 2}-.1956467{col 26}{space 2} .0318459{col 37}{space 1}   -6.14{col 46}{space 3}0.000{col 54}{space 4}-.2581532{col 67}{space 3}-.1331403
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}-.1746603{col 26}{space 2} .0332748{col 37}{space 1}   -5.25{col 46}{space 3}0.000{col 54}{space 4}-.2399713{col 67}{space 3}-.1093493
{txt}{space 7}1998  {c |}{col 14}{res}{space 2}-.1965091{col 26}{space 2} .0351915{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.2655821{col 67}{space 3}-.1274362
{txt}{space 7}1999  {c |}{col 14}{res}{space 2}-.2088717{col 26}{space 2}   .03553{col 37}{space 1}   -5.88{col 46}{space 3}0.000{col 54}{space 4} -.278609{col 67}{space 3}-.1391343
{txt}{space 7}2000  {c |}{col 14}{res}{space 2}-.2263181{col 26}{space 2} .0362895{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.2975461{col 67}{space 3}  -.15509
{txt}{space 7}2001  {c |}{col 14}{res}{space 2}-.2334015{col 26}{space 2} .0368589{col 37}{space 1}   -6.33{col 46}{space 3}0.000{col 54}{space 4}-.3057472{col 67}{space 3}-.1610558
{txt}{space 7}2002  {c |}{col 14}{res}{space 2}-.2131501{col 26}{space 2} .0377233{col 37}{space 1}   -5.65{col 46}{space 3}0.000{col 54}{space 4}-.2871923{col 67}{space 3}-.1391078
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-.2091892{col 26}{space 2} .0390953{col 37}{space 1}   -5.35{col 46}{space 3}0.000{col 54}{space 4}-.2859244{col 67}{space 3}-.1324539
{txt}{space 12} {c |}
{space 5}college {c |}{col 14}{res}{space 2}-.6425966{col 26}{space 2} .2705931{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4} -1.17371{col 67}{space 3}-.1114832
{txt}{space 8}beer {c |}{col 14}{res}{space 2} .8149708{col 26}{space 2} .0427513{col 37}{space 1}   19.06{col 46}{space 3}0.000{col 54}{space 4} .7310597{col 67}{space 3} .8988819
{txt}{space 4}totalvmt {c |}{col 14}{res}{space 2} 5.52e-07{col 26}{space 2} 4.51e-07{col 37}{space 1}    1.22{col 46}{space 3}0.222{col 54}{space 4}-3.34e-07{col 67}{space 3} 1.44e-06
{txt}{space 6}precip {c |}{col 14}{res}{space 2}-.0207855{col 26}{space 2} .0072146{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.0349461{col 67}{space 3} -.006625
{txt}{space 6}snow32 {c |}{col 14}{res}{space 2}-.0100672{col 26}{space 2} .0159747{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4} -.041422{col 67}{space 3} .0212876
{txt}{space 1}rural_speed {c |}{col 14}{res}{space 2} .0024342{col 26}{space 2} .0014309{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0003743{col 67}{space 3} .0052426
{txt}{space 1}urban_speed {c |}{col 14}{res}{space 2} .0005411{col 26}{space 2} .0010748{col 37}{space 1}    0.50{col 46}{space 3}0.615{col 54}{space 4}-.0015685{col 67}{space 3} .0026507
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.122241{col 26}{space 2} .1154685{col 37}{space 1}  -18.38{col 46}{space 3}0.000{col 54}{space 4} -2.34888{col 67}{space 3}-1.895602
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. // 2) Get \hat{c -(}tau{c )-}
. // 2a) Compute \hat{c -(}y(0){c )-} = in omega_1 population
. predict yhat, xb
{txt}
{com}. // 2b) Compute \hat{c -(}tau{c )-} = y-\hat{c -(}y(0){c )-}
. gen tau_hat_it = ln_fat_pc - yhat if primary == 1 // 
{txt}(922 missing values generated)

{com}. 
. // 3) Estimate tau_w by a weighted sum over omega_q
. // For weights, w_it, I follow Liu et al. (2022) AJPS who use a regular average
. gen h = year - cohort if cohort != 999
{txt}(690 missing values generated)

{com}. byso h (cohort) : egen ATT_h_Liu = mean(tau_hat_it) // get horizon specific ATT
{txt}(922 missing values generated)

{com}. 
. // why are these ATTs much larger than ATT dCDH? 
. // Are my tau_hats right? What about my weights/averaging method?
. label var h "Horizon"
{txt}
{com}. label var ATT_h_Liu "ATT_h Liu et al (Imputation ATTs by horizon weighted regularly)"
{txt}
{com}. 
. egen ATT_Liu = mean(ATT_h_Liu) // tau_w (tau given weights)
{txt}
{com}. label var ATT_Liu "ATT Liu et al (Imputation ATT weighted regularly)"
{txt}
{com}. 
. 
. preserve
{txt}
{com}.         keep h ATT_h_Liu ATT_Liu
{txt}
{com}.         keep if ATT_h_Liu != .
{txt}(922 observations deleted)

{com}.         duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(162 observations deleted)

{com}.         
.         // save
.         compress
  {txt}variable {bf}h{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (60 bytes saved)

{com}.         save "$dta_loc\q3e_ATTs", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset2/data\q3e_ATTs.dta saved

{com}. 
.         
.         // get overall mean
.         qui sum ATT_Liu
{txt}
{com}.         global att_est_3e = round(`r(mean)', 0.001)
{txt}
{com}. restore
{txt}
{com}. 
. 
. 
. // 4) Estimate standard error (conservative estimate)
. // Following Theorem 3 in BJS (2023), the plug-in estimator (eqn (7))
. // Approach 1: Pool multiple cohorts for simplicity 
. gen cohort_coarse = 999 if cohort == 999 // decade cohort
{txt}(414 missing values generated)

{com}. replace cohort_coarse = 1980 if inrange(cohort, 1980, 1989)
{txt}(138 real changes made)

{com}. replace cohort_coarse = 1990 if inrange(cohort, 1990, 1999)
{txt}(161 real changes made)

{com}. replace cohort_coarse = 2000 if inrange(cohort, 2000, 2009)
{txt}(115 real changes made)

{com}. 
. // get eps_it = tau_hat_{c -(}it{c )-} - tau_hat_{c -(}Et{c )-}
. byso cohort_coarse (h) : egen tau_hat_coarset = mean(tau_hat_it) 
{txt}(690 missing values generated)

{com}. replace tau_hat_coarset = . if primary != 1
{txt}(232 real changes made, 232 to missing)

{com}. gen eps_it = tau_hat_it - tau_hat_coarset
{txt}(922 missing values generated)

{com}. sum eps_it

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}eps_it {c |}{res}        182    2.27e-09    .1198755  -.2908311   .3260227
{txt}
{com}. 
. // let v_it = w_it = size of omega_1
. count if primary == 1
  {res}182
{txt}
{com}. gen v_it = 1/`r(N)'
{txt}
{com}. gen v_e_it = v_it * eps_it
{txt}(922 missing values generated)

{com}. 
. // var(tau_it) = sum_i (sum_t v_it eps_it)^2
. byso state : egen sumt_v_e = total(v_e_it) // sum over time within state, i
{txt}
{com}. gen sumt_v_e_sq = sumt_v_e^2
{txt}
{com}. keep state sumt_v_e_sq
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(1,056 observations deleted)

{com}. egen sumi_sumt_v_e_sq = total(sumt_v_e_sq)
{txt}
{com}. gen se = sqrt(sumi_sumt_v_e_sq)
{txt}
{com}. qui sum se
{txt}
{com}. local se_est_3e = round(`r(mean)', 0.001)
{txt}
{com}. 
. 
. 
. dis "ATT = $att_est_3e"
{res}ATT = -.095
{txt}
{com}. dis "SE = $se_est_3e"
{res}SE = 
{txt}
{com}. 
. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3f.do"
{txt}
{com}. /*
> Title:          02_analysis_q3f.do
> Outline:        Question 3, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Now proceed with the DiD estimation. 
> 
> (f) Estimate the static two-way fixed-effect regression (without covariates or 
> population weights). 
> 
> Then estimate and plot the total weight this regression places on treated 
> observations at each horizon. In what way are these weights informative?
> 
> Compare them to the sample weights of each horizon. 
> 
> In your view, does the static regression coefficient provide a useful summary of causal effects in this setting? Discuss.
> 
> */
. 
. set graphics off
{txt}
{com}. 
. use "$dta_loc/pset2_q1", clear
{txt}
{com}. isid state year
{txt}
{com}. 
. sort state year primary secondary
{txt}
{com}. drop college beer unemploy totalvmt precip snow32 rural_speed urban_speed prim_ever
{txt}
{com}. 
. // 1) Run static TWFE
. reg ln_fat_pc primary i.state i.year  

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,104
{txt}{hline 13}{c +}{hline 34}   F(70, 1033)     = {res}   144.58
{txt}       Model {c |} {res}  114.49612        70  1.63565886   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 11.6865682     1,033  .011313232   {txt}R-squared       ={res}    0.9074
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9011
{txt}       Total {c |} {res} 126.182688     1,103  .114399536   {txt}Root MSE        =   {res} .10636

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ln_fat_pc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}primary {c |}{col 14}{res}{space 2} -.086313{col 26}{space 2} .0141786{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-.1141352{col 67}{space 3}-.0584908
{txt}{space 12} {c |}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2}-.0293379{col 26}{space 2} .0314617{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4} -.091074{col 67}{space 3} .0323983
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2}-.0816228{col 26}{space 2} .0314617{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-.1433589{col 67}{space 3}-.0198866
{txt}{space 9}CA  {c |}{col 14}{res}{space 2}-.4860733{col 26}{space 2} .0316604{col 37}{space 1}  -15.35{col 46}{space 3}0.000{col 54}{space 4}-.5481994{col 67}{space 3}-.4239473
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -.395752{col 26}{space 2} .0314617{col 37}{space 1}  -12.58{col 46}{space 3}0.000{col 54}{space 4}-.4574882{col 67}{space 3}-.3340159
{txt}{space 9}CT  {c |}{col 14}{res}{space 2}-.7363915{col 26}{space 2} .0325307{col 37}{space 1}  -22.64{col 46}{space 3}0.000{col 54}{space 4}-.8002252{col 67}{space 3}-.6725578
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.3409133{col 26}{space 2} .0314194{col 37}{space 1}  -10.85{col 46}{space 3}0.000{col 54}{space 4}-.4025664{col 67}{space 3}-.2792601
{txt}{space 9}FL  {c |}{col 14}{res}{space 2}-.1757351{col 26}{space 2} .0314617{col 37}{space 1}   -5.59{col 46}{space 3}0.000{col 54}{space 4}-.2374712{col 67}{space 3}-.1139989
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}-.1248669{col 26}{space 2} .0314617{col 37}{space 1}   -3.97{col 46}{space 3}0.000{col 54}{space 4}-.1866031{col 67}{space 3}-.0631308
{txt}{space 9}IA  {c |}{col 14}{res}{space 2}-.3448144{col 26}{space 2} .0325307{col 37}{space 1}  -10.60{col 46}{space 3}0.000{col 54}{space 4}-.4086481{col 67}{space 3}-.2809807
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} -.072612{col 26}{space 2} .0314617{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.1343482{col 67}{space 3}-.0108758
{txt}{space 9}IL  {c |}{col 14}{res}{space 2}-.6624876{col 26}{space 2} .0314617{col 37}{space 1}  -21.06{col 46}{space 3}0.000{col 54}{space 4}-.7242238{col 67}{space 3}-.6007515
{txt}{space 9}IN  {c |}{col 14}{res}{space 2}-.3755149{col 26}{space 2} .0313892{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-.4371087{col 67}{space 3}-.3139211
{txt}{space 9}KS  {c |}{col 14}{res}{space 2}-.3034341{col 26}{space 2} .0314617{col 37}{space 1}   -9.64{col 46}{space 3}0.000{col 54}{space 4}-.3651703{col 67}{space 3}-.2416979
{txt}{space 9}KY  {c |}{col 14}{res}{space 2}-.1519657{col 26}{space 2} .0314617{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-.2137019{col 67}{space 3}-.0902295
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}-.1449804{col 26}{space 2} .0314617{col 37}{space 1}   -4.61{col 46}{space 3}0.000{col 54}{space 4}-.2067166{col 67}{space 3}-.0832442
{txt}{space 9}MA  {c |}{col 14}{res}{space 2}-1.030069{col 26}{space 2} .0314617{col 37}{space 1}  -32.74{col 46}{space 3}0.000{col 54}{space 4}-1.091805{col 67}{space 3}-.9683329
{txt}{space 9}MD  {c |}{col 14}{res}{space 2}-.5715891{col 26}{space 2} .0313892{col 37}{space 1}  -18.21{col 46}{space 3}0.000{col 54}{space 4}-.6331829{col 67}{space 3}-.5099953
{txt}{space 9}ME  {c |}{col 14}{res}{space 2}-.4235325{col 26}{space 2} .0314617{col 37}{space 1}  -13.46{col 46}{space 3}0.000{col 54}{space 4}-.4852687{col 67}{space 3}-.3617964
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} -.481306{col 26}{space 2} .0313649{col 37}{space 1}  -15.35{col 46}{space 3}0.000{col 54}{space 4}-.5428523{col 67}{space 3}-.4197598
{txt}{space 9}MN  {c |}{col 14}{res}{space 2}-.6387676{col 26}{space 2} .0314617{col 37}{space 1}  -20.30{col 46}{space 3}0.000{col 54}{space 4}-.7005037{col 67}{space 3}-.5770314
{txt}{space 9}MO  {c |}{col 14}{res}{space 2}-.2141849{col 26}{space 2} .0314617{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.2759211{col 67}{space 3}-.1524488
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} .1598096{col 26}{space 2} .0314617{col 37}{space 1}    5.08{col 46}{space 3}0.000{col 54}{space 4} .0980734{col 67}{space 3} .2215457
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} .0727163{col 26}{space 2} .0314617{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} .0109801{col 67}{space 3} .1344525
{txt}{space 9}NC  {c |}{col 14}{res}{space 2}-.1203648{col 26}{space 2} .0323726{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.1838883{col 67}{space 3}-.0568412
{txt}{space 9}ND  {c |}{col 14}{res}{space 2}-.4887416{col 26}{space 2} .0314617{col 37}{space 1}  -15.53{col 46}{space 3}0.000{col 54}{space 4}-.5504778{col 67}{space 3}-.4270054
{txt}{space 9}NE  {c |}{col 14}{res}{space 2}-.3804023{col 26}{space 2} .0314617{col 37}{space 1}  -12.09{col 46}{space 3}0.000{col 54}{space 4}-.4421384{col 67}{space 3}-.3186661
{txt}{space 9}NH  {c |}{col 14}{res}{space 2}-.6423412{col 26}{space 2} .0314617{col 37}{space 1}  -20.42{col 46}{space 3}0.000{col 54}{space 4}-.7040774{col 67}{space 3}-.5806051
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2}-.8303667{col 26}{space 2} .0313649{col 37}{space 1}  -26.47{col 46}{space 3}0.000{col 54}{space 4} -.891913{col 67}{space 3}-.7688205
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} .2558049{col 26}{space 2} .0325307{col 37}{space 1}    7.86{col 46}{space 3}0.000{col 54}{space 4} .1919712{col 67}{space 3} .3196387
{txt}{space 9}NV  {c |}{col 14}{res}{space 2}-.1259323{col 26}{space 2} .0314617{col 37}{space 1}   -4.00{col 46}{space 3}0.000{col 54}{space 4}-.1876685{col 67}{space 3}-.0641961
{txt}{space 9}NY  {c |}{col 14}{res}{space 2}-.8314321{col 26}{space 2} .0328793{col 37}{space 1}  -25.29{col 46}{space 3}0.000{col 54}{space 4}-.8959499{col 67}{space 3}-.7669143
{txt}{space 9}OH  {c |}{col 14}{res}{space 2}-.5959529{col 26}{space 2} .0314617{col 37}{space 1}  -18.94{col 46}{space 3}0.000{col 54}{space 4}-.6576891{col 67}{space 3}-.5342167
{txt}{space 9}OK  {c |}{col 14}{res}{space 2}-.1119326{col 26}{space 2} .0313892{col 37}{space 1}   -3.57{col 46}{space 3}0.000{col 54}{space 4}-.1735264{col 67}{space 3}-.0503389
{txt}{space 9}OR  {c |}{col 14}{res}{space 2}-.2979461{col 26}{space 2} .0318519{col 37}{space 1}   -9.35{col 46}{space 3}0.000{col 54}{space 4}-.3604479{col 67}{space 3}-.2354444
{txt}{space 9}PA  {c |}{col 14}{res}{space 2}-.6007975{col 26}{space 2} .0314617{col 37}{space 1}  -19.10{col 46}{space 3}0.000{col 54}{space 4}-.6625337{col 67}{space 3}-.5390613
{txt}{space 9}RI  {c |}{col 14}{res}{space 2}-1.050816{col 26}{space 2} .0314617{col 37}{space 1}  -33.40{col 46}{space 3}0.000{col 54}{space 4}-1.112553{col 67}{space 3}-.9890802
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} .0362623{col 26}{space 2} .0314617{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.0254739{col 67}{space 3} .0979984
{txt}{space 9}SD  {c |}{col 14}{res}{space 2}-.1463394{col 26}{space 2} .0314617{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}-.2080756{col 67}{space 3}-.0846033
{txt}{space 9}TN  {c |}{col 14}{res}{space 2}-.0861194{col 26}{space 2} .0314617{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-.1478556{col 67}{space 3}-.0243832
{txt}{space 9}TX  {c |}{col 14}{res}{space 2}-.1799467{col 26}{space 2} .0325307{col 37}{space 1}   -5.53{col 46}{space 3}0.000{col 54}{space 4}-.2437804{col 67}{space 3}-.1161129
{txt}{space 9}UT  {c |}{col 14}{res}{space 2}-.4078627{col 26}{space 2} .0314617{col 37}{space 1}  -12.96{col 46}{space 3}0.000{col 54}{space 4}-.4695989{col 67}{space 3}-.3461266
{txt}{space 9}VA  {c |}{col 14}{res}{space 2}-.5159498{col 26}{space 2} .0314617{col 37}{space 1}  -16.40{col 46}{space 3}0.000{col 54}{space 4} -.577686{col 67}{space 3}-.4542137
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -.368163{col 26}{space 2} .0314617{col 37}{space 1}  -11.70{col 46}{space 3}0.000{col 54}{space 4}-.4298992{col 67}{space 3}-.3064268
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.5966504{col 26}{space 2} .0313892{col 37}{space 1}  -19.01{col 46}{space 3}0.000{col 54}{space 4}-.6582442{col 67}{space 3}-.5350566
{txt}{space 9}WI  {c |}{col 14}{res}{space 2}-.4982345{col 26}{space 2} .0314617{col 37}{space 1}  -15.84{col 46}{space 3}0.000{col 54}{space 4}-.5599706{col 67}{space 3}-.4364983
{txt}{space 9}WV  {c |}{col 14}{res}{space 2}-.1082579{col 26}{space 2} .0314617{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.1699941{col 67}{space 3}-.0465218
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} .2398832{col 26}{space 2} .0314617{col 37}{space 1}    7.62{col 46}{space 3}0.000{col 54}{space 4}  .178147{col 67}{space 3} .3016193
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-.1216089{col 26}{space 2} .0217114{col 37}{space 1}   -5.60{col 46}{space 3}0.000{col 54}{space 4}-.1642124{col 67}{space 3}-.0790055
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-.1579019{col 26}{space 2} .0217114{col 37}{space 1}   -7.27{col 46}{space 3}0.000{col 54}{space 4}-.2005054{col 67}{space 3}-.1152985
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-.1486924{col 26}{space 2} .0217134{col 37}{space 1}   -6.85{col 46}{space 3}0.000{col 54}{space 4}-.1912998{col 67}{space 3} -.106085
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.1652729{col 26}{space 2} .0217134{col 37}{space 1}   -7.61{col 46}{space 3}0.000{col 54}{space 4}-.2078803{col 67}{space 3}-.1226655
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-.1117621{col 26}{space 2} .0217616{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4} -.154464{col 67}{space 3}-.0690602
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-.1110629{col 26}{space 2} .0217836{col 37}{space 1}   -5.10{col 46}{space 3}0.000{col 54}{space 4} -.153808{col 67}{space 3}-.0683177
{txt}{space 7}1988  {c |}{col 14}{res}{space 2} -.101228{col 26}{space 2} .0217836{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}-.1439732{col 67}{space 3}-.0584828
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}-.1607602{col 26}{space 2} .0217836{col 37}{space 1}   -7.38{col 46}{space 3}0.000{col 54}{space 4}-.2035054{col 67}{space 3}-.1180151
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}-.1827416{col 26}{space 2} .0217836{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.2254868{col 67}{space 3}-.1399965
{txt}{space 7}1991  {c |}{col 14}{res}{space 2}-.2554708{col 26}{space 2} .0218096{col 37}{space 1}  -11.71{col 46}{space 3}0.000{col 54}{space 4} -.298267{col 67}{space 3}-.2126746
{txt}{space 7}1992  {c |}{col 14}{res}{space 2}-.3133145{col 26}{space 2} .0218096{col 37}{space 1}  -14.37{col 46}{space 3}0.000{col 54}{space 4}-.3561107{col 67}{space 3}-.2705182
{txt}{space 7}1993  {c |}{col 14}{res}{space 2}-.3119167{col 26}{space 2} .0218396{col 37}{space 1}  -14.28{col 46}{space 3}0.000{col 54}{space 4}-.3547718{col 67}{space 3}-.2690616
{txt}{space 7}1994  {c |}{col 14}{res}{space 2}-.3176142{col 26}{space 2} .0218396{col 37}{space 1}  -14.54{col 46}{space 3}0.000{col 54}{space 4}-.3604693{col 67}{space 3}-.2747591
{txt}{space 7}1995  {c |}{col 14}{res}{space 2}-.2940335{col 26}{space 2} .0218396{col 37}{space 1}  -13.46{col 46}{space 3}0.000{col 54}{space 4}-.3368885{col 67}{space 3}-.2511784
{txt}{space 7}1996  {c |}{col 14}{res}{space 2} -.304645{col 26}{space 2} .0219114{col 37}{space 1}  -13.90{col 46}{space 3}0.000{col 54}{space 4} -.347641{col 67}{space 3}-.2616491
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}  -.29207{col 26}{space 2} .0219114{col 37}{space 1}  -13.33{col 46}{space 3}0.000{col 54}{space 4}-.3350659{col 67}{space 3} -.249074
{txt}{space 7}1998  {c |}{col 14}{res}{space 2}-.3093021{col 26}{space 2} .0220484{col 37}{space 1}  -14.03{col 46}{space 3}0.000{col 54}{space 4}-.3525668{col 67}{space 3}-.2660374
{txt}{space 7}1999  {c |}{col 14}{res}{space 2}-.3142163{col 26}{space 2} .0220484{col 37}{space 1}  -14.25{col 46}{space 3}0.000{col 54}{space 4} -.357481{col 67}{space 3}-.2709516
{txt}{space 7}2000  {c |}{col 14}{res}{space 2}-.3347495{col 26}{space 2} .0222198{col 37}{space 1}  -15.07{col 46}{space 3}0.000{col 54}{space 4}-.3783507{col 67}{space 3}-.2911484
{txt}{space 7}2001  {c |}{col 14}{res}{space 2}-.3305344{col 26}{space 2} .0222198{col 37}{space 1}  -14.88{col 46}{space 3}0.000{col 54}{space 4}-.3741356{col 67}{space 3}-.2869332
{txt}{space 7}2002  {c |}{col 14}{res}{space 2}-.3195161{col 26}{space 2} .0222845{col 37}{space 1}  -14.34{col 46}{space 3}0.000{col 54}{space 4}-.3632442{col 67}{space 3}-.2757879
{txt}{space 7}2003  {c |}{col 14}{res}{space 2} -.331026{col 26}{space 2}  .022353{col 37}{space 1}  -14.81{col 46}{space 3}0.000{col 54}{space 4}-.3748884{col 67}{space 3}-.2871636
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.152796{col 26}{space 2} .0267832{col 37}{space 1}  -43.04{col 46}{space 3}0.000{col 54}{space 4}-1.205351{col 67}{space 3} -1.10024
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mat A = r(table)
{txt}
{com}. mat att = A[1, "primary"] // get att_est
{txt}
{com}. mat se = A[2, "primary"] // get se_est
{txt}
{com}. global att_est_3f = round(att[1,1], 0.001)
{txt}
{com}. global se_est_3f  = round(se[1,1], 0.001)
{txt}
{com}. 
. 
. // 2) Get weights using auxiliary reg via FWL: reg D on i and t FEs
. // from proof of proposition 2 in BJS
. reg primary i.state i.year  

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,104
{txt}{hline 13}{c +}{hline 34}   F(69, 1034)     = {res}    25.49
{txt}       Model {c |} {res} 95.7210145        69  1.38726108   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 56.2753623     1,034  .054424915   {txt}R-squared       ={res}    0.6298
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6051
{txt}       Total {c |} {res} 151.996377     1,103  .137802699   {txt}Root MSE        =   {res} .23329

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     primary{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 9}AR  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}AZ  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}CA  {c |}{col 14}{res}{space 2} .3043478{col 26}{space 2} .0687939{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4} .1693562{col 67}{space 3} .4393394
{txt}{space 9}CO  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}CT  {c |}{col 14}{res}{space 2} .6086957{col 26}{space 2} .0687939{col 37}{space 1}    8.85{col 46}{space 3}0.000{col 54}{space 4} .4737041{col 67}{space 3} .7436872
{txt}{space 9}DE  {c |}{col 14}{res}{space 2}-.1304348{col 26}{space 2} .0687939{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.2654264{col 67}{space 3} .0045568
{txt}{space 9}FL  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}GA  {c |}{col 14}{res}{space 2}  .173913{col 26}{space 2} .0687939{col 37}{space 1}    2.53{col 46}{space 3}0.012{col 54}{space 4} .0389215{col 67}{space 3} .3089046
{txt}{space 9}IA  {c |}{col 14}{res}{space 2} .6086957{col 26}{space 2} .0687939{col 37}{space 1}    8.85{col 46}{space 3}0.000{col 54}{space 4} .4737041{col 67}{space 3} .7436872
{txt}{space 9}ID  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}IL  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}IN  {c |}{col 14}{res}{space 2} .0869565{col 26}{space 2} .0687939{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0480351{col 67}{space 3} .2219481
{txt}{space 9}KS  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}KY  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}LA  {c |}{col 14}{res}{space 2}  .173913{col 26}{space 2} .0687939{col 37}{space 1}    2.53{col 46}{space 3}0.012{col 54}{space 4} .0389215{col 67}{space 3} .3089046
{txt}{space 9}MA  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}MD  {c |}{col 14}{res}{space 2} .0869565{col 26}{space 2} .0687939{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0480351{col 67}{space 3} .2219481
{txt}{space 9}ME  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}MI  {c |}{col 14}{res}{space 2} 2.79e-15{col 26}{space 2} .0687939{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1349916{col 67}{space 3} .1349916
{txt}{space 9}MN  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}MO  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}MS  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}MT  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}NC  {c |}{col 14}{res}{space 2} .5652174{col 26}{space 2} .0687939{col 37}{space 1}    8.22{col 46}{space 3}0.000{col 54}{space 4} .4302258{col 67}{space 3}  .700209
{txt}{space 9}ND  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}NE  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}NH  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}NJ  {c |}{col 14}{res}{space 2} 2.79e-15{col 26}{space 2} .0687939{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1349916{col 67}{space 3} .1349916
{txt}{space 9}NM  {c |}{col 14}{res}{space 2} .6086957{col 26}{space 2} .0687939{col 37}{space 1}    8.85{col 46}{space 3}0.000{col 54}{space 4} .4737041{col 67}{space 3} .7436872
{txt}{space 9}NV  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}NY  {c |}{col 14}{res}{space 2} .6956522{col 26}{space 2} .0687939{col 37}{space 1}   10.11{col 46}{space 3}0.000{col 54}{space 4} .5606606{col 67}{space 3} .8306438
{txt}{space 9}OH  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}OK  {c |}{col 14}{res}{space 2} .0869565{col 26}{space 2} .0687939{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0480351{col 67}{space 3} .2219481
{txt}{space 9}OR  {c |}{col 14}{res}{space 2} .3913043{col 26}{space 2} .0687939{col 37}{space 1}    5.69{col 46}{space 3}0.000{col 54}{space 4} .2563128{col 67}{space 3} .5262959
{txt}{space 9}PA  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}RI  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}SC  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}SD  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}TN  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}TX  {c |}{col 14}{res}{space 2} .6086957{col 26}{space 2} .0687939{col 37}{space 1}    8.85{col 46}{space 3}0.000{col 54}{space 4} .4737041{col 67}{space 3} .7436872
{txt}{space 9}UT  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}VA  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}VT  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}WA  {c |}{col 14}{res}{space 2}-.0869565{col 26}{space 2} .0687939{col 37}{space 1}   -1.26{col 46}{space 3}0.207{col 54}{space 4}-.2219481{col 67}{space 3} .0480351
{txt}{space 9}WI  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}WV  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 9}WY  {c |}{col 14}{res}{space 2} -.173913{col 26}{space 2} .0687939{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.3089046{col 67}{space 3}-.0389215
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1982  {c |}{col 14}{res}{space 2}-6.88e-16{col 26}{space 2} .0476204{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.0934437{col 67}{space 3} .0934437
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-7.09e-16{col 26}{space 2} .0476204{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.0934437{col 67}{space 3} .0934437
{txt}{space 7}1984  {c |}{col 14}{res}{space 2} .0208333{col 26}{space 2} .0476204{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-.0726104{col 67}{space 3}  .114277
{txt}{space 7}1985  {c |}{col 14}{res}{space 2} .0208333{col 26}{space 2} .0476204{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-.0726104{col 67}{space 3}  .114277
{txt}{space 7}1986  {c |}{col 14}{res}{space 2} .1041667{col 26}{space 2} .0476204{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4}  .010723{col 67}{space 3} .1976104
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}     .125{col 26}{space 2} .0476204{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .0315563{col 67}{space 3} .2184437
{txt}{space 7}1988  {c |}{col 14}{res}{space 2}     .125{col 26}{space 2} .0476204{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .0315563{col 67}{space 3} .2184437
{txt}{space 7}1989  {c |}{col 14}{res}{space 2}     .125{col 26}{space 2} .0476204{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .0315563{col 67}{space 3} .2184437
{txt}{space 7}1990  {c |}{col 14}{res}{space 2}     .125{col 26}{space 2} .0476204{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .0315563{col 67}{space 3} .2184437
{txt}{space 7}1991  {c |}{col 14}{res}{space 2} .1458333{col 26}{space 2} .0476204{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} .0523896{col 67}{space 3}  .239277
{txt}{space 7}1992  {c |}{col 14}{res}{space 2} .1458333{col 26}{space 2} .0476204{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} .0523896{col 67}{space 3}  .239277
{txt}{space 7}1993  {c |}{col 14}{res}{space 2} .1666667{col 26}{space 2} .0476204{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4}  .073223{col 67}{space 3} .2601104
{txt}{space 7}1994  {c |}{col 14}{res}{space 2} .1666667{col 26}{space 2} .0476204{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4}  .073223{col 67}{space 3} .2601104
{txt}{space 7}1995  {c |}{col 14}{res}{space 2} .1666667{col 26}{space 2} .0476204{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4}  .073223{col 67}{space 3} .2601104
{txt}{space 7}1996  {c |}{col 14}{res}{space 2} .2083333{col 26}{space 2} .0476204{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .1148896{col 67}{space 3}  .301777
{txt}{space 7}1997  {c |}{col 14}{res}{space 2} .2083333{col 26}{space 2} .0476204{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .1148896{col 67}{space 3}  .301777
{txt}{space 7}1998  {c |}{col 14}{res}{space 2} .2708333{col 26}{space 2} .0476204{col 37}{space 1}    5.69{col 46}{space 3}0.000{col 54}{space 4} .1773896{col 67}{space 3}  .364277
{txt}{space 7}1999  {c |}{col 14}{res}{space 2} .2708333{col 26}{space 2} .0476204{col 37}{space 1}    5.69{col 46}{space 3}0.000{col 54}{space 4} .1773896{col 67}{space 3}  .364277
{txt}{space 7}2000  {c |}{col 14}{res}{space 2} .3333333{col 26}{space 2} .0476204{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} .2398896{col 67}{space 3}  .426777
{txt}{space 7}2001  {c |}{col 14}{res}{space 2} .3333333{col 26}{space 2} .0476204{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} .2398896{col 67}{space 3}  .426777
{txt}{space 7}2002  {c |}{col 14}{res}{space 2} .3541667{col 26}{space 2} .0476204{col 37}{space 1}    7.44{col 46}{space 3}0.000{col 54}{space 4}  .260723{col 67}{space 3} .4476104
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}     .375{col 26}{space 2} .0476204{col 37}{space 1}    7.87{col 46}{space 3}0.000{col 54}{space 4} .2815563{col 67}{space 3} .4684437
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .009058{col 26}{space 2}  .058744{col 37}{space 1}    0.15{col 46}{space 3}0.877{col 54}{space 4} -.106213{col 67}{space 3}  .124329
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict dres, residuals
{txt}
{com}. 
. // Two ways to get denominator in weights
. // method 1
. gen dres_sq = dres^2
{txt}
{com}. egen tot_dres_sq = total(dres_sq)
{txt}
{com}. 
. // method 2
. gen dres_treat = dres if primary == 1
{txt}(922 missing values generated)

{com}. egen tot_dres_treat = total(dres_treat) 
{txt}
{com}. // assert tot_dres_treat == tot_dres_sq // equivalent
. drop tot_dres_treat // drop method 2
{txt}
{com}. 
. gen w_it_static = dres/tot_dres_sq 
{txt}
{com}. egen tot_w_it = total(w_it_static)
{txt}
{com}. sum tot_w_it // this sums to zero because it's on both omega_0 and _1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}tot_w_it {c |}{res}      1,104   -5.77e-09           0  -5.77e-09  -5.77e-09
{txt}
{com}. 
. gen h = year - cohort if cohort != 999
{txt}(690 missing values generated)

{com}. byso h (cohort) : egen w_h = mean(w_it_static) // get horizon specific w_it_static
{txt}
{com}. scatter w_h h if primary == 1 
{res}{txt}
{com}. scatter w_it_static h if primary == 1 
{res}{txt}
{com}. // ANS: distant horizons get negative weights, yet total weights sum to 1.
. // These are the forbidden comparisons?
. 
. gen w_it_d = w_it_static if primary == 1 
{txt}(922 missing values generated)

{com}. egen tot_w_d = total(w_it_d)
{txt}
{com}. sum tot_w_d // this sums to one because it's on omega_1 only as proven in Prop. 3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}tot_w_d {c |}{res}      1,104           1           0          1          1
{txt}
{com}. 
. 
. // Q: Compare them to the sample weights of each horizon.
. // generate population weights at each horizon
. gen pop_d = population if primary == 1
{txt}(922 missing values generated)

{com}. egen tot_pop_d = total(pop_d) if primary == 1
{txt}(922 missing values generated)

{com}. gen w_sample = population/tot_pop_d
{txt}(922 missing values generated)

{com}. egen w_s_tot = total (w_sample)
{txt}
{com}. 
. label var h "Horizon"
{txt}
{com}. byso h (cohort) : egen w_h_pop = mean(w_sample) // get horizon specific w_it_static
{txt}(922 missing values generated)

{com}. twoway (scatter w_h_pop h if primary == 1) ///
>                 (scatter w_h h if primary == 1 ), ///
>                         legend(label(1 "Population weights") ///
>                                    label(2 "Static TWFE weight")) ///
>                 yline(0) ///
>                 ytitle("Weights") ///
>                 saving("$do_loc/Graphs/BJS_weights_h", replace)
{res}{txt}(file //Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/Graphs/BJS_weights_h.gph saved)

{com}.                 
. 
. graph export "$do_loc/Graphs/BJS_weights_h.png", ///
>         width(1200) height(900) ///
>         replace
{txt}(file //Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/Graphs/BJS_weights_h.png written in PNG format)

{com}.                                    
.                                    
. // ANS: TWFE weights are decreasing in h while the population weights are 
. // increasing because (1) the sample size increases over time and (2)
. // because fewer obs exist at longer horizons.
. preserve
{txt}
{com}.         collapse (mean) population, by(year)
{txt}
{com}.         scatter population year
{res}{txt}
{com}. restore
{txt}
{com}. 
. // In your view, does the static regression coefficient provide a useful 
. // summary of causal effects in this setting? Discuss.
. 
. // ANS: if the BJS paper provides any conclusion, it is that the static TWFE
. // is exactly wrong because, if treatment effects are heterogeneous, then the 
. // later horizons will be weighted negatively as we see in the horizon specifc
. // weights, w_h.
. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_analysis_q3z.do" // stack results
{txt}
{com}. /*
> Title:          02_analysis_q3z.do
> Outline:        Question 3, PSet 2 
> 
> Q3 DinD estimation
> 
> 3. Stack estimates in latex table
> 
> */
. 
. 
. 
. local table_loc table_3_all
{txt}
{com}. local table_title "ATT and SE by estimation method"
{txt}
{com}. local note_local "This table shows the ATT and, where feasible, the SE estimated using the different methods listed in question 3."
{txt}
{com}. 
. // print table of selected vars
. cap file close fh 
{txt}
{com}. file open fh using "$do_loc/Tables/`table_loc'.tex", replace write
{txt}
{com}. 
.         file write fh "\begin{c -(}center{c )-}" _n
{txt}
{com}.         file write fh "\begin{c -(}tabular{c )-}{c -(}lccl{c )-}" _n
{txt}
{com}.         file write fh "\hline\hline" _n
{txt}
{com}.         file write fh "Question & ATT & SE & Estimation note \\ [0.5ex]" _n
{txt}
{com}.         file write fh "\hline" _n
{txt}
{com}.         file write fh "Q3a              & $att_est_3a  & -                       & dCDH (2023) \\ " _n
{txt}
{com}.         file write fh "Q3b              & $att_est_3b  & $se_est_3b  & BJS (2023) \\ " _n
{txt}
{com}.         file write fh "Q3c.i    & $att_est_3c1 & $se_est_3c1 & Population weight 1 \\ " _n
{txt}
{com}.         file write fh "Q3c.ii   & $att_est_3c2 & $se_est_3c2 & Population weight 2 \\ " _n
{txt}
{com}.         file write fh "Q3d              & $att_est_3d  & $se_est_3d  & Including state-specific linear trends \\ " _n
{txt}
{com}.         file write fh "Q3e              & $att_est_3e  & $se_est_3e  & Including several covariates \\ " _n
{txt}
{com}.         file write fh "Q3f              & $att_est_3f  & $se_est_3f  & Static TWFE \\ " _n
{txt}
{com}.         file write fh "\hline\hline" _n 
{txt}
{com}.         file write fh "\end{c -(}tabular{c )-}" _n 
{txt}
{com}.         file write fh "\end{c -(}center{c )-}" _n 
{txt}
{com}. 
. file close fh 
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}//Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 2/Stata/pset2_logfile.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}30 Oct 2023, 12:49:02
{txt}{.-}
{smcl}
{txt}{sf}{ul off}