{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 3/Stata/pset3_logfile.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Nov 2023, 12:22:08
{txt}
{com}. 
. 
. // install programs
. // do "$do_loc/Code/01_programs.do"
. 
. // analyze
. do "$do_loc/Code/02_q3.do"
{txt}
{com}. /*
> Title:          02_q3b.do
> Purpose:        Question 3.b, PSet 3
> 
> Outline: Question 3.b
> 
> (b) Still, let’s try it out. Compute logNDi and estimate (2) by OLS without controls.
> Explain why this OLS may not be causal even if the specification is correct.
> 
> */
. 
. /* ---------------------------------------------------------------------------
> 3.b.i Compute logND */
. 
. // 1 Get list of cities with stations for lines open by 2016
. use "$dta_loc/pset3_stations", clear 
{txt}
{com}. merge m:1 lineid using "$dta_loc/pset3_lines", nogen assert(3) keepusing(open)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             565{txt}  
{col 5}{hline 41}

{com}. byso cityid : egen open_i = max(open)
{txt}
{com}. keep cityid open_i
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(300 observations deleted)

{com}. isid cityid
{txt}
{com}. label var open_i "City has any station open by 2016"
{txt}
{com}. tempfile city_wline_dta
{txt}
{com}. save    `city_wline_dta'
{txt}file C:\Users\YFKASH~1\AppData\Local\Temp\82\ST_17c4_000001.tmp saved

{com}. 
. // 2 merge station dummy with matrix of cross-city distances
. use "$dta_loc/pset3_distances", clear // distance between cities
{txt}
{com}. rename cityid1 cityid
{res}{txt}
{com}. merge m:1 cityid using `city_wline_dta', assert(1 3) nogen // no cities only in using
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          25,500
{txt}{col 9}from master{col 30}{res}          25,500{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}          90,100{txt}  
{col 5}{hline 41}

{com}. replace open_i = 0 if open_i == .
{txt}(25,500 real changes made)

{com}. 
. // 3 find ND (nearest distance)
. gen cond_dist = dist if open_i == 1
{txt}(46,920 missing values generated)

{com}. sort cityid2 open_i cond_dist
{txt}
{com}. byso cityid2 : egen nd = min(cond_dist)
{txt}
{com}. gen lognd = log(nd)
{txt}
{com}. label var lognd "log nearest distance"
{txt}
{com}. // hist lognd
. keep cityid2 lognd
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(115,260 observations deleted)

{com}. isid cityid2
{txt}
{com}. rename cityid2 cityid
{res}{txt}
{com}. 
. // merge in city characteristics
. merge 1:1 cityid using "$dta_loc/pset3_cities", nogen assert(3)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             340{txt}  
{col 5}{hline 41}

{com}. 
. // save for Q3c
. save "$dta_loc/q3b_lognd", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset3/data/q3b_lognd.dta saved

{com}. 
. 
. /*3.b.i -----------------------------------------------------------------------
> Estimate (2) by OLS without controls */
. encode province_en, gen(prov)
{txt}
{com}. 
. sum lognd

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}lognd {c |}{res}        340    4.380005    .8717383   2.692482   7.272453
{txt}
{com}. reg empgrowth lognd

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       275
{txt}{hline 13}{c +}{hline 34}   F(1, 273)       = {res}    38.05
{txt}       Model {c |} {res} 2.19897546         1  2.19897546   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 15.7773816       273  .057792607   {txt}R-squared       ={res}    0.1223
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1191
{txt}       Total {c |} {res}  17.976357       274  .065607143   {txt}Root MSE        =   {res}  .2404

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   empgrowth{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lognd {c |}{col 14}{res}{space 2}-.1331077{col 26}{space 2} .0215789{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-.1755898{col 67}{space 3}-.0906255
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8279967{col 26}{space 2} .0922075{col 37}{space 1}    8.98{col 46}{space 3}0.000{col 54}{space 4} .6464686{col 67}{space 3} 1.009525
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. areg empgrowth lognd, absorb(prov) // 
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}       275
{txt}Absorbed variable: {bf:prov}{col 49}No. of categories{col 67}= {res}        30
{txt}{col 49}F({res}   1{txt},{res}    244{txt}){col 67}= {res}     11.70
{txt}{col 49}Prob > F{col 67}= {res}    0.0007
{txt}{col 49}R-squared{col 67}= {res}    0.4645
{txt}{col 49}Adj R-squared{col 67}= {res}    0.3987
{txt}{col 49}Root MSE{col 67}= {res}    0.1986

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   empgrowth{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lognd {c |}{col 14}{res}{space 2}-.0830188{col 26}{space 2} .0242666{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4}-.1308176{col 67}{space 3}-.0352201
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6166268{col 26}{space 2} .1031008{col 37}{space 1}    5.98{col 46}{space 3}0.000{col 54}{space 4} .4135457{col 67}{space 3} .8197079
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}29{txt}, {res}244{txt}) = {res}5.377{col 62}{txt} Prob > F = {res}0.000
{txt}
{com}. 
. // cities with missing data are more remote 
. // (farther away from Beijing and from nearest city with HSR)
. gen miss = missing(empgrowth)
{txt}
{com}. reg lognd miss

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       340
{txt}{hline 13}{c +}{hline 34}   F(1, 338)       = {res}    56.46
{txt}       Model {c |} {res} 36.8719355         1  36.8719355   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  220.74355       338  .653087425   {txt}R-squared       ={res}    0.1431
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1406
{txt}       Total {c |} {res} 257.615485       339  .759927685   {txt}Root MSE        =   {res} .80814

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lognd{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}miss {c |}{col 14}{res}{space 2} .8374606{col 26}{space 2} .1114557{col 37}{space 1}    7.51{col 46}{space 3}0.000{col 54}{space 4} .6182266{col 67}{space 3} 1.056695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.219902{col 26}{space 2} .0487326{col 37}{space 1}   86.59{col 46}{space 3}0.000{col 54}{space 4} 4.124045{col 67}{space 3} 4.315759
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg dist_beijing miss

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       340
{txt}{hline 13}{c +}{hline 34}   F(1, 338)       = {res}    82.61
{txt}       Model {c |} {res}   28749484         1    28749484   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  117622406       338  347995.283   {txt}R-squared       ={res}    0.1964
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1940
{txt}       Total {c |} {res}  146371890       339  431775.486   {txt}Root MSE        =   {res} 589.91

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}dist_beijing{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}miss {c |}{col 14}{res}{space 2} 739.4886{col 26}{space 2} 81.35853{col 37}{space 1}    9.09{col 46}{space 3}0.000{col 54}{space 4} 579.4557{col 67}{space 3} 899.5214
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1113.033{col 26}{space 2} 35.57299{col 37}{space 1}   31.29{col 46}{space 3}0.000{col 54}{space 4} 1043.061{col 67}{space 3} 1183.005
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /*3.b.iii Threats to ID -------------------------------------------------------
> Explain why this OLS may not be causal even if the specification is correct. */
. // see overleaf
. 
. 
. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_q3c.do"
{txt}
{com}. /*
> Title:          02_q3c.do
> Purpose:        Question 3.c, PSet 3
> 
> Outline: Question 3.c.i
> 
> Briefly describe how Assumptions A1–A3 allow you to construct 
> counterfactual 2016 railway networks (i.e., sets of lines) that 
> were as likely to have happened as the realized network. 
> 
> c.i
> Simulate 999 such counterfactual networks; make sure to set a 
> seed, such that your results can be exactly reproduced. 
> 
> Compute logNDi for each city in each simulation and average it across simulations. 
> 
> We denote this average by μi. 
> 
> c.ii
> Report two corrected estimates of τ2: recentering by and controlling for μi. 
> Are they very different from your estimate in 3(b)? 
> What do you learn from this?
> 
> */
. 
. 
. /*3.c.i  ---------------------------------------------------------------------
> Estimate (2) by OLS without controls 
> We repeat part b only with randomly generated shocks g_k = open at the line level
> */
. 
. // Question: should I adjust probablity of opening by the number of links?
. // link stratified randomization? How do I force a positive relation between
. // L_k and propensity to get shocked? Not stratified for now.
. pause on
{txt}
{com}. set seed 154
{txt}
{com}. local T = 999
{txt}
{com}. 
. use "$dta_loc/pset3_lines", clear
{txt}
{com}. count if open == 0 // get count of shocks to resample
  {res}66
{txt}
{com}. local line_ct `r(N)' // 66
{txt}
{com}. 
. forval t = 1/`T' {c -(}
{txt}  2{com}. 
.         dis "Simulation t = `t'"
{txt}  3{com}.         dis "   - Randomize shocks"
{txt}  4{com}.         // 0 randomize the shocks (line openings)
.         qui {c -(}
{txt}  5{com}.                 
.                 use "$dta_loc/pset3_lines", clear
{txt}  6{com}.                 isid lineid
{txt}  7{com}.                 // equal weights within nlinks
.                 byso nlinks : gen rand = runiform() 
{txt}  8{com}.                 sort nlinks rand
{txt}  9{com}.                 
.                 // keep number of open lines within nlinks levels
.                 // For lines with multiple draws, keep higher draw
.                 byso nlinks : egen open_ct = total(open)
{txt} 10{com}.                 sort nlinks rand
{txt} 11{com}.                 byso nlinks : egen rand_rank = rank(rand), field
{txt} 12{com}. 
.                 // generate simulated shock
.                 gen open_`t' = rand_rank <= open_ct
{txt} 13{com}.                 // confirm number of shocks generated equals original number
.                 byso open_`t' : egen line_ct = rank(lineid), track
{txt} 14{com}.                 sort open_`t' line_ct
{txt} 15{com}.                 
.                 count if open_`t' == 0
{txt} 16{com}.                 assert `r(N)' == `line_ct'
{txt} 17{com}.                 sort lineid
{txt} 18{com}.                 drop open rand
{txt} 19{com}.                 rename open_`t' open
{txt} 20{com}.                 tempfile line_rand
{txt} 21{com}.                 save    `line_rand'
{txt} 22{com}.         {c )-}
{txt} 23{com}.         
.         dis "   - Merge openness data"
{txt} 24{com}.         qui {c -(}
{txt} 25{com}.                 // 1 Get list of cities with stations for lines open by 2016
.                 use "$dta_loc/pset3_stations", clear 
{txt} 26{com}.                 merge m:1 lineid using "`line_rand'", nogen assert(3) keepusing(open)
{txt} 27{com}.                 byso cityid : egen open_i = max(open)
{txt} 28{com}.                 keep cityid open_i
{txt} 29{com}.                 duplicates drop
{txt} 30{com}.                 isid cityid
{txt} 31{com}.                 label var open_i "City has any station open by 2016"
{txt} 32{com}.                 tempfile city_wline_dta
{txt} 33{com}.                 save    `city_wline_dta'
{txt} 34{com}.                 
.                 // 2 merge station dummy with matrix of cross-city distances
.                 use "$dta_loc/pset3_distances", clear // distance between cities
{txt} 35{com}.                 rename cityid1 cityid
{txt} 36{com}.                 merge m:1 cityid using `city_wline_dta', assert(1 3) nogen // no cities only in using
{txt} 37{com}.                 replace open_i = 0 if open_i == .
{txt} 38{com}.         {c )-}
{txt} 39{com}.         
.         dis "   - Find nearest distance to HSR city for each city"
{txt} 40{com}.         qui {c -(}
{txt} 41{com}.                 // 3 find ND (nearest distance)
.                 gen cond_dist = dist if open_i == 1
{txt} 42{com}.                 sort cityid2 open_i cond_dist
{txt} 43{com}.                 byso cityid2 : egen nd = min(cond_dist)
{txt} 44{com}.                 gen lognd_`t' = log(nd)
{txt} 45{com}.                 label var lognd_`t' "log nearest distance to city with HSR"
{txt} 46{com}.                 
.                 // hist lognd
.                 keep cityid2 lognd_`t'
{txt} 47{com}.                 duplicates drop
{txt} 48{com}.                 isid cityid2
{txt} 49{com}.                 rename cityid2 cityid
{txt} 50{com}.         {c )-}
{txt} 51{com}.         
.         dis "   - Merge result `t'"
{txt} 52{com}.         qui {c -(}
{txt} 53{com}.                 tempfile lognd_dta_`t'
{txt} 54{com}.                 save    `lognd_dta_`t''
{txt} 55{com}.                 
.                 if `t' == 1 {c -(}
{txt} 56{com}.                         use `lognd_dta_1', clear
{txt} 57{com}.                         tempfile lognd_dta
{txt} 58{com}.                         save    `lognd_dta', replace    
{txt} 59{com}.                 {c )-}
{txt} 60{com}.                 else {c -(}
{txt} 61{com}.                         use `lognd_dta'
{txt} 62{com}.                         merge 1:1 cityid using `lognd_dta_`t'', assert(3) nogen
{txt} 63{com}.                         tempfile lognd_dta
{txt} 64{com}.                         save    `lognd_dta', replace                    
{txt} 65{com}.                 {c )-}
{txt} 66{com}.         {c )-}
{txt} 67{com}. {c )-}
Simulation t = 1
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 1
Simulation t = 2
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 2
Simulation t = 3
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 3
Simulation t = 4
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 4
Simulation t = 5
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 5
Simulation t = 6
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 6
Simulation t = 7
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 7
Simulation t = 8
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 8
Simulation t = 9
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 9
Simulation t = 10
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 10
Simulation t = 11
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 11
Simulation t = 12
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 12
Simulation t = 13
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 13
Simulation t = 14
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 14
Simulation t = 15
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 15
Simulation t = 16
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 16
Simulation t = 17
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 17
Simulation t = 18
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 18
Simulation t = 19
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 19
Simulation t = 20
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 20
Simulation t = 21
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 21
Simulation t = 22
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 22
Simulation t = 23
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 23
Simulation t = 24
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 24
Simulation t = 25
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 25
Simulation t = 26
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 26
Simulation t = 27
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 27
Simulation t = 28
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 28
Simulation t = 29
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 29
Simulation t = 30
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 30
Simulation t = 31
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 31
Simulation t = 32
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 32
Simulation t = 33
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 33
Simulation t = 34
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 34
Simulation t = 35
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 35
Simulation t = 36
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 36
Simulation t = 37
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 37
Simulation t = 38
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 38
Simulation t = 39
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 39
Simulation t = 40
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 40
Simulation t = 41
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 41
Simulation t = 42
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 42
Simulation t = 43
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 43
Simulation t = 44
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 44
Simulation t = 45
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 45
Simulation t = 46
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 46
Simulation t = 47
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 47
Simulation t = 48
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 48
Simulation t = 49
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 49
Simulation t = 50
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 50
Simulation t = 51
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 51
Simulation t = 52
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 52
Simulation t = 53
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 53
Simulation t = 54
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 54
Simulation t = 55
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 55
Simulation t = 56
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 56
Simulation t = 57
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 57
Simulation t = 58
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 58
Simulation t = 59
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 59
Simulation t = 60
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 60
Simulation t = 61
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 61
Simulation t = 62
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 62
Simulation t = 63
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 63
Simulation t = 64
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 64
Simulation t = 65
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 65
Simulation t = 66
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 66
Simulation t = 67
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 67
Simulation t = 68
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 68
Simulation t = 69
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 69
Simulation t = 70
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 70
Simulation t = 71
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 71
Simulation t = 72
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 72
Simulation t = 73
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 73
Simulation t = 74
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 74
Simulation t = 75
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 75
Simulation t = 76
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 76
Simulation t = 77
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 77
Simulation t = 78
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 78
Simulation t = 79
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 79
Simulation t = 80
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 80
Simulation t = 81
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 81
Simulation t = 82
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 82
Simulation t = 83
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 83
Simulation t = 84
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 84
Simulation t = 85
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 85
Simulation t = 86
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 86
Simulation t = 87
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 87
Simulation t = 88
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 88
Simulation t = 89
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 89
Simulation t = 90
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 90
Simulation t = 91
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 91
Simulation t = 92
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 92
Simulation t = 93
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 93
Simulation t = 94
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 94
Simulation t = 95
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 95
Simulation t = 96
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 96
Simulation t = 97
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 97
Simulation t = 98
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 98
Simulation t = 99
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 99
Simulation t = 100
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 100
Simulation t = 101
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 101
Simulation t = 102
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 102
Simulation t = 103
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 103
Simulation t = 104
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 104
Simulation t = 105
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 105
Simulation t = 106
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 106
Simulation t = 107
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 107
Simulation t = 108
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 108
Simulation t = 109
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 109
Simulation t = 110
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 110
Simulation t = 111
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 111
Simulation t = 112
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 112
Simulation t = 113
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 113
Simulation t = 114
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 114
Simulation t = 115
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 115
Simulation t = 116
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 116
Simulation t = 117
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 117
Simulation t = 118
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 118
Simulation t = 119
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 119
Simulation t = 120
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 120
Simulation t = 121
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 121
Simulation t = 122
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 122
Simulation t = 123
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 123
Simulation t = 124
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 124
Simulation t = 125
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 125
Simulation t = 126
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 126
Simulation t = 127
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 127
Simulation t = 128
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 128
Simulation t = 129
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 129
Simulation t = 130
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 130
Simulation t = 131
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 131
Simulation t = 132
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 132
Simulation t = 133
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 133
Simulation t = 134
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 134
Simulation t = 135
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 135
Simulation t = 136
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 136
Simulation t = 137
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 137
Simulation t = 138
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 138
Simulation t = 139
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 139
Simulation t = 140
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 140
Simulation t = 141
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 141
Simulation t = 142
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 142
Simulation t = 143
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 143
Simulation t = 144
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 144
Simulation t = 145
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 145
Simulation t = 146
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 146
Simulation t = 147
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 147
Simulation t = 148
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 148
Simulation t = 149
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 149
Simulation t = 150
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 150
Simulation t = 151
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 151
Simulation t = 152
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 152
Simulation t = 153
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 153
Simulation t = 154
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 154
Simulation t = 155
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 155
Simulation t = 156
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 156
Simulation t = 157
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 157
Simulation t = 158
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 158
Simulation t = 159
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 159
Simulation t = 160
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 160
Simulation t = 161
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 161
Simulation t = 162
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 162
Simulation t = 163
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 163
Simulation t = 164
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 164
Simulation t = 165
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 165
Simulation t = 166
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 166
Simulation t = 167
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 167
Simulation t = 168
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 168
Simulation t = 169
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 169
Simulation t = 170
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 170
Simulation t = 171
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 171
Simulation t = 172
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 172
Simulation t = 173
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 173
Simulation t = 174
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 174
Simulation t = 175
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 175
Simulation t = 176
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 176
Simulation t = 177
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 177
Simulation t = 178
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 178
Simulation t = 179
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 179
Simulation t = 180
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 180
Simulation t = 181
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 181
Simulation t = 182
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 182
Simulation t = 183
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 183
Simulation t = 184
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 184
Simulation t = 185
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 185
Simulation t = 186
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 186
Simulation t = 187
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 187
Simulation t = 188
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 188
Simulation t = 189
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 189
Simulation t = 190
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 190
Simulation t = 191
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 191
Simulation t = 192
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 192
Simulation t = 193
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 193
Simulation t = 194
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 194
Simulation t = 195
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 195
Simulation t = 196
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 196
Simulation t = 197
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 197
Simulation t = 198
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 198
Simulation t = 199
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 199
Simulation t = 200
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 200
Simulation t = 201
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 201
Simulation t = 202
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 202
Simulation t = 203
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 203
Simulation t = 204
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 204
Simulation t = 205
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 205
Simulation t = 206
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 206
Simulation t = 207
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 207
Simulation t = 208
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 208
Simulation t = 209
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 209
Simulation t = 210
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 210
Simulation t = 211
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 211
Simulation t = 212
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 212
Simulation t = 213
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 213
Simulation t = 214
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 214
Simulation t = 215
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 215
Simulation t = 216
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 216
Simulation t = 217
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 217
Simulation t = 218
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 218
Simulation t = 219
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 219
Simulation t = 220
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 220
Simulation t = 221
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 221
Simulation t = 222
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 222
Simulation t = 223
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 223
Simulation t = 224
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 224
Simulation t = 225
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 225
Simulation t = 226
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 226
Simulation t = 227
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 227
Simulation t = 228
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 228
Simulation t = 229
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 229
Simulation t = 230
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 230
Simulation t = 231
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 231
Simulation t = 232
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 232
Simulation t = 233
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 233
Simulation t = 234
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 234
Simulation t = 235
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 235
Simulation t = 236
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 236
Simulation t = 237
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 237
Simulation t = 238
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 238
Simulation t = 239
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 239
Simulation t = 240
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 240
Simulation t = 241
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 241
Simulation t = 242
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 242
Simulation t = 243
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 243
Simulation t = 244
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 244
Simulation t = 245
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 245
Simulation t = 246
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 246
Simulation t = 247
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 247
Simulation t = 248
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 248
Simulation t = 249
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 249
Simulation t = 250
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 250
Simulation t = 251
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 251
Simulation t = 252
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 252
Simulation t = 253
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 253
Simulation t = 254
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 254
Simulation t = 255
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 255
Simulation t = 256
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 256
Simulation t = 257
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 257
Simulation t = 258
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 258
Simulation t = 259
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 259
Simulation t = 260
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 260
Simulation t = 261
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 261
Simulation t = 262
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 262
Simulation t = 263
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 263
Simulation t = 264
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 264
Simulation t = 265
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 265
Simulation t = 266
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 266
Simulation t = 267
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 267
Simulation t = 268
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 268
Simulation t = 269
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 269
Simulation t = 270
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 270
Simulation t = 271
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 271
Simulation t = 272
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 272
Simulation t = 273
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 273
Simulation t = 274
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 274
Simulation t = 275
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 275
Simulation t = 276
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 276
Simulation t = 277
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 277
Simulation t = 278
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 278
Simulation t = 279
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 279
Simulation t = 280
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 280
Simulation t = 281
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 281
Simulation t = 282
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 282
Simulation t = 283
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 283
Simulation t = 284
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 284
Simulation t = 285
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 285
Simulation t = 286
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 286
Simulation t = 287
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 287
Simulation t = 288
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 288
Simulation t = 289
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 289
Simulation t = 290
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 290
Simulation t = 291
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 291
Simulation t = 292
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 292
Simulation t = 293
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 293
Simulation t = 294
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 294
Simulation t = 295
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 295
Simulation t = 296
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 296
Simulation t = 297
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 297
Simulation t = 298
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 298
Simulation t = 299
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 299
Simulation t = 300
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 300
Simulation t = 301
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 301
Simulation t = 302
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 302
Simulation t = 303
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 303
Simulation t = 304
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 304
Simulation t = 305
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 305
Simulation t = 306
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 306
Simulation t = 307
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 307
Simulation t = 308
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 308
Simulation t = 309
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 309
Simulation t = 310
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 310
Simulation t = 311
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 311
Simulation t = 312
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 312
Simulation t = 313
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 313
Simulation t = 314
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 314
Simulation t = 315
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 315
Simulation t = 316
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 316
Simulation t = 317
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 317
Simulation t = 318
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 318
Simulation t = 319
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 319
Simulation t = 320
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 320
Simulation t = 321
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 321
Simulation t = 322
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 322
Simulation t = 323
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 323
Simulation t = 324
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 324
Simulation t = 325
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 325
Simulation t = 326
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 326
Simulation t = 327
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 327
Simulation t = 328
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 328
Simulation t = 329
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 329
Simulation t = 330
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 330
Simulation t = 331
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 331
Simulation t = 332
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 332
Simulation t = 333
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 333
Simulation t = 334
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 334
Simulation t = 335
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 335
Simulation t = 336
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 336
Simulation t = 337
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 337
Simulation t = 338
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 338
Simulation t = 339
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 339
Simulation t = 340
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 340
Simulation t = 341
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 341
Simulation t = 342
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 342
Simulation t = 343
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 343
Simulation t = 344
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 344
Simulation t = 345
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 345
Simulation t = 346
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 346
Simulation t = 347
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 347
Simulation t = 348
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 348
Simulation t = 349
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 349
Simulation t = 350
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 350
Simulation t = 351
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 351
Simulation t = 352
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 352
Simulation t = 353
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 353
Simulation t = 354
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 354
Simulation t = 355
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 355
Simulation t = 356
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 356
Simulation t = 357
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 357
Simulation t = 358
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 358
Simulation t = 359
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 359
Simulation t = 360
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 360
Simulation t = 361
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 361
Simulation t = 362
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 362
Simulation t = 363
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 363
Simulation t = 364
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 364
Simulation t = 365
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 365
Simulation t = 366
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 366
Simulation t = 367
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 367
Simulation t = 368
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 368
Simulation t = 369
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 369
Simulation t = 370
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 370
Simulation t = 371
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 371
Simulation t = 372
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 372
Simulation t = 373
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 373
Simulation t = 374
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 374
Simulation t = 375
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 375
Simulation t = 376
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 376
Simulation t = 377
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 377
Simulation t = 378
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 378
Simulation t = 379
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 379
Simulation t = 380
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 380
Simulation t = 381
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 381
Simulation t = 382
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 382
Simulation t = 383
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 383
Simulation t = 384
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 384
Simulation t = 385
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 385
Simulation t = 386
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 386
Simulation t = 387
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 387
Simulation t = 388
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 388
Simulation t = 389
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 389
Simulation t = 390
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 390
Simulation t = 391
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 391
Simulation t = 392
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 392
Simulation t = 393
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 393
Simulation t = 394
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 394
Simulation t = 395
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 395
Simulation t = 396
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 396
Simulation t = 397
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 397
Simulation t = 398
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 398
Simulation t = 399
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 399
Simulation t = 400
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 400
Simulation t = 401
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 401
Simulation t = 402
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 402
Simulation t = 403
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 403
Simulation t = 404
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 404
Simulation t = 405
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 405
Simulation t = 406
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 406
Simulation t = 407
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 407
Simulation t = 408
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 408
Simulation t = 409
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 409
Simulation t = 410
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 410
Simulation t = 411
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 411
Simulation t = 412
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 412
Simulation t = 413
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 413
Simulation t = 414
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 414
Simulation t = 415
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 415
Simulation t = 416
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 416
Simulation t = 417
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 417
Simulation t = 418
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 418
Simulation t = 419
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 419
Simulation t = 420
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 420
Simulation t = 421
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 421
Simulation t = 422
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 422
Simulation t = 423
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 423
Simulation t = 424
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 424
Simulation t = 425
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 425
Simulation t = 426
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 426
Simulation t = 427
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 427
Simulation t = 428
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 428
Simulation t = 429
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 429
Simulation t = 430
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 430
Simulation t = 431
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 431
Simulation t = 432
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 432
Simulation t = 433
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 433
Simulation t = 434
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 434
Simulation t = 435
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 435
Simulation t = 436
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 436
Simulation t = 437
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 437
Simulation t = 438
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 438
Simulation t = 439
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 439
Simulation t = 440
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 440
Simulation t = 441
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 441
Simulation t = 442
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 442
Simulation t = 443
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 443
Simulation t = 444
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 444
Simulation t = 445
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 445
Simulation t = 446
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 446
Simulation t = 447
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 447
Simulation t = 448
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 448
Simulation t = 449
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 449
Simulation t = 450
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 450
Simulation t = 451
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 451
Simulation t = 452
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 452
Simulation t = 453
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 453
Simulation t = 454
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 454
Simulation t = 455
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 455
Simulation t = 456
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 456
Simulation t = 457
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 457
Simulation t = 458
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 458
Simulation t = 459
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 459
Simulation t = 460
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 460
Simulation t = 461
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 461
Simulation t = 462
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 462
Simulation t = 463
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 463
Simulation t = 464
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 464
Simulation t = 465
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 465
Simulation t = 466
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 466
Simulation t = 467
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 467
Simulation t = 468
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 468
Simulation t = 469
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 469
Simulation t = 470
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 470
Simulation t = 471
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 471
Simulation t = 472
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 472
Simulation t = 473
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 473
Simulation t = 474
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 474
Simulation t = 475
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 475
Simulation t = 476
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 476
Simulation t = 477
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 477
Simulation t = 478
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 478
Simulation t = 479
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 479
Simulation t = 480
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 480
Simulation t = 481
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 481
Simulation t = 482
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 482
Simulation t = 483
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 483
Simulation t = 484
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 484
Simulation t = 485
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 485
Simulation t = 486
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 486
Simulation t = 487
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 487
Simulation t = 488
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 488
Simulation t = 489
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 489
Simulation t = 490
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 490
Simulation t = 491
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 491
Simulation t = 492
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 492
Simulation t = 493
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 493
Simulation t = 494
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 494
Simulation t = 495
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 495
Simulation t = 496
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 496
Simulation t = 497
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 497
Simulation t = 498
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 498
Simulation t = 499
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 499
Simulation t = 500
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 500
Simulation t = 501
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 501
Simulation t = 502
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 502
Simulation t = 503
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 503
Simulation t = 504
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 504
Simulation t = 505
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 505
Simulation t = 506
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 506
Simulation t = 507
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 507
Simulation t = 508
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 508
Simulation t = 509
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 509
Simulation t = 510
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 510
Simulation t = 511
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 511
Simulation t = 512
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 512
Simulation t = 513
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 513
Simulation t = 514
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 514
Simulation t = 515
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 515
Simulation t = 516
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 516
Simulation t = 517
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 517
Simulation t = 518
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 518
Simulation t = 519
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 519
Simulation t = 520
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 520
Simulation t = 521
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 521
Simulation t = 522
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 522
Simulation t = 523
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 523
Simulation t = 524
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 524
Simulation t = 525
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 525
Simulation t = 526
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 526
Simulation t = 527
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 527
Simulation t = 528
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 528
Simulation t = 529
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 529
Simulation t = 530
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 530
Simulation t = 531
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 531
Simulation t = 532
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 532
Simulation t = 533
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 533
Simulation t = 534
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 534
Simulation t = 535
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 535
Simulation t = 536
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 536
Simulation t = 537
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 537
Simulation t = 538
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 538
Simulation t = 539
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 539
Simulation t = 540
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 540
Simulation t = 541
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 541
Simulation t = 542
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 542
Simulation t = 543
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 543
Simulation t = 544
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 544
Simulation t = 545
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 545
Simulation t = 546
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 546
Simulation t = 547
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 547
Simulation t = 548
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 548
Simulation t = 549
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 549
Simulation t = 550
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 550
Simulation t = 551
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 551
Simulation t = 552
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 552
Simulation t = 553
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 553
Simulation t = 554
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 554
Simulation t = 555
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 555
Simulation t = 556
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 556
Simulation t = 557
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 557
Simulation t = 558
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 558
Simulation t = 559
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 559
Simulation t = 560
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 560
Simulation t = 561
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 561
Simulation t = 562
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 562
Simulation t = 563
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 563
Simulation t = 564
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 564
Simulation t = 565
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 565
Simulation t = 566
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 566
Simulation t = 567
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 567
Simulation t = 568
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 568
Simulation t = 569
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 569
Simulation t = 570
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 570
Simulation t = 571
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 571
Simulation t = 572
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 572
Simulation t = 573
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 573
Simulation t = 574
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 574
Simulation t = 575
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 575
Simulation t = 576
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 576
Simulation t = 577
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 577
Simulation t = 578
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 578
Simulation t = 579
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 579
Simulation t = 580
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 580
Simulation t = 581
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 581
Simulation t = 582
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 582
Simulation t = 583
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 583
Simulation t = 584
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 584
Simulation t = 585
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 585
Simulation t = 586
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 586
Simulation t = 587
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 587
Simulation t = 588
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 588
Simulation t = 589
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 589
Simulation t = 590
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 590
Simulation t = 591
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 591
Simulation t = 592
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 592
Simulation t = 593
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 593
Simulation t = 594
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 594
Simulation t = 595
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 595
Simulation t = 596
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 596
Simulation t = 597
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 597
Simulation t = 598
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 598
Simulation t = 599
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 599
Simulation t = 600
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 600
Simulation t = 601
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 601
Simulation t = 602
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 602
Simulation t = 603
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 603
Simulation t = 604
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 604
Simulation t = 605
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 605
Simulation t = 606
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 606
Simulation t = 607
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 607
Simulation t = 608
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 608
Simulation t = 609
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 609
Simulation t = 610
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 610
Simulation t = 611
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 611
Simulation t = 612
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 612
Simulation t = 613
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 613
Simulation t = 614
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 614
Simulation t = 615
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 615
Simulation t = 616
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 616
Simulation t = 617
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 617
Simulation t = 618
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 618
Simulation t = 619
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 619
Simulation t = 620
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 620
Simulation t = 621
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 621
Simulation t = 622
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 622
Simulation t = 623
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 623
Simulation t = 624
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 624
Simulation t = 625
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 625
Simulation t = 626
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 626
Simulation t = 627
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 627
Simulation t = 628
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 628
Simulation t = 629
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 629
Simulation t = 630
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 630
Simulation t = 631
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 631
Simulation t = 632
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 632
Simulation t = 633
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 633
Simulation t = 634
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 634
Simulation t = 635
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 635
Simulation t = 636
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 636
Simulation t = 637
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 637
Simulation t = 638
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 638
Simulation t = 639
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 639
Simulation t = 640
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 640
Simulation t = 641
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 641
Simulation t = 642
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 642
Simulation t = 643
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 643
Simulation t = 644
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 644
Simulation t = 645
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 645
Simulation t = 646
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 646
Simulation t = 647
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 647
Simulation t = 648
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 648
Simulation t = 649
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 649
Simulation t = 650
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 650
Simulation t = 651
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 651
Simulation t = 652
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 652
Simulation t = 653
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 653
Simulation t = 654
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 654
Simulation t = 655
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 655
Simulation t = 656
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 656
Simulation t = 657
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 657
Simulation t = 658
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 658
Simulation t = 659
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 659
Simulation t = 660
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 660
Simulation t = 661
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 661
Simulation t = 662
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 662
Simulation t = 663
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 663
Simulation t = 664
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 664
Simulation t = 665
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 665
Simulation t = 666
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 666
Simulation t = 667
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 667
Simulation t = 668
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 668
Simulation t = 669
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 669
Simulation t = 670
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 670
Simulation t = 671
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 671
Simulation t = 672
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 672
Simulation t = 673
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 673
Simulation t = 674
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 674
Simulation t = 675
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 675
Simulation t = 676
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 676
Simulation t = 677
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 677
Simulation t = 678
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 678
Simulation t = 679
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 679
Simulation t = 680
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 680
Simulation t = 681
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 681
Simulation t = 682
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 682
Simulation t = 683
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 683
Simulation t = 684
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 684
Simulation t = 685
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 685
Simulation t = 686
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 686
Simulation t = 687
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 687
Simulation t = 688
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 688
Simulation t = 689
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 689
Simulation t = 690
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 690
Simulation t = 691
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 691
Simulation t = 692
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 692
Simulation t = 693
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 693
Simulation t = 694
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 694
Simulation t = 695
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 695
Simulation t = 696
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 696
Simulation t = 697
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 697
Simulation t = 698
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 698
Simulation t = 699
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 699
Simulation t = 700
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 700
Simulation t = 701
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 701
Simulation t = 702
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 702
Simulation t = 703
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 703
Simulation t = 704
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 704
Simulation t = 705
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 705
Simulation t = 706
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 706
Simulation t = 707
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 707
Simulation t = 708
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 708
Simulation t = 709
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 709
Simulation t = 710
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 710
Simulation t = 711
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 711
Simulation t = 712
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 712
Simulation t = 713
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 713
Simulation t = 714
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 714
Simulation t = 715
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 715
Simulation t = 716
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 716
Simulation t = 717
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 717
Simulation t = 718
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 718
Simulation t = 719
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 719
Simulation t = 720
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 720
Simulation t = 721
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 721
Simulation t = 722
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 722
Simulation t = 723
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 723
Simulation t = 724
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 724
Simulation t = 725
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 725
Simulation t = 726
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 726
Simulation t = 727
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 727
Simulation t = 728
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 728
Simulation t = 729
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 729
Simulation t = 730
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 730
Simulation t = 731
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 731
Simulation t = 732
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 732
Simulation t = 733
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 733
Simulation t = 734
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 734
Simulation t = 735
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 735
Simulation t = 736
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 736
Simulation t = 737
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 737
Simulation t = 738
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 738
Simulation t = 739
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 739
Simulation t = 740
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 740
Simulation t = 741
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 741
Simulation t = 742
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 742
Simulation t = 743
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 743
Simulation t = 744
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 744
Simulation t = 745
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 745
Simulation t = 746
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 746
Simulation t = 747
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 747
Simulation t = 748
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 748
Simulation t = 749
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 749
Simulation t = 750
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 750
Simulation t = 751
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 751
Simulation t = 752
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 752
Simulation t = 753
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 753
Simulation t = 754
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 754
Simulation t = 755
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 755
Simulation t = 756
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 756
Simulation t = 757
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 757
Simulation t = 758
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 758
Simulation t = 759
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 759
Simulation t = 760
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 760
Simulation t = 761
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 761
Simulation t = 762
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 762
Simulation t = 763
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 763
Simulation t = 764
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 764
Simulation t = 765
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 765
Simulation t = 766
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 766
Simulation t = 767
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 767
Simulation t = 768
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 768
Simulation t = 769
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 769
Simulation t = 770
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 770
Simulation t = 771
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 771
Simulation t = 772
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 772
Simulation t = 773
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 773
Simulation t = 774
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 774
Simulation t = 775
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 775
Simulation t = 776
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 776
Simulation t = 777
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 777
Simulation t = 778
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 778
Simulation t = 779
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 779
Simulation t = 780
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 780
Simulation t = 781
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 781
Simulation t = 782
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 782
Simulation t = 783
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 783
Simulation t = 784
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 784
Simulation t = 785
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 785
Simulation t = 786
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 786
Simulation t = 787
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 787
Simulation t = 788
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 788
Simulation t = 789
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 789
Simulation t = 790
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 790
Simulation t = 791
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 791
Simulation t = 792
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 792
Simulation t = 793
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 793
Simulation t = 794
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 794
Simulation t = 795
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 795
Simulation t = 796
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 796
Simulation t = 797
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 797
Simulation t = 798
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 798
Simulation t = 799
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 799
Simulation t = 800
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 800
Simulation t = 801
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 801
Simulation t = 802
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 802
Simulation t = 803
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 803
Simulation t = 804
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 804
Simulation t = 805
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 805
Simulation t = 806
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 806
Simulation t = 807
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 807
Simulation t = 808
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 808
Simulation t = 809
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 809
Simulation t = 810
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 810
Simulation t = 811
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 811
Simulation t = 812
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 812
Simulation t = 813
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 813
Simulation t = 814
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 814
Simulation t = 815
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 815
Simulation t = 816
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 816
Simulation t = 817
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 817
Simulation t = 818
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 818
Simulation t = 819
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 819
Simulation t = 820
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 820
Simulation t = 821
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 821
Simulation t = 822
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 822
Simulation t = 823
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 823
Simulation t = 824
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 824
Simulation t = 825
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 825
Simulation t = 826
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 826
Simulation t = 827
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 827
Simulation t = 828
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 828
Simulation t = 829
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 829
Simulation t = 830
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 830
Simulation t = 831
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 831
Simulation t = 832
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 832
Simulation t = 833
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 833
Simulation t = 834
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 834
Simulation t = 835
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 835
Simulation t = 836
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 836
Simulation t = 837
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 837
Simulation t = 838
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 838
Simulation t = 839
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 839
Simulation t = 840
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 840
Simulation t = 841
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 841
Simulation t = 842
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 842
Simulation t = 843
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 843
Simulation t = 844
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 844
Simulation t = 845
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 845
Simulation t = 846
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 846
Simulation t = 847
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 847
Simulation t = 848
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 848
Simulation t = 849
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 849
Simulation t = 850
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 850
Simulation t = 851
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 851
Simulation t = 852
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 852
Simulation t = 853
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 853
Simulation t = 854
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 854
Simulation t = 855
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 855
Simulation t = 856
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 856
Simulation t = 857
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 857
Simulation t = 858
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 858
Simulation t = 859
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 859
Simulation t = 860
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 860
Simulation t = 861
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 861
Simulation t = 862
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 862
Simulation t = 863
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 863
Simulation t = 864
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 864
Simulation t = 865
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 865
Simulation t = 866
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 866
Simulation t = 867
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 867
Simulation t = 868
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 868
Simulation t = 869
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 869
Simulation t = 870
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 870
Simulation t = 871
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 871
Simulation t = 872
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 872
Simulation t = 873
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 873
Simulation t = 874
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 874
Simulation t = 875
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 875
Simulation t = 876
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 876
Simulation t = 877
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 877
Simulation t = 878
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 878
Simulation t = 879
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 879
Simulation t = 880
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 880
Simulation t = 881
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 881
Simulation t = 882
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 882
Simulation t = 883
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 883
Simulation t = 884
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 884
Simulation t = 885
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 885
Simulation t = 886
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 886
Simulation t = 887
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 887
Simulation t = 888
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 888
Simulation t = 889
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 889
Simulation t = 890
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 890
Simulation t = 891
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 891
Simulation t = 892
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 892
Simulation t = 893
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 893
Simulation t = 894
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 894
Simulation t = 895
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 895
Simulation t = 896
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 896
Simulation t = 897
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 897
Simulation t = 898
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 898
Simulation t = 899
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 899
Simulation t = 900
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 900
Simulation t = 901
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 901
Simulation t = 902
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 902
Simulation t = 903
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 903
Simulation t = 904
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 904
Simulation t = 905
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 905
Simulation t = 906
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 906
Simulation t = 907
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 907
Simulation t = 908
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 908
Simulation t = 909
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 909
Simulation t = 910
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 910
Simulation t = 911
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 911
Simulation t = 912
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 912
Simulation t = 913
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 913
Simulation t = 914
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 914
Simulation t = 915
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 915
Simulation t = 916
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 916
Simulation t = 917
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 917
Simulation t = 918
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 918
Simulation t = 919
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 919
Simulation t = 920
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 920
Simulation t = 921
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 921
Simulation t = 922
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 922
Simulation t = 923
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 923
Simulation t = 924
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 924
Simulation t = 925
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 925
Simulation t = 926
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 926
Simulation t = 927
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 927
Simulation t = 928
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 928
Simulation t = 929
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 929
Simulation t = 930
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 930
Simulation t = 931
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 931
Simulation t = 932
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 932
Simulation t = 933
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 933
Simulation t = 934
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 934
Simulation t = 935
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 935
Simulation t = 936
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 936
Simulation t = 937
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 937
Simulation t = 938
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 938
Simulation t = 939
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 939
Simulation t = 940
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 940
Simulation t = 941
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 941
Simulation t = 942
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 942
Simulation t = 943
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 943
Simulation t = 944
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 944
Simulation t = 945
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 945
Simulation t = 946
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 946
Simulation t = 947
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 947
Simulation t = 948
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 948
Simulation t = 949
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 949
Simulation t = 950
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 950
Simulation t = 951
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 951
Simulation t = 952
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 952
Simulation t = 953
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 953
Simulation t = 954
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 954
Simulation t = 955
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 955
Simulation t = 956
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 956
Simulation t = 957
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 957
Simulation t = 958
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 958
Simulation t = 959
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 959
Simulation t = 960
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 960
Simulation t = 961
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 961
Simulation t = 962
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 962
Simulation t = 963
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 963
Simulation t = 964
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 964
Simulation t = 965
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 965
Simulation t = 966
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 966
Simulation t = 967
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 967
Simulation t = 968
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 968
Simulation t = 969
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 969
Simulation t = 970
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 970
Simulation t = 971
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 971
Simulation t = 972
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 972
Simulation t = 973
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 973
Simulation t = 974
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 974
Simulation t = 975
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 975
Simulation t = 976
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 976
Simulation t = 977
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 977
Simulation t = 978
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 978
Simulation t = 979
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 979
Simulation t = 980
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 980
Simulation t = 981
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 981
Simulation t = 982
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 982
Simulation t = 983
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 983
Simulation t = 984
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 984
Simulation t = 985
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 985
Simulation t = 986
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 986
Simulation t = 987
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 987
Simulation t = 988
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 988
Simulation t = 989
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 989
Simulation t = 990
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 990
Simulation t = 991
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 991
Simulation t = 992
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 992
Simulation t = 993
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 993
Simulation t = 994
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 994
Simulation t = 995
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 995
Simulation t = 996
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 996
Simulation t = 997
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 997
Simulation t = 998
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 998
Simulation t = 999
   - Randomize shocks
   - Merge openness data
   - Find nearest distance to HSR city for each city
   - Merge result 999
{txt}
{com}. 
. 
. 
. // save
. compress
{txt}  (0 bytes saved)

{com}. save "$dta_loc/q3c_lognd_i", replace
{txt}file //Client/C$/Users/yfkas/Dropbox (Personal)/ARE213/Pset3/data/q3c_lognd_i.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "$do_loc/Code/02_q3cii.do"
{txt}
{com}. /*
> Title:          02_q3c.do
> Purpose:        Question 3.c, PSet 3
> 
> Outline: Question 3.c.ii
> 
> Briefly describe how Assumptions A1–A3 allow you to construct 
> counterfactual 2016 railway networks (i.e., sets of lines) that 
> were as likely to have happened as the realized network. 
> 
> c.ii
> Report two corrected estimates of τ2: recentering by and controlling for μi. 
> Are they very different from your estimate in 3(b)? 
> What do you learn from this?
> 
> */
. 
. /*3.c.ii ----------------------------------------------------------------------
> Estimate (2) by OLS without controls */
. 
. eststo clear
{txt}
{com}. use "$dta_loc/q3c_lognd_i", clear
{txt}
{com}. 
. egen mu_i = rowmean(lognd_*)
{txt}
{com}. label var mu_i "Expected log nearest distance"
{txt}
{com}. drop lognd_*
{txt}
{com}. 
. // merge lognd from 3b
. merge 1:1 cityid using "$dta_loc/q3b_lognd", keepusing(lognd) assert(3) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             340{txt}  
{col 5}{hline 41}

{com}. // merge dependent variable
. merge 1:1 cityid using "$dta_loc/pset3_cities", nogen assert(3)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             340{txt}  
{col 5}{hline 41}

{com}. 
. // Approach 1: demeaned
. gen ztilde = lognd-mu_i
{txt}
{com}. label var lognd "Log nearest distance"
{txt}
{com}. label var ztilde "Log nearest distance (recentered)"
{txt}
{com}. label var empgrowth "Employment growth"
{txt}
{com}. 
. 
. /*Regressions -----------------------------------------------------------------
> */
. 
. // Approach 0: recall 3b results
. eststo: reg empgrowth lognd 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       275
{txt}{hline 13}{c +}{hline 34}   F(1, 273)       = {res}    38.05
{txt}       Model {c |} {res} 2.19897546         1  2.19897546   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 15.7773816       273  .057792607   {txt}R-squared       ={res}    0.1223
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1191
{txt}       Total {c |} {res}  17.976357       274  .065607143   {txt}Root MSE        =   {res}  .2404

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   empgrowth{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lognd {c |}{col 14}{res}{space 2}-.1331077{col 26}{space 2} .0215789{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-.1755898{col 67}{space 3}-.0906255
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8279967{col 26}{space 2} .0922075{col 37}{space 1}    8.98{col 46}{space 3}0.000{col 54}{space 4} .6464686{col 67}{space 3} 1.009525
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. 
. // Approach 1: demeaned
. eststo: reg empgrowth ztilde // recentering

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       275
{txt}{hline 13}{c +}{hline 34}   F(1, 273)       = {res}     9.31
{txt}       Model {c |} {res} .593007441         1  .593007441   {txt}Prob > F        ={res}    0.0025
{txt}    Residual {c |} {res} 17.3833496       273  .063675273   {txt}R-squared       ={res}    0.0330
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0294
{txt}       Total {c |} {res}  17.976357       274  .065607143   {txt}Root MSE        =   {res} .25234

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   empgrowth{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ztilde {c |}{col 14}{res}{space 2}-.1474426{col 26}{space 2} .0483146{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.2425592{col 67}{space 3}-.0523261
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2678817{col 26}{space 2} .0152255{col 37}{space 1}   17.59{col 46}{space 3}0.000{col 54}{space 4} .2379073{col 67}{space 3}  .297856
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{com}. 
. // Approach 2: control function
. eststo: reg empgrowth lognd mu_i // controlling

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       275
{txt}{hline 13}{c +}{hline 34}   F(2, 272)       = {res}    19.12
{txt}       Model {c |} {res}  2.2159479         2  1.10797395   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 15.7604091       272  .057942681   {txt}R-squared       ={res}    0.1233
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1168
{txt}       Total {c |} {res}  17.976357       274  .065607143   {txt}Root MSE        =   {res} .24071

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   empgrowth{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lognd {c |}{col 14}{res}{space 2}-.1107576{col 26}{space 2} .0466068{col 37}{space 1}   -2.38{col 46}{space 3}0.018{col 54}{space 4}-.2025136{col 67}{space 3}-.0190017
{txt}{space 8}mu_i {c |}{col 14}{res}{space 2}-.0309002{col 26}{space 2} .0570938{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4}-.1433021{col 67}{space 3} .0815017
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8637452{col 26}{space 2} .1135216{col 37}{space 1}    7.61{col 46}{space 3}0.000{col 54}{space 4} .6402525{col 67}{space 3} 1.087238
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

{com}. 
. // Q3 table
. esttab using "$do_loc/Tables/table_3c.tex",                     ///
>         style(tex)                                                                                      ///
>         nogaps                                                                                          ///
>         nobaselevels                                                                            ///
>         label                                                                                   ///
>         varwidth(50)                                                                            ///
>         wrap                                                                                            ///
>         cells (b(fmt(2)) se(fmt(2) par))                                        ///
>         stats(N,                                                                                        ///
>                   fmt(%9.0f)                                                                    ///
>                   labels("Observations"))       ///
>         eqlabel(none) ///
>         replace
{res}{txt}(output written to {browse  `"//Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 3/Stata/Tables/table_3c.tex"'})

{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}//Client/C$/Users/yfkas/Documents/GitHub/ARE213_Fall2023/PSet 3/Stata/pset3_logfile.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Nov 2023, 12:31:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}